$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.3.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libefa.so.1.3.51.0',
          'LibraryVersion' => 'efa',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '51713' => {
                                         'Header' => undef,
                                         'Line' => '2440',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ibvah',
                                                               'type' => '10272'
                                                             },
                                                      '1' => {
                                                               'name' => 'attr',
                                                               'type' => '52217'
                                                             },
                                                      '2' => {

                                                    },
                                         'Return' => '152',
                                         'ShortName' => 'efadv_query_mr'
                                       },
                            '86685' => {
                                         'Header' => undef,
                                         'Line' => '145',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ibvctx',
                                                               'type' => '3883'
                                                             },
                                                      '1' => {
                                                               'name' => 'attr',
                                                               'type' => '87209'
                                                             },
                                                      '2' => {
                                                               'name' => 'inlen',
                                                               'type' => '2222'
                                                             }
                                                    },
                                         'Return' => '152',
                                         'ShortName' => 'efadv_query_device'
                                       }
                          },
          'SymbolVersion' => {
                               'efadv_cq_from_ibv_cq_ex' => 'efadv_cq_from_ibv_cq_ex@@EFA_1.2',
                               'efadv_create_cq' => 'efadv_create_cq@@EFA_1.2',
                               'efadv_create_driver_qp' => 'efadv_create_driver_qp@@EFA_1.0',
                               'efadv_create_qp_ex' => 'efadv_create_qp_ex@@EFA_1.1',
                               'efadv_query_ah' => 'efadv_query_ah@@EFA_1.1',
                               'efadv_query_device' => 'efadv_query_device@@EFA_1.1',
                               'efadv_query_mr' => 'efadv_query_mr@@EFA_1.3'
                             },
          'Symbols' => {
                         'libefa.so.1.3.51.0' => {
                                                   'efadv_cq_from_ibv_cq_ex@@EFA_1.2' => 1,
                                                   'efadv_create_cq@@EFA_1.2' => 1,
                                                   'efadv_create_driver_qp@@EFA_1.0' => 1,
                                                   'efadv_create_qp_ex@@EFA_1.1' => 1,
                                                   'efadv_query_ah@@EFA_1.1' => 1,
                                                   'efadv_query_device@@EFA_1.1' => 1,
                                                   'efadv_query_mr@@EFA_1.3' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10031' => {
                                       'Header' => undef,
                                       'Line' => '1160',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '2378'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10064' => {
                                       'Header' => undef,
                                       'Line' => '1165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10102' => {
                                       'Header' => undef,
                                       'Line' => '1169',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '2234'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '22',
                                                            'type' => '2234'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '36',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10168' => {
                                       'Header' => undef,
                                       'Line' => '1175',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '10272'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '2222'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '18',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10218' => {
                                       'Header' => undef,
                                       'Line' => '1694',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3883'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '7612'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '22',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10272' => {
                                       'BaseType' => '10218',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10277' => {
                                       'Header' => undef,
                                       'Line' => '1164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '10064'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '10102'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '10168'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '10321' => {
                                       'Header' => undef,
                                       'Line' => '1182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10345' => {
                                       'Header' => undef,
                                       'Line' => '1181',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '10321'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10366' => {
                                       'Header' => undef,
                                       'Line' => '1187',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '10416'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2222'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '22',
                                                            'type' => '7244'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10416' => {
                                       'BaseType' => '7646',
                                       'Name' => 'struct ibv_mw*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10421' => {
                                       'Header' => undef,
                                       'Line' => '1192',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '78'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '2210'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '16',
                                                            'type' => '2210'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10471' => {
                                       'Header' => undef,
                                       'Line' => '1186',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '10366'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '10421'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10504' => {
                                       'Header' => undef,
                                       'Line' => '1150',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10640'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '22',
                                                            'type' => '10645'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '40',
                                                            'type' => '9822'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '50',
                                                            'type' => '66'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '54',
                                                            'type' => '10031'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '64',
                                                            'type' => '10277'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '114',
                                                            'type' => '10345'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '128',
                                                            'type' => '10471'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '10640' => {
                                       'BaseType' => '10504',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10645' => {
                                       'BaseType' => '9970',
                                       'Name' => 'struct ibv_sge*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10650' => {
                                       'Header' => undef,
                                       'Line' => '1200',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10720'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '22',
                                                            'type' => '10645'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_recv_wr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10720' => {
                                       'BaseType' => '10650',
                                       'Name' => 'struct ibv_recv_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10977' => {
                                       'Header' => undef,
                                       'Line' => '1236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '8',
                                                            'type' => '66'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '22',
                                                            'type' => '7244'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11058' => {
                                       'BaseType' => '10720',
                                       'Name' => 'struct ibv_recv_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '116' => {
                                     'BaseType' => '80',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '12012' => {
                                       'Header' => undef,
                                       'Line' => '1501',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3883'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12066' => {
                                       'BaseType' => '12012',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12071' => {
                                       'Header' => undef,
                                       'Line' => '1520',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_poll_cq_attr',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '12099' => {
                                       'Header' => undef,
                                       'Line' => '1524',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tag',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wc_tm_info',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12140' => {
                                       'Header' => undef,
                                       'Line' => '1529',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3883'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '12066'
                                                          },
                                                   '10' => {
                                                             'name' => 'status',
                                                             'offset' => '306',
                                                             'type' => '6596'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '310',
                                                             'type' => '2234'
                                                           },
                                                   '12' => {
                                                             'name' => 'start_poll',
                                                             'offset' => '324',
                                                             'type' => '12608'
                                                           },
                                                   '13' => {
                                                             'name' => 'next_poll',
                                                             'offset' => '338',
                                                             'type' => '12628'
                                                           },
                                                   '14' => {
                                                             'name' => 'end_poll',
                                                             'offset' => '352',
                                                             'type' => '12644'
                                                           },
                                                   '15' => {
                                                             'name' => 'read_opcode',
                                                             'offset' => '360',
                                                             'type' => '12664'
                                                           },
                                                   '16' => {
                                                             'name' => 'read_vendor_err',
                                                             'offset' => '374',
                                                             'type' => '12684'
                                                           },
                                                   '17' => {
                                                             'name' => 'read_byte_len',
                                                             'offset' => '388',
                                                             'type' => '12684'
                                                           },
                                                   '18' => {
                                                             'name' => 'read_imm_data',
                                                             'offset' => '402',
                                                             'type' => '12704'
                                                           },
                                                   '19' => {
                                                             'name' => 'read_qp_num',
                                                             'offset' => '512',
                                                             'type' => '12684'
                                                           },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '22',
                                                            'type' => '78'
                                                          },
                                                   '20' => {
                                                             'name' => 'read_src_qp',
                                                             'offset' => '520',
                                                             'type' => '12684'
                                                           },
                                                   '21' => {
                                                             'name' => 'read_wc_flags',
                                                             'offset' => '534',
                                                             'type' => '12724'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_slid',
                                                             'offset' => '548',
                                                             'type' => '12684'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_sl',
                                                             'offset' => '562',
                                                             'type' => '12744'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_dlid_path_bits',
                                                             'offset' => '576',
                                                             'type' => '12744'
                                                           },
                                                   '25' => {
                                                             'name' => 'read_completion_ts',
                                                             'offset' => '584',
                                                             'type' => '12764'
                                                           },
                                                   '26' => {
                                                             'name' => 'read_cvlan',
                                                             'offset' => '598',
                                                             'type' => '12784'
                                                           },
                                                   '27' => {
                                                             'name' => 'read_flow_tag',
                                                             'offset' => '612',
                                                             'type' => '12684'
                                                           },
                                                   '28' => {
                                                             'name' => 'read_tm_info',
                                                             'offset' => '626',
                                                             'type' => '12810'
                                                           },
                                                   '29' => {
                                                             'name' => 'read_completion_wallclock_ns',
                                                             'offset' => '640',
                                                             'type' => '12764'
                                                           },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '36',
                                                            'type' => '2222'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '40',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '50',
                                                            'type' => '774'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '114',
                                                            'type' => '848'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '288',
                                                            'type' => '2222'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '292',
                                                            'type' => '2222'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '296',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_ex',
                                       'Size' => '288',
                                       'Type' => 'Struct'
                                     },
                          '12598' => {
                                       'BaseType' => '12140',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12603' => {
                                       'BaseType' => '12071',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12608' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           },
                                                    '1' => {
                                                             'type' => '12603'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12628' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12644' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12664' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '6757',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12684' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '2222',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12704' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '2378',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12724' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '66',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12744' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '2198',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12764' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '2234',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12784' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           }
                                                  },
                                       'Return' => '2210',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12805' => {
                                       'BaseType' => '12099',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12810' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12598'
                                                           },
                                                    '1' => {
                                                             'type' => '12805'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13327' => {
                                       'Header' => undef,
                                       'Line' => '1967',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '13513'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '13529'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13389' => {
                                       'BaseType' => '13394',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13394' => {
                                       'Header' => undef,
                                       'Line' => '1977',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '13327'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '3483'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '3547'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '4497'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '4497'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '13560'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '13560'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '13513' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '13389'
                                                           },
                                                    '1' => {
                                                             'type' => '152'
                                                           }
                                                  },
                                       'Return' => '3883',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13529' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3883'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13560' => {
                                       'BaseType' => '241',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '13576' => {
                                       'Header' => undef,
                                       'Line' => '1992',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '14064'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '14104'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '14114'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '14229'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '14254'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '14114'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '14114'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '14114'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '14114'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '14114'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '14114'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '14114'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '14114'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '14284'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '14114'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '14114'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '14114'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '14114'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '14319'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '14349'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '14114'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '14114'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '14114'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '14114'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '14114'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '14114'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '14114'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '14114'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '14114'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '14139'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '14174'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '14194'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '140' => {
                                     'BaseType' => '92',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '14059' => {
                                       'BaseType' => '3963',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14064' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3883'
                                                           },
                                                    '1' => {
                                                             'type' => '14059'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14094' => {
                                       'BaseType' => '14099',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14099' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '14104' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3883'
                                                           },
                                                    '1' => {
                                                             'type' => '2198'
                                                           },
                                                    '2' => {
                                                             'type' => '14094'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14114' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14139' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7612'
                                                           },
                                                    '1' => {
                                                             'type' => '7617'
                                                           }
                                                  },
                                       'Return' => '10416',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14169' => {
                                       'BaseType' => '10977',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14174' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6237'
                                                           },
                                                    '1' => {
                                                             'type' => '10416'
                                                           },
                                                    '2' => {
                                                             'type' => '14169'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14194' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10416'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14224' => {
                                       'BaseType' => '7058',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14229' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6039'
                                                           },
                                                    '1' => {
                                                             'type' => '152'
                                                           },
                                                    '2' => {
                                                             'type' => '14224'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14254' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6039'
                                                           },
                                                    '1' => {
                                                             'type' => '152'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14284' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6352'
                                                           },
                                                    '1' => {
                                                             'type' => '10720'
                                                           },
                                                    '2' => {
                                                             'type' => '11058'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14314' => {
                                       'BaseType' => '10640',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14319' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6237'
                                                           },
                                                    '1' => {
                                                             'type' => '10640'
                                                           },
                                                    '2' => {
                                                             'type' => '14314'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14349' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6237'
                                                           },
                                                    '1' => {
                                                             'type' => '10720'
                                                           },
                                                    '2' => {
                                                             'type' => '11058'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14354' => {
                                       'Header' => undef,
                                       'Line' => '2055',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '2222'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '78'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '22',
                                                            'type' => '12066'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '36',
                                                            'type' => '2222'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '50',
                                                            'type' => '2234'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2222'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '68',
                                                            'type' => '2222'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '72',
                                                            'type' => '7612'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '152' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '16156' => {
                                       'BaseType' => '14354',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16327' => {
                                       'BaseType' => '8952',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '169' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '19200' => {
                                       'BaseType' => '8767',
                                       'Name' => 'struct ibv_qp_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '193' => {
                                     'BaseType' => '54',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2198' => {
                                      'BaseType' => '116',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '2210' => {
                                      'BaseType' => '140',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2222' => {
                                      'BaseType' => '169',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2234' => {
                                      'BaseType' => '193',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2354' => {
                                      'BaseType' => '66',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2366' => {
                                      'BaseType' => '392',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2378' => {
                                      'BaseType' => '2354',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2390' => {
                                      'BaseType' => '2366',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '241' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3388' => {
                                      'Header' => undef,
                                      'Line' => '66',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'subnet_prefix',
                                                           'offset' => '0',
                                                           'type' => '2390'
                                                         },
                                                  '1' => {
                                                           'name' => 'interface_id',
                                                           'offset' => '8',
                                                           'type' => '2390'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3424' => {
                                      'Header' => undef,
                                      'Line' => '64',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'raw',
                                                           'offset' => '0',
                                                           'type' => '3467'
                                                         },
                                                  '1' => {
                                                           'name' => 'global',
                                                           'offset' => '0',
                                                           'type' => '3388'
                                                         }
                                                },
                                      'Name' => 'union ibv_gid',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '3467' => {
                                      'BaseType' => '2198',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '3483' => {
                                      'Header' => undef,
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3547' => {
                                      'Header' => undef,
                                      'Line' => '105',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3599' => {
                                      'Header' => undef,
                                      'Line' => '154',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3766' => {
                                      'Header' => undef,
                                      'Line' => '2035',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '13389'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '13576'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '612',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '616',
                                                           'type' => '152'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '626',
                                                           'type' => '152'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '640',
                                                           'type' => '774'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '800',
                                                           'type' => '78'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '38333' => {
                                       'BaseType' => '2198',
                                       'Name' => 'uint8_t[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '3883' => {
                                      'BaseType' => '3766',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '392' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '3963' => {
                                      'Header' => undef,
                                      'Line' => '181',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '4497'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '100',
                                                           'type' => '2390'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '278',
                                                            'type' => '66'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '288',
                                                            'type' => '152'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '292',
                                                            'type' => '152'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '296',
                                                            'type' => '152'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '306',
                                                            'type' => '152'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '310',
                                                            'type' => '152'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '320',
                                                            'type' => '152'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '324',
                                                            'type' => '152'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '328',
                                                            'type' => '152'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '338',
                                                            'type' => '152'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '114',
                                                           'type' => '2390'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '342',
                                                            'type' => '152'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '352',
                                                            'type' => '152'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '356',
                                                            'type' => '3599'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '360',
                                                            'type' => '152'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '370',
                                                            'type' => '152'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '374',
                                                            'type' => '152'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '384',
                                                            'type' => '152'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '388',
                                                            'type' => '152'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '392',
                                                            'type' => '152'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '402',
                                                            'type' => '152'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '128',
                                                           'type' => '2234'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '406',
                                                            'type' => '152'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '512',
                                                            'type' => '152'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '516',
                                                            'type' => '152'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '520',
                                                            'type' => '152'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '530',
                                                            'type' => '152'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '534',
                                                            'type' => '152'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '544',
                                                            'type' => '152'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '548',
                                                            'type' => '2210'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '550',
                                                            'type' => '2198'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '551',
                                                            'type' => '2198'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '136',
                                                           'type' => '2234'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '150',
                                                           'type' => '2222'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '256',
                                                           'type' => '2222'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '260',
                                                           'type' => '2222'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '264',
                                                           'type' => '152'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '274',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '42' => {
                                    'BaseType' => '54',
                                    'Header' => undef,
                                    'Line' => '214',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4497' => {
                                      'BaseType' => '241',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '48040' => {
                                       'Header' => undef,
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'driver_qp_type',
                                                            'offset' => '8',
                                                            'type' => '2222'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '18',
                                                            'type' => '48093'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_qp_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '48093' => {
                                       'BaseType' => '2198',
                                       'Name' => 'uint8_t[4]',
                                       'Size' => '4',
                                       'Type' => 'Array'
                                     },
                          '48146' => {
                                       'Header' => undef,
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_sq_wr',
                                                            'offset' => '8',
                                                            'type' => '2222'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_rq_wr',
                                                            'offset' => '18',
                                                            'type' => '2222'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_sq_sge',
                                                            'offset' => '22',
                                                            'type' => '2210'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_rq_sge',
                                                            'offset' => '24',
                                                            'type' => '2210'
                                                          },
                                                   '5' => {
                                                            'name' => 'inline_buf_size',
                                                            'offset' => '32',
                                                            'type' => '2210'
                                                          },
                                                   '6' => {
                                                            'name' => 'reserved',
                                                            'offset' => '34',
                                                            'type' => '48277'
                                                          },
                                                   '7' => {
                                                            'name' => 'device_caps',
                                                            'offset' => '36',
                                                            'type' => '2222'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_rdma_size',
                                                            'offset' => '40',
                                                            'type' => '2222'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_device_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '48277' => {
                                       'BaseType' => '2198',
                                       'Name' => 'uint8_t[2]',
                                       'Size' => '2',
                                       'Type' => 'Array'
                                     },
                          '48293' => {
                                       'Header' => undef,
                                       'Line' => '61',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'ahn',
                                                            'offset' => '8',
                                                            'type' => '2210'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '16',
                                                            'type' => '38333'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_ah_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '48346' => {
                                       'Header' => undef,
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'wc_read_sgid',
                                                            'offset' => '8',
                                                            'type' => '48416'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_cq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '48406' => {
                                       'BaseType' => '48346',
                                       'Name' => 'struct efadv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48411' => {
                                       'BaseType' => '3424',
                                       'Name' => 'union ibv_gid*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48416' => {
                                       'Name' => 'int(*)(struct efadv_cq*, union ibv_gid*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '48406'
                                                           },
                                                    '1' => {
                                                             'type' => '48411'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '48440' => {
                                       'Header' => undef,
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '8',
                                                            'type' => '2234'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_cq_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '48511' => {
                                       'Header' => undef,
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2234'
                                                          },
                                                   '1' => {
                                                            'name' => 'ic_id_validity',
                                                            'offset' => '8',
                                                            'type' => '2210'
                                                          },
                                                   '2' => {
                                                            'name' => 'recv_ic_id',
                                                            'offset' => '16',
                                                            'type' => '2210'
                                                          },
                                                   '3' => {
                                                            'name' => 'rdma_read_ic_id',
                                                            'offset' => '18',
                                                            'type' => '2210'
                                                          },
                                                   '4' => {
                                                            'name' => 'rdma_recv_ic_id',
                                                            'offset' => '20',
                                                            'type' => '2210'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_mr_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '52217' => {
                                       'BaseType' => '48293',
                                       'Name' => 'struct efadv_ah_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5900' => {
                                      'Header' => undef,
                                      'Line' => '1507',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '12066'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '22',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '2222'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '40',
                                                           'type' => '152'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '774'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '848'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '288',
                                                           'type' => '2222'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '292',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '6039' => {
                                      'BaseType' => '5900',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6044' => {
                                      'Header' => undef,
                                      'Line' => '1282',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '100',
                                                            'type' => '774'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '260',
                                                            'type' => '848'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '338',
                                                            'type' => '2222'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7612'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '36',
                                                           'type' => '6039'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '50',
                                                           'type' => '6039'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '64',
                                                           'type' => '6352'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '72',
                                                           'type' => '2222'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '82',
                                                           'type' => '2222'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '86',
                                                           'type' => '9275'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '96',
                                                           'type' => '8624'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '6237' => {
                                      'BaseType' => '6044',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6242' => {
                                      'Header' => undef,
                                      'Line' => '1242',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7612'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '2222'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '774'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '848'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '288',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '6352' => {
                                      'BaseType' => '6242',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6596' => {
                                      'Header' => undef,
                                      'Line' => '484',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_LOC_LEN_ERR',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_REM_OP_ERR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_REM_ABORT_ERR',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_INV_EECN_ERR',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_FATAL_ERR',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'IBV_WC_GENERAL_ERR',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'IBV_WC_TM_ERR',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                            'value' => '23'
                                                          },
                                                  '3' => {
                                                           'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_LOC_PROT_ERR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_MW_BIND_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_BAD_RESP_ERR',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_status',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '66' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '67344' => {
                                       'BaseType' => '48040',
                                       'Name' => 'struct efadv_qp_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6757' => {
                                      'Header' => undef,
                                      'Line' => '512',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SEND',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_RDMA_WRITE',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_RECV',
                                                            'value' => '128'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                            'value' => '129'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_TM_ADD',
                                                            'value' => '130'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_TM_DEL',
                                                            'value' => '131'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_TM_SYNC',
                                                            'value' => '132'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_TM_RECV',
                                                            'value' => '133'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_TM_NO_TAG',
                                                            'value' => '134'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_DRIVER1',
                                                            'value' => '135'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_DRIVER2',
                                                            'value' => '136'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_DRIVER3',
                                                            'value' => '137'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_RDMA_READ',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WC_COMP_SWAP',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_FETCH_ADD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_BIND_MW',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_LOCAL_INV',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_TSO',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_FLUSH',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_ATOMIC_WRITE',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7025' => {
                                      'Header' => undef,
                                      'Line' => '597',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '2378'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7058' => {
                                      'Header' => undef,
                                      'Line' => '588',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '2234'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '6596'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '66',
                                                            'type' => '2210'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '68',
                                                            'type' => '2198'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '69',
                                                            'type' => '2198'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '18',
                                                           'type' => '6757'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '22',
                                                           'type' => '2222'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '32',
                                                           'type' => '2222'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '36',
                                                           'type' => '7025'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '40',
                                                           'type' => '2222'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '50',
                                                           'type' => '2222'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '54',
                                                           'type' => '66'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '64',
                                                           'type' => '2210'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7244' => {
                                      'Header' => undef,
                                      'Line' => '624',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '7427'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '2234'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '22',
                                                           'type' => '2234'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '36',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7317' => {
                                      'Header' => undef,
                                      'Line' => '667',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7612'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '22',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '36',
                                                           'type' => '42'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '50',
                                                           'type' => '2222'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '54',
                                                           'type' => '2222'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '64',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7427' => {
                                      'BaseType' => '7317',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7432' => {
                                      'Header' => undef,
                                      'Line' => '631',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '75708' => {
                                       'BaseType' => '48440',
                                       'Name' => 'struct efadv_cq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7584' => {
                                      'Header' => undef,
                                      'Line' => '656',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         }
                                                },
                                      'Name' => 'struct ibv_xrcd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7612' => {
                                      'BaseType' => '7432',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7617' => {
                                      'Header' => undef,
                                      'Line' => '677',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MW_TYPE_1',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MW_TYPE_2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mw_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7646' => {
                                      'Header' => undef,
                                      'Line' => '682',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7612'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '22',
                                                           'type' => '2222'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '2222'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '36',
                                                           'type' => '7617'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '78' => {
                                    'BaseType' => '1',
                                    'Name' => 'void*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '80' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8218' => {
                                      'BaseType' => '7584',
                                      'Name' => 'struct ibv_xrcd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8493' => {
                                      'Header' => undef,
                                      'Line' => '879',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3883'
                                                         },
                                                  '1' => {
                                                           'name' => 'ind_tbl_handle',
                                                           'offset' => '8',
                                                           'type' => '152'
                                                         },
                                                  '2' => {
                                                           'name' => 'ind_tbl_num',
                                                           'offset' => '18',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '22',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rwq_ind_table',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '85185' => {
                                       'BaseType' => '48511',
                                       'Name' => 'struct efadv_mr_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8624' => {
                                      'Header' => undef,
                                      'Line' => '900',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPT_RC',
                                                           'value' => '2'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPT_UC',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPT_UD',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPT_RAW_PACKET',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPT_XRC_SEND',
                                                           'value' => '9'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPT_XRC_RECV',
                                                           'value' => '10'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPT_DRIVER',
                                                           'value' => '255'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8683' => {
                                      'Header' => undef,
                                      'Line' => '910',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max_send_wr',
                                                           'offset' => '0',
                                                           'type' => '2222'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_recv_wr',
                                                           'offset' => '4',
                                                           'type' => '2222'
                                                         },
                                                  '2' => {
                                                           'name' => 'max_send_sge',
                                                           'offset' => '8',
                                                           'type' => '2222'
                                                         },
                                                  '3' => {
                                                           'name' => 'max_recv_sge',
                                                           'offset' => '18',
                                                           'type' => '2222'
                                                         },
                                                  '4' => {
                                                           'name' => 'max_inline_data',
                                                           'offset' => '22',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_cap',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '87209' => {
                                       'BaseType' => '48146',
                                       'Name' => 'struct efadv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8767' => {
                                      'Header' => undef,
                                      'Line' => '918',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '78'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '6039'
                                                         },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '22',
                                                           'type' => '6039'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '36',
                                                           'type' => '6352'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '50',
                                                           'type' => '8683'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '82',
                                                           'type' => '8624'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '86',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '8877' => {
                                      'Header' => undef,
                                      'Line' => '962',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rx_hash_function',
                                                           'offset' => '0',
                                                           'type' => '2198'
                                                         },
                                                  '1' => {
                                                           'name' => 'rx_hash_key_len',
                                                           'offset' => '1',
                                                           'type' => '2198'
                                                         },
                                                  '2' => {
                                                           'name' => 'rx_hash_key',
                                                           'offset' => '8',
                                                           'type' => '8947'
                                                         },
                                                  '3' => {
                                                           'name' => 'rx_hash_fields_mask',
                                                           'offset' => '22',
                                                           'type' => '2234'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rx_hash_conf',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8947' => {
                                      'BaseType' => '2198',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8952' => {
                                      'Header' => undef,
                                      'Line' => '971',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '78'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '6039'
                                                         },
                                                  '10' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '128',
                                                            'type' => '2222'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_tso_header',
                                                            'offset' => '132',
                                                            'type' => '2210'
                                                          },
                                                  '12' => {
                                                            'name' => 'rwq_ind_tbl',
                                                            'offset' => '136',
                                                            'type' => '9186'
                                                          },
                                                  '13' => {
                                                            'name' => 'rx_hash_conf',
                                                            'offset' => '150',
                                                            'type' => '8877'
                                                          },
                                                  '14' => {
                                                            'name' => 'source_qpn',
                                                            'offset' => '288',
                                                            'type' => '2222'
                                                          },
                                                  '15' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '296',
                                                            'type' => '2234'
                                                          },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '22',
                                                           'type' => '6039'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '36',
                                                           'type' => '6352'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '50',
                                                           'type' => '8683'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '82',
                                                           'type' => '8624'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '86',
                                                           'type' => '152'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '96',
                                                           'type' => '2222'
                                                         },
                                                  '8' => {
                                                           'name' => 'pd',
                                                           'offset' => '100',
                                                           'type' => '7612'
                                                         },
                                                  '9' => {
                                                           'name' => 'xrcd',
                                                           'offset' => '114',
                                                           'type' => '8218'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr_ex',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '9186' => {
                                      'BaseType' => '8493',
                                      'Name' => 'struct ibv_rwq_ind_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '92' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '9275' => {
                                      'Header' => undef,
                                      'Line' => '1049',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPS_INIT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPS_RTR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPS_RTS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPS_SQD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPS_SQE',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPS_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_QPS_UNKNOWN',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '9822' => {
                                      'Header' => undef,
                                      'Line' => '1102',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WR_TSO',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WR_DRIVER1',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WR_FLUSH',
                                                            'value' => '14'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WR_ATOMIC_WRITE',
                                                            'value' => '15'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WR_SEND',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WR_SEND_WITH_IMM',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WR_RDMA_READ',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WR_LOCAL_INV',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WR_BIND_MW',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WR_SEND_WITH_INV',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wr_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '9970' => {
                                      'Header' => undef,
                                      'Line' => '1144',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'addr',
                                                           'offset' => '0',
                                                           'type' => '2234'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '2222'
                                                         },
                                                  '2' => {
                                                           'name' => 'lkey',
                                                           'offset' => '18',
                                                           'type' => '2222'
                                                         }
                                                },
                                      'Name' => 'struct ibv_sge',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libefa.so.1.3.51.0' => {
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                            '__stack_chk_fail@GLIBC_2.4' => 0,
                                                            '__verbs_log@IBVERBS_PRIVATE_34' => 0,
                                                            '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_34' => 0,
                                                            'calloc@GLIBC_2.2.5' => 0,
                                                            'execute_ioctl@IBVERBS_PRIVATE_34' => 0,
                                                            'free@GLIBC_2.2.5' => 0,
                                                            'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_ah@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_cq_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_qp_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_ah@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_get_context@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_modify_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_device_any@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_port@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_reg_dmabuf_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_reg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'malloc@GLIBC_2.2.5' => 0,
                                                            'memcpy@GLIBC_2.14' => 0,
                                                            'memset@GLIBC_2.2.5' => 0,
                                                            'mmap@GLIBC_2.2.5' => 0,
                                                            'munmap@GLIBC_2.2.5' => 0,
                                                            'pthread_spin_destroy@GLIBC_2.34' => 0,
                                                            'pthread_spin_init@GLIBC_2.34' => 0,
                                                            'pthread_spin_lock@GLIBC_2.34' => 0,
                                                            'pthread_spin_unlock@GLIBC_2.34' => 0,
                                                            'sysconf@GLIBC_2.2.5' => 0,
                                                            'verbs_register_driver_34@IBVERBS_PRIVATE_34' => 0,
                                                            'verbs_set_ops@IBVERBS_PRIVATE_34' => 0,
                                                            'verbs_uninit_context@IBVERBS_PRIVATE_34' => 0
                                                          }
                                },
          'WordSize' => '8'
        };
