$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.3.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libefa.so.1.1.36.0',
          'LibraryVersion' => 'efa',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '48494' => {
                                         'Header' => undef,
                                         'Line' => '1941',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ibvah',
                                                               'type' => '10362'
                                                             },
                                                      '1' => {
                                                               'name' => 'attr',
                                                               'type' => '48724'
                                                             },
                                                      '2' => {

                                                               'name' => 'attr',
                                                               'type' => '19406'
                                                             },
                                                      '2' => {
                                                               'name' => 'driver_qp_type',
                                                               'type' => '2203'
                                                             }
                                                    },
                                         'Return' => '6244',
                                         'ShortName' => 'efadv_create_driver_qp'
                                       },
                            '70982' => {
                                         'Header' => undef,
                                         'Line' => '135',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ibvctx',
                                                               'type' => '3868'
                                                             },
                                                      '1' => {
                                                               'name' => 'attr',
                                                               'type' => '71227'
                                                             },
                                                      '2' => {
                                                               'name' => 'inlen',
                                                               'type' => '2203'
                                                             }
                                                    },
                                         'Return' => '121',
                                         'ShortName' => 'efadv_query_device'
                                       }
                          },
          'SymbolVersion' => {
                               'efadv_create_driver_qp' => 'efadv_create_driver_qp@@EFA_1.0',
                               'efadv_create_qp_ex' => 'efadv_create_qp_ex@@EFA_1.1',
                               'efadv_query_ah' => 'efadv_query_ah@@EFA_1.1',
                               'efadv_query_device' => 'efadv_query_device@@EFA_1.1'
                             },
          'Symbols' => {
                         'libefa.so.1.1.36.0' => {
                                                   'efadv_create_driver_qp@@EFA_1.0' => 1,
                                                   'efadv_create_qp_ex@@EFA_1.1' => 1,
                                                   'efadv_query_ah@@EFA_1.1' => 1,
                                                   'efadv_query_device@@EFA_1.1' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10049' => {
                                       'Header' => undef,
                                       'Line' => '1110',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '2' => {
                                                            'name' => 'lkey',
                                                            'offset' => '12',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_sge',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10111' => {
                                       'Header' => undef,
                                       'Line' => '1126',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '2316'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10148' => {
                                       'Header' => undef,
                                       'Line' => '1131',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10187' => {
                                       'Header' => undef,
                                       'Line' => '1135',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '2215'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '16',
                                                            'type' => '2215'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '24',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10254' => {
                                       'Header' => undef,
                                       'Line' => '1141',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '10362'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '12',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10306' => {
                                       'Header' => undef,
                                       'Line' => '1641',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3868'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '7642'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10362' => {
                                       'BaseType' => '10306',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10368' => {
                                       'Header' => undef,
                                       'Line' => '1130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '10148'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '10187'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '10254'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '10417' => {
                                       'Header' => undef,
                                       'Line' => '1148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10442' => {
                                       'Header' => undef,
                                       'Line' => '1147',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '10417'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10466' => {
                                       'Header' => undef,
                                       'Line' => '1153',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '10518'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '7263'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10518' => {
                                       'BaseType' => '7680',
                                       'Name' => 'struct ibv_mw*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10524' => {
                                       'Header' => undef,
                                       'Line' => '1158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '67'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '2191'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '10',
                                                            'type' => '2191'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10577' => {
                                       'Header' => undef,
                                       'Line' => '1152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '10466'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '10524'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10614' => {
                                       'Header' => undef,
                                       'Line' => '1116',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10752'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '10758'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '121'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '28',
                                                            'type' => '9909'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '32',
                                                            'type' => '60'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '36',
                                                            'type' => '10111'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '40',
                                                            'type' => '10368'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '72',
                                                            'type' => '10442'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '80',
                                                            'type' => '10577'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '10752' => {
                                       'BaseType' => '10614',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10758' => {
                                       'BaseType' => '10049',
                                       'Name' => 'struct ibv_sge*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10764' => {
                                       'Header' => undef,
                                       'Line' => '1166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10835'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '10758'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_recv_wr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10835' => {
                                       'BaseType' => '10764',
                                       'Name' => 'struct ibv_recv_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '109' => {
                                     'BaseType' => '76',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '11103' => {
                                       'Header' => undef,
                                       'Line' => '1202',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '8',
                                                            'type' => '60'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '7263'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11185' => {
                                       'BaseType' => '10835',
                                       'Name' => 'struct ibv_recv_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12060' => {
                                       'Header' => undef,
                                       'Line' => '1448',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3868'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '121'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '12',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '121' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12116' => {
                                       'BaseType' => '12060',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '133' => {
                                     'BaseType' => '60',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '13410' => {
                                       'Header' => undef,
                                       'Line' => '1914',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '13599'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '13616'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13473' => {
                                       'BaseType' => '13479',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13479' => {
                                       'Header' => undef,
                                       'Line' => '1924',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '13410'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '16',
                                                            'type' => '3458'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '20',
                                                            'type' => '3525'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '24',
                                                            'type' => '4486'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '88',
                                                            'type' => '4486'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '152',
                                                            'type' => '13651'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '408',
                                                            'type' => '13651'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '13599' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '13473'
                                                           },
                                                    '1' => {
                                                             'type' => '121'
                                                           }
                                                  },
                                       'Return' => '3868',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13616' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3868'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13651' => {
                                       'BaseType' => '200',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '13667' => {
                                       'Header' => undef,
                                       'Line' => '1939',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '14157'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '14199'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '80',
                                                             'type' => '14210'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '88',
                                                             'type' => '14331'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '96',
                                                             'type' => '14357'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '104',
                                                             'type' => '14210'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '112',
                                                             'type' => '14210'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '120',
                                                             'type' => '14210'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '128',
                                                             'type' => '14210'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '136',
                                                             'type' => '14210'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '144',
                                                             'type' => '14210'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '152',
                                                             'type' => '14210'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '16',
                                                            'type' => '14210'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '160',
                                                             'type' => '14388'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '168',
                                                             'type' => '14210'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '176',
                                                             'type' => '14210'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '184',
                                                             'type' => '14210'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '192',
                                                             'type' => '14210'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '200',
                                                             'type' => '14425'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '208',
                                                             'type' => '14456'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '216',
                                                             'type' => '14210'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '224',
                                                             'type' => '14210'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '232',
                                                             'type' => '14210'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '24',
                                                            'type' => '14210'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '240',
                                                             'type' => '14210'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '248',
                                                             'type' => '14210'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '32',
                                                            'type' => '14210'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '40',
                                                            'type' => '14210'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '48',
                                                            'type' => '14210'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '56',
                                                            'type' => '14236'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '64',
                                                            'type' => '14273'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '72',
                                                            'type' => '14294'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '14151' => {
                                       'BaseType' => '3952',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14157' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3868'
                                                           },
                                                    '1' => {
                                                             'type' => '14151'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14188' => {
                                       'BaseType' => '14194',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14194' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '14199' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3868'
                                                           },
                                                    '1' => {
                                                             'type' => '2179'
                                                           },
                                                    '2' => {
                                                             'type' => '14188'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14210' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '67',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14236' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7642'
                                                           },
                                                    '1' => {
                                                             'type' => '7648'
                                                           }
                                                  },
                                       'Return' => '10518',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14267' => {
                                       'BaseType' => '11103',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14273' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6244'
                                                           },
                                                    '1' => {
                                                             'type' => '10518'
                                                           },
                                                    '2' => {
                                                             'type' => '14267'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14294' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10518'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14325' => {
                                       'BaseType' => '7075',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14331' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6042'
                                                           },
                                                    '1' => {
                                                             'type' => '121'
                                                           },
                                                    '2' => {
                                                             'type' => '14325'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14357' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6042'
                                                           },
                                                    '1' => {
                                                             'type' => '121'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14388' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6362'
                                                           },
                                                    '1' => {
                                                             'type' => '10835'
                                                           },
                                                    '2' => {
                                                             'type' => '11185'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14419' => {
                                       'BaseType' => '10752',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14425' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6244'
                                                           },
                                                    '1' => {
                                                             'type' => '10752'
                                                           },
                                                    '2' => {
                                                             'type' => '14419'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14456' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6244'
                                                           },
                                                    '1' => {
                                                             'type' => '10835'
                                                           },
                                                    '2' => {
                                                             'type' => '11185'
                                                           }
                                                  },
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '152' => {
                                     'BaseType' => '53',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '16504' => {
                                       'BaseType' => '9024',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19406' => {
                                       'BaseType' => '8834',
                                       'Name' => 'struct ibv_qp_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '200' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '2179' => {
                                      'BaseType' => '90',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '2191' => {
                                      'BaseType' => '109',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2203' => {
                                      'BaseType' => '133',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2215' => {
                                      'BaseType' => '152',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2292' => {
                                      'BaseType' => '60',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2304' => {
                                      'BaseType' => '523',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2316' => {
                                      'BaseType' => '2292',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2328' => {
                                      'BaseType' => '2304',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3458' => {
                                      'Header' => undef,
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3525' => {
                                      'Header' => undef,
                                      'Line' => '106',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3580' => {
                                      'Header' => undef,
                                      'Line' => '155',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3749' => {
                                      'Header' => undef,
                                      'Line' => '1982',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '13473'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '13667'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '264',
                                                           'type' => '121'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '268',
                                                           'type' => '121'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '272',
                                                           'type' => '121'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '280',
                                                           'type' => '769'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '320',
                                                           'type' => '67'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '37536' => {
                                       'BaseType' => '2179',
                                       'Name' => 'uint8_t[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '3868' => {
                                      'BaseType' => '3749',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3952' => {
                                      'Header' => undef,
                                      'Line' => '182',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '4486'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '64',
                                                           'type' => '2328'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '116',
                                                            'type' => '60'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '120',
                                                            'type' => '121'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '124',
                                                            'type' => '121'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '128',
                                                            'type' => '121'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '132',
                                                            'type' => '121'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '136',
                                                            'type' => '121'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '140',
                                                            'type' => '121'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '144',
                                                            'type' => '121'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '148',
                                                            'type' => '121'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '152',
                                                            'type' => '121'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '72',
                                                           'type' => '2328'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '156',
                                                            'type' => '121'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '160',
                                                            'type' => '121'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '164',
                                                            'type' => '3580'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '168',
                                                            'type' => '121'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '172',
                                                            'type' => '121'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '176',
                                                            'type' => '121'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '180',
                                                            'type' => '121'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '184',
                                                            'type' => '121'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '188',
                                                            'type' => '121'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '192',
                                                            'type' => '121'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '80',
                                                           'type' => '2215'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '196',
                                                            'type' => '121'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '200',
                                                            'type' => '121'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '204',
                                                            'type' => '121'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '208',
                                                            'type' => '121'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '212',
                                                            'type' => '121'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '216',
                                                            'type' => '121'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '220',
                                                            'type' => '121'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '224',
                                                            'type' => '2191'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '226',
                                                            'type' => '2179'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '227',
                                                            'type' => '2179'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '88',
                                                           'type' => '2215'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '96',
                                                           'type' => '2203'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '100',
                                                           'type' => '2203'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '104',
                                                           'type' => '2203'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '108',
                                                           'type' => '121'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '112',
                                                           'type' => '121'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '41' => {
                                    'BaseType' => '53',
                                    'Header' => undef,
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4486' => {
                                      'BaseType' => '200',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '47719' => {
                                       'Header' => undef,
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'driver_qp_type',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '47772'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_qp_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '47772' => {
                                       'BaseType' => '2179',
                                       'Name' => 'uint8_t[4]',
                                       'Size' => '4',
                                       'Type' => 'Array'
                                     },
                          '47815' => {
                                       'Header' => undef,
                                       'Line' => '43',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_sq_wr',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_rq_wr',
                                                            'offset' => '12',
                                                            'type' => '2203'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_sq_sge',
                                                            'offset' => '16',
                                                            'type' => '2191'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_rq_sge',
                                                            'offset' => '18',
                                                            'type' => '2191'
                                                          },
                                                   '5' => {
                                                            'name' => 'inline_buf_size',
                                                            'offset' => '20',
                                                            'type' => '2191'
                                                          },
                                                   '6' => {
                                                            'name' => 'reserved',
                                                            'offset' => '22',
                                                            'type' => '47946'
                                                          },
                                                   '7' => {
                                                            'name' => 'device_caps',
                                                            'offset' => '24',
                                                            'type' => '2203'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_rdma_size',
                                                            'offset' => '28',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_device_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '47946' => {
                                       'BaseType' => '2179',
                                       'Name' => 'uint8_t[2]',
                                       'Size' => '2',
                                       'Type' => 'Array'
                                     },
                          '47962' => {
                                       'Header' => undef,
                                       'Line' => '59',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          },
                                                   '1' => {
                                                            'name' => 'ahn',
                                                            'offset' => '8',
                                                            'type' => '2191'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '10',
                                                            'type' => '37536'
                                                          }
                                                 },
                                       'Name' => 'struct efadv_ah_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '48724' => {
                                       'BaseType' => '47962',
                                       'Name' => 'struct efadv_ah_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '523' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '53' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5901' => {
                                      'Header' => undef,
                                      'Line' => '1454',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '12116'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '16',
                                                           'type' => '67'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '24',
                                                           'type' => '2203'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '28',
                                                           'type' => '121'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '32',
                                                           'type' => '769'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '72',
                                                           'type' => '843'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '120',
                                                           'type' => '2203'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '124',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '59947' => {
                                       'BaseType' => '47719',
                                       'Name' => 'struct efadv_qp_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6042' => {
                                      'BaseType' => '5901',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6048' => {
                                      'Header' => undef,
                                      'Line' => '1248',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '67'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '64',
                                                            'type' => '769'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '104',
                                                            'type' => '843'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '152',
                                                            'type' => '2203'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '7642'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '24',
                                                           'type' => '6042'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '32',
                                                           'type' => '6042'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '40',
                                                           'type' => '6362'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '48',
                                                           'type' => '2203'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '52',
                                                           'type' => '2203'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '56',
                                                           'type' => '9353'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '60',
                                                           'type' => '8687'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '6244' => {
                                      'BaseType' => '6048',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6250' => {
                                      'Header' => undef,
                                      'Line' => '1208',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '67'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '7642'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '24',
                                                           'type' => '2203'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '32',
                                                           'type' => '769'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '72',
                                                           'type' => '843'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '120',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '6362' => {
                                      'BaseType' => '6250',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6612' => {
                                      'Header' => undef,
                                      'Line' => '482',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_LOC_LEN_ERR',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_REM_OP_ERR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_REM_ABORT_ERR',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_INV_EECN_ERR',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_FATAL_ERR',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'IBV_WC_GENERAL_ERR',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'IBV_WC_TM_ERR',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                            'value' => '23'
                                                          },
                                                  '3' => {
                                                           'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_LOC_PROT_ERR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_MW_BIND_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_BAD_RESP_ERR',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_status',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '67' => {
                                    'BaseType' => '1',
                                    'Name' => 'void*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '6776' => {
                                      'Header' => undef,
                                      'Line' => '510',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SEND',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_RDMA_WRITE',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_TM_ADD',
                                                            'value' => '130'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_TM_DEL',
                                                            'value' => '131'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_TM_SYNC',
                                                            'value' => '132'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_TM_RECV',
                                                            'value' => '133'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_TM_NO_TAG',
                                                            'value' => '134'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_DRIVER1',
                                                            'value' => '135'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_DRIVER2',
                                                            'value' => '136'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_RDMA_READ',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WC_COMP_SWAP',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_FETCH_ADD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_BIND_MW',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_LOCAL_INV',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_TSO',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_RECV',
                                                           'value' => '128'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                           'value' => '129'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '69' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '7038' => {
                                      'Header' => undef,
                                      'Line' => '592',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '2316'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7075' => {
                                      'Header' => undef,
                                      'Line' => '583',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '2215'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '6612'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '42',
                                                            'type' => '2191'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '44',
                                                            'type' => '2179'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '45',
                                                            'type' => '2179'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '12',
                                                           'type' => '6776'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '16',
                                                           'type' => '2203'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '20',
                                                           'type' => '2203'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '24',
                                                           'type' => '7038'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '28',
                                                           'type' => '2203'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '32',
                                                           'type' => '2203'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '36',
                                                           'type' => '60'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '40',
                                                           'type' => '2191'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '71227' => {
                                       'BaseType' => '47815',
                                       'Name' => 'struct efadv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7263' => {
                                      'Header' => undef,
                                      'Line' => '617',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '7450'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '2215'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '16',
                                                           'type' => '2215'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '24',
                                                           'type' => '60'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7338' => {
                                      'Header' => undef,
                                      'Line' => '660',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7642'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '16',
                                                           'type' => '67'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '41'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '2203'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '36',
                                                           'type' => '2203'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '40',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7450' => {
                                      'BaseType' => '7338',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7456' => {
                                      'Header' => undef,
                                      'Line' => '624',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '76' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '7613' => {
                                      'Header' => undef,
                                      'Line' => '649',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         }
                                                },
                                      'Name' => 'struct ibv_xrcd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7642' => {
                                      'BaseType' => '7456',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7648' => {
                                      'Header' => undef,
                                      'Line' => '670',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MW_TYPE_1',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MW_TYPE_2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mw_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7680' => {
                                      'Header' => undef,
                                      'Line' => '675',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7642'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '16',
                                                           'type' => '2203'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '20',
                                                           'type' => '2203'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '24',
                                                           'type' => '7648'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '8267' => {
                                      'BaseType' => '7613',
                                      'Name' => 'struct ibv_xrcd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8553' => {
                                      'Header' => undef,
                                      'Line' => '870',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3868'
                                                         },
                                                  '1' => {
                                                           'name' => 'ind_tbl_handle',
                                                           'offset' => '8',
                                                           'type' => '121'
                                                         },
                                                  '2' => {
                                                           'name' => 'ind_tbl_num',
                                                           'offset' => '12',
                                                           'type' => '121'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '16',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rwq_ind_table',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8687' => {
                                      'Header' => undef,
                                      'Line' => '891',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPT_RC',
                                                           'value' => '2'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPT_UC',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPT_UD',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPT_RAW_PACKET',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPT_XRC_SEND',
                                                           'value' => '9'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPT_XRC_RECV',
                                                           'value' => '10'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPT_DRIVER',
                                                           'value' => '255'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8749' => {
                                      'Header' => undef,
                                      'Line' => '901',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max_send_wr',
                                                           'offset' => '0',
                                                           'type' => '2203'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_recv_wr',
                                                           'offset' => '4',
                                                           'type' => '2203'
                                                         },
                                                  '2' => {
                                                           'name' => 'max_send_sge',
                                                           'offset' => '8',
                                                           'type' => '2203'
                                                         },
                                                  '3' => {
                                                           'name' => 'max_recv_sge',
                                                           'offset' => '12',
                                                           'type' => '2203'
                                                         },
                                                  '4' => {
                                                           'name' => 'max_inline_data',
                                                           'offset' => '16',
                                                           'type' => '2203'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_cap',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '8834' => {
                                      'Header' => undef,
                                      'Line' => '909',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '67'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '6042'
                                                         },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '16',
                                                           'type' => '6042'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '24',
                                                           'type' => '6362'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '32',
                                                           'type' => '8749'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '52',
                                                           'type' => '8687'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '56',
                                                           'type' => '121'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '8947' => {
                                      'Header' => undef,
                                      'Line' => '951',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rx_hash_function',
                                                           'offset' => '0',
                                                           'type' => '2179'
                                                         },
                                                  '1' => {
                                                           'name' => 'rx_hash_key_len',
                                                           'offset' => '1',
                                                           'type' => '2179'
                                                         },
                                                  '2' => {
                                                           'name' => 'rx_hash_key',
                                                           'offset' => '8',
                                                           'type' => '9018'
                                                         },
                                                  '3' => {
                                                           'name' => 'rx_hash_fields_mask',
                                                           'offset' => '16',
                                                           'type' => '2215'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rx_hash_conf',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '90' => {
                                    'BaseType' => '69',
                                    'Header' => undef,
                                    'Line' => '38',
                                    'Name' => '__uint8_t',
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '9018' => {
                                      'BaseType' => '2179',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9024' => {
                                      'Header' => undef,
                                      'Line' => '960',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '67'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '6042'
                                                         },
                                                  '10' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '80',
                                                            'type' => '2203'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_tso_header',
                                                            'offset' => '84',
                                                            'type' => '2191'
                                                          },
                                                  '12' => {
                                                            'name' => 'rwq_ind_tbl',
                                                            'offset' => '88',
                                                            'type' => '9262'
                                                          },
                                                  '13' => {
                                                            'name' => 'rx_hash_conf',
                                                            'offset' => '96',
                                                            'type' => '8947'
                                                          },
                                                  '14' => {
                                                            'name' => 'source_qpn',
                                                            'offset' => '120',
                                                            'type' => '2203'
                                                          },
                                                  '15' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '128',
                                                            'type' => '2215'
                                                          },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '16',
                                                           'type' => '6042'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '24',
                                                           'type' => '6362'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '32',
                                                           'type' => '8749'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '52',
                                                           'type' => '8687'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '56',
                                                           'type' => '121'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '60',
                                                           'type' => '2203'
                                                         },
                                                  '8' => {
                                                           'name' => 'pd',
                                                           'offset' => '64',
                                                           'type' => '7642'
                                                         },
                                                  '9' => {
                                                           'name' => 'xrcd',
                                                           'offset' => '72',
                                                           'type' => '8267'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr_ex',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '9262' => {
                                      'BaseType' => '8553',
                                      'Name' => 'struct ibv_rwq_ind_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9353' => {
                                      'Header' => undef,
                                      'Line' => '1029',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPS_INIT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPS_RTR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPS_RTS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPS_SQD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPS_SQE',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPS_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_QPS_UNKNOWN',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '9909' => {
                                      'Header' => undef,
                                      'Line' => '1082',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WR_TSO',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WR_DRIVER1',
                                                            'value' => '11'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WR_SEND',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WR_SEND_WITH_IMM',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WR_RDMA_READ',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WR_LOCAL_INV',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WR_BIND_MW',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WR_SEND_WITH_INV',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wr_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libefa.so.1.1.36.0' => {
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                            '__stack_chk_fail@GLIBC_2.4' => 0,
                                                            '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_34' => 0,
                                                            'calloc@GLIBC_2.2.5' => 0,
                                                            'free@GLIBC_2.2.5' => 0,
                                                            'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_ah@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_cq_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_qp_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_ah@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_get_context@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_modify_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_device_any@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_port@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_reg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'malloc@GLIBC_2.2.5' => 0,
                                                            'memcpy@GLIBC_2.14' => 0,
                                                            'memset@GLIBC_2.2.5' => 0,
                                                            'mmap@GLIBC_2.2.5' => 0,
                                                            'munmap@GLIBC_2.2.5' => 0,
                                                            'pthread_spin_destroy@GLIBC_2.2.5' => 0,
                                                            'pthread_spin_init@GLIBC_2.2.5' => 0,
                                                            'pthread_spin_lock@GLIBC_2.2.5' => 0,
                                                            'pthread_spin_unlock@GLIBC_2.2.5' => 0,
                                                            'sysconf@GLIBC_2.2.5' => 0,
                                                            'verbs_register_driver_34@IBVERBS_PRIVATE_34' => 0,
                                                            'verbs_set_ops@IBVERBS_PRIVATE_34' => 0,
                                                            'verbs_uninit_context@IBVERBS_PRIVATE_34' => 0
                                                          }
                                },
          'WordSize' => '8'
        };
