$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.3.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libhns.so.1.0.56.0',
          'LibraryVersion' => 'hns',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '144809' => {
                                          'Header' => undef,
                                          'Line' => '1682',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'context',
                                                                'type' => '3963'
                                                              },
                                                       '1' => {
                                                                'name' => 'attrs_out',
                                                                'type' => '145132'
                                                              }
                                                     },
                                          'Return' => '152',
                                          'ShortName' => 'hnsdv_query_device'
                                        },
                            '145158' => {
                                          'Header' => undef,
                                          'Line' => '1665',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'context',
                                                                'type' => '3963'
                                                              },
                                                       '1' => {
                                                                'name' => 'qp_attr',
                                                                'type' => '16449'
                                                              },
                                                       '2' => {
                                                                'name' => 'hns_attr',
                                                                'type' => '145331'
                                                              }
                                                     },
                                          'Return' => '6323',
                                          'ShortName' => 'hnsdv_create_qp'
                                        },
                            '24058' => {
                                         'Header' => undef,
                                         'Line' => '287',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'device',
                                                               'type' => '13508'
                                                             }
                                                    },
                                         'Return' => '2309',
                                         'ShortName' => 'hnsdv_is_supported'
                                       }
                          },
          'SymbolVersion' => {
                               'hnsdv_create_qp' => 'hnsdv_create_qp@@HNS_1.0',
                               'hnsdv_is_supported' => 'hnsdv_is_supported@@HNS_1.0',
                               'hnsdv_query_device' => 'hnsdv_query_device@@HNS_1.0'
                             },
          'Symbols' => {
                         'libhns.so.1.0.56.0' => {
                                                   'hnsdv_create_qp@@HNS_1.0' => 1,
                                                   'hnsdv_is_supported@@HNS_1.0' => 1,
                                                   'hnsdv_query_device@@HNS_1.0' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10076' => {
                                       'Header' => undef,
                                       'Line' => '1145',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '2397'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '2385'
                                                          },
                                                   '2' => {
                                                            'name' => 'lkey',
                                                            'offset' => '18',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_sge',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10137' => {
                                       'Header' => undef,
                                       'Line' => '1161',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '2457'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10170' => {
                                       'Header' => undef,
                                       'Line' => '1166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '2397'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10208' => {
                                       'Header' => undef,
                                       'Line' => '1170',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '2397'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '2397'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '22',
                                                            'type' => '2397'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '36',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10274' => {
                                       'Header' => undef,
                                       'Line' => '1176',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '10380'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '2385'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '18',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10325' => {
                                       'Header' => undef,
                                       'Line' => '1695',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3963'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '7705'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '22',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10380' => {
                                       'BaseType' => '10325',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10385' => {
                                       'Header' => undef,
                                       'Line' => '1165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '10170'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '10208'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '10274'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '10429' => {
                                       'Header' => undef,
                                       'Line' => '1183',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '2385'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10453' => {
                                       'Header' => undef,
                                       'Line' => '1182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '10429'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10474' => {
                                       'Header' => undef,
                                       'Line' => '1188',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '10525'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2385'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '22',
                                                            'type' => '7334'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10525' => {
                                       'BaseType' => '7739',
                                       'Name' => 'struct ibv_mw*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10530' => {
                                       'Header' => undef,
                                       'Line' => '1193',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '78'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '2373'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '16',
                                                            'type' => '2373'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10582' => {
                                       'Header' => undef,
                                       'Line' => '1187',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '10474'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '10530'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10615' => {
                                       'Header' => undef,
                                       'Line' => '1151',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2397'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10752'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '22',
                                                            'type' => '10757'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '40',
                                                            'type' => '9928'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '50',
                                                            'type' => '66'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '54',
                                                            'type' => '10137'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '64',
                                                            'type' => '10385'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '114',
                                                            'type' => '10453'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '128',
                                                            'type' => '10582'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '10752' => {
                                       'BaseType' => '10615',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10757' => {
                                       'BaseType' => '10076',
                                       'Name' => 'struct ibv_sge*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10762' => {
                                       'Header' => undef,
                                       'Line' => '1201',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2397'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10832'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '22',
                                                            'type' => '10757'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_recv_wr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10832' => {
                                       'BaseType' => '10762',
                                       'Name' => 'struct ibv_recv_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11092' => {
                                       'Header' => undef,
                                       'Line' => '1237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2397'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '8',
                                                            'type' => '66'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '22',
                                                            'type' => '7334'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11173' => {
                                       'BaseType' => '10832',
                                       'Name' => 'struct ibv_recv_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '116' => {
                                     'BaseType' => '80',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '12127' => {
                                       'Header' => undef,
                                       'Line' => '1502',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '3963'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12182' => {
                                       'BaseType' => '12127',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13446' => {
                                       'Header' => undef,
                                       'Line' => '1969',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '13632'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '13648'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13508' => {
                                       'BaseType' => '13513',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13513' => {
                                       'Header' => undef,
                                       'Line' => '1979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '13446'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '3562'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '3626'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '4577'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '4577'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '13679'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '13679'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '13632' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '13508'
                                                           },
                                                    '1' => {
                                                             'type' => '152'
                                                           }
                                                  },
                                       'Return' => '3963',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13648' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3963'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13679' => {
                                       'BaseType' => '253',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '13695' => {
                                       'Header' => undef,
                                       'Line' => '1994',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '14183'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '14223'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '14233'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '14348'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '14373'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '14233'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '14233'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '14233'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '14233'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '14233'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '14233'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '14233'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '14233'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '14403'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '14233'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '14233'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '14233'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '14233'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '14438'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '14468'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '14233'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '14233'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '14233'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '14233'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '14233'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '14233'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '14233'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '14233'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '14233'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '14258'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '14293'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '14313'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '137534' => {
                                        'Header' => undef,
                                        'Line' => '29',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '0',
                                                             'type' => '2397'
                                                           },
                                                    '1' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '8',
                                                             'type' => '2385'
                                                           },
                                                    '2' => {
                                                             'name' => 'congest_type',
                                                             'offset' => '18',
                                                             'type' => '2361'
                                                           },
                                                    '3' => {
                                                             'name' => 'reserved',
                                                             'offset' => '19',
                                                             'type' => '137600'
                                                           }
                                                  },
                                        'Name' => 'struct hnsdv_qp_init_attr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '137600' => {
                                        'BaseType' => '2361',
                                        'Name' => 'uint8_t[3]',
                                        'Size' => '3',
                                        'Type' => 'Array'
                                      },
                          '137639' => {
                                        'Header' => undef,
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '0',
                                                             'type' => '2397'
                                                           },
                                                    '1' => {
                                                             'name' => 'flags',
                                                             'offset' => '8',
                                                             'type' => '2397'
                                                           },
                                                    '2' => {
                                                             'name' => 'congest_type',
                                                             'offset' => '22',
                                                             'type' => '2361'
                                                           },
                                                    '3' => {
                                                             'name' => 'reserved',
                                                             'offset' => '23',
                                                             'type' => '137705'
                                                           }
                                                  },
                                        'Name' => 'struct hnsdv_context',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '137705' => {
                                        'BaseType' => '2361',
                                        'Name' => 'uint8_t[7]',
                                        'Size' => '7',
                                        'Type' => 'Array'
                                      },
                          '140' => {
                                     'BaseType' => '92',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '14178' => {
                                       'BaseType' => '4043',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14183' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3963'
                                                           },
                                                    '1' => {
                                                             'type' => '14178'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14213' => {
                                       'BaseType' => '14218',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14218' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '14223' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3963'
                                                           },
                                                    '1' => {
                                                             'type' => '2361'
                                                           },
                                                    '2' => {
                                                             'type' => '14213'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14233' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14258' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7705'
                                                           },
                                                    '1' => {
                                                             'type' => '7710'
                                                           }
                                                  },
                                       'Return' => '10525',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14288' => {
                                       'BaseType' => '11092',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14293' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6323'
                                                           },
                                                    '1' => {
                                                             'type' => '10525'
                                                           },
                                                    '2' => {
                                                             'type' => '14288'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14313' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10525'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14343' => {
                                       'BaseType' => '7147',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14348' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6123'
                                                           },
                                                    '1' => {
                                                             'type' => '152'
                                                           },
                                                    '2' => {
                                                             'type' => '14343'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14373' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6123'
                                                           },
                                                    '1' => {
                                                             'type' => '152'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14403' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6439'
                                                           },
                                                    '1' => {
                                                             'type' => '10832'
                                                           },
                                                    '2' => {
                                                             'type' => '11173'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14433' => {
                                       'BaseType' => '10752',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14438' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6323'
                                                           },
                                                    '1' => {
                                                             'type' => '10752'
                                                           },
                                                    '2' => {
                                                             'type' => '14433'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14468' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6323'
                                                           },
                                                    '1' => {
                                                             'type' => '10832'
                                                           },
                                                    '2' => {
                                                             'type' => '11173'
                                                           }
                                                  },
                                       'Return' => '152',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '145132' => {
                                        'BaseType' => '137639',
                                        'Name' => 'struct hnsdv_context*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145331' => {
                                        'BaseType' => '137534',
                                        'Name' => 'struct hnsdv_qp_init_attr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '152' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '16449' => {
                                       'BaseType' => '9054',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '169' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '193' => {
                                     'BaseType' => '54',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2309' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '2361' => {
                                      'BaseType' => '116',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '2373' => {
                                      'BaseType' => '140',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2385' => {
                                      'BaseType' => '169',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2397' => {
                                      'BaseType' => '193',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2433' => {
                                      'BaseType' => '66',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2445' => {
                                      'BaseType' => '420',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2457' => {
                                      'BaseType' => '2433',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2469' => {
                                      'BaseType' => '2445',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '253' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3562' => {
                                      'Header' => undef,
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3626' => {
                                      'Header' => undef,
                                      'Line' => '106',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3678' => {
                                      'Header' => undef,
                                      'Line' => '155',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3845' => {
                                      'Header' => undef,
                                      'Line' => '2037',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '13508'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '13695'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '612',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '616',
                                                           'type' => '152'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '626',
                                                           'type' => '152'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '640',
                                                           'type' => '853'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '800',
                                                           'type' => '78'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '3963' => {
                                      'BaseType' => '3845',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4043' => {
                                      'Header' => undef,
                                      'Line' => '182',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '4577'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '100',
                                                           'type' => '2469'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '278',
                                                            'type' => '66'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '288',
                                                            'type' => '152'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '292',
                                                            'type' => '152'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '296',
                                                            'type' => '152'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '306',
                                                            'type' => '152'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '310',
                                                            'type' => '152'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '320',
                                                            'type' => '152'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '324',
                                                            'type' => '152'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '328',
                                                            'type' => '152'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '338',
                                                            'type' => '152'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '114',
                                                           'type' => '2469'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '342',
                                                            'type' => '152'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '352',
                                                            'type' => '152'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '356',
                                                            'type' => '3678'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '360',
                                                            'type' => '152'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '370',
                                                            'type' => '152'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '374',
                                                            'type' => '152'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '384',
                                                            'type' => '152'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '388',
                                                            'type' => '152'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '392',
                                                            'type' => '152'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '402',
                                                            'type' => '152'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '128',
                                                           'type' => '2397'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '406',
                                                            'type' => '152'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '512',
                                                            'type' => '152'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '516',
                                                            'type' => '152'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '520',
                                                            'type' => '152'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '530',
                                                            'type' => '152'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '534',
                                                            'type' => '152'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '544',
                                                            'type' => '152'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '548',
                                                            'type' => '2373'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '550',
                                                            'type' => '2361'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '551',
                                                            'type' => '2361'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '136',
                                                           'type' => '2397'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '150',
                                                           'type' => '2385'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '256',
                                                           'type' => '2385'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '260',
                                                           'type' => '2385'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '264',
                                                           'type' => '152'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '274',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '42' => {
                                    'BaseType' => '54',
                                    'Header' => undef,
                                    'Line' => '214',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '420' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '4577' => {
                                      'BaseType' => '253',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '54' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5983' => {
                                      'Header' => undef,
                                      'Line' => '1508',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '12182'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '22',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '2385'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '40',
                                                           'type' => '152'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '853'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '927'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '288',
                                                           'type' => '2385'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '292',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '6123' => {
                                      'BaseType' => '5983',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6128' => {
                                      'Header' => undef,
                                      'Line' => '1283',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '100',
                                                            'type' => '853'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '260',
                                                            'type' => '927'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '338',
                                                            'type' => '2385'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7705'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '36',
                                                           'type' => '6123'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '50',
                                                           'type' => '6123'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '64',
                                                           'type' => '6439'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '72',
                                                           'type' => '2385'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '82',
                                                           'type' => '2385'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '86',
                                                           'type' => '9380'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '96',
                                                           'type' => '8724'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '6323' => {
                                      'BaseType' => '6128',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6328' => {
                                      'Header' => undef,
                                      'Line' => '1243',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7705'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '2385'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '853'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '927'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '288',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '6439' => {
                                      'BaseType' => '6328',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '66' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6685' => {
                                      'Header' => undef,
                                      'Line' => '485',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_LOC_LEN_ERR',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_REM_OP_ERR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_REM_ABORT_ERR',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_INV_EECN_ERR',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_FATAL_ERR',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'IBV_WC_GENERAL_ERR',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'IBV_WC_TM_ERR',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                            'value' => '23'
                                                          },
                                                  '3' => {
                                                           'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_LOC_PROT_ERR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_MW_BIND_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_BAD_RESP_ERR',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_status',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6846' => {
                                      'Header' => undef,
                                      'Line' => '513',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SEND',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_RDMA_WRITE',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_RECV',
                                                            'value' => '128'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                            'value' => '129'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_TM_ADD',
                                                            'value' => '130'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_TM_DEL',
                                                            'value' => '131'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_TM_SYNC',
                                                            'value' => '132'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_TM_RECV',
                                                            'value' => '133'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_TM_NO_TAG',
                                                            'value' => '134'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_DRIVER1',
                                                            'value' => '135'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_DRIVER2',
                                                            'value' => '136'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_DRIVER3',
                                                            'value' => '137'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_RDMA_READ',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WC_COMP_SWAP',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_FETCH_ADD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_BIND_MW',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_LOCAL_INV',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_TSO',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_FLUSH',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_ATOMIC_WRITE',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7114' => {
                                      'Header' => undef,
                                      'Line' => '598',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '2457'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7147' => {
                                      'Header' => undef,
                                      'Line' => '589',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '2397'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '6685'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '66',
                                                            'type' => '2373'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '68',
                                                            'type' => '2361'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '69',
                                                            'type' => '2361'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '18',
                                                           'type' => '6846'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '22',
                                                           'type' => '2385'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '32',
                                                           'type' => '2385'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '36',
                                                           'type' => '7114'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '40',
                                                           'type' => '2385'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '50',
                                                           'type' => '2385'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '54',
                                                           'type' => '66'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '64',
                                                           'type' => '2373'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7334' => {
                                      'Header' => undef,
                                      'Line' => '625',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '7519'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '2397'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '22',
                                                           'type' => '2397'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '36',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7408' => {
                                      'Header' => undef,
                                      'Line' => '668',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7705'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '22',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '36',
                                                           'type' => '42'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '50',
                                                           'type' => '2385'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '54',
                                                           'type' => '2385'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '64',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7519' => {
                                      'BaseType' => '7408',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7524' => {
                                      'Header' => undef,
                                      'Line' => '632',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7677' => {
                                      'Header' => undef,
                                      'Line' => '657',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         }
                                                },
                                      'Name' => 'struct ibv_xrcd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7705' => {
                                      'BaseType' => '7524',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7710' => {
                                      'Header' => undef,
                                      'Line' => '678',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MW_TYPE_1',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MW_TYPE_2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mw_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7739' => {
                                      'Header' => undef,
                                      'Line' => '683',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7705'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '22',
                                                           'type' => '2385'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '2385'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '36',
                                                           'type' => '7710'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '78' => {
                                    'BaseType' => '1',
                                    'Name' => 'void*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '80' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8316' => {
                                      'BaseType' => '7677',
                                      'Name' => 'struct ibv_xrcd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8593' => {
                                      'Header' => undef,
                                      'Line' => '880',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '3963'
                                                         },
                                                  '1' => {
                                                           'name' => 'ind_tbl_handle',
                                                           'offset' => '8',
                                                           'type' => '152'
                                                         },
                                                  '2' => {
                                                           'name' => 'ind_tbl_num',
                                                           'offset' => '18',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '22',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rwq_ind_table',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8724' => {
                                      'Header' => undef,
                                      'Line' => '901',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPT_RC',
                                                           'value' => '2'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPT_UC',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPT_UD',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPT_RAW_PACKET',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPT_XRC_SEND',
                                                           'value' => '9'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPT_XRC_RECV',
                                                           'value' => '10'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPT_DRIVER',
                                                           'value' => '255'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8783' => {
                                      'Header' => undef,
                                      'Line' => '911',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max_send_wr',
                                                           'offset' => '0',
                                                           'type' => '2385'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_recv_wr',
                                                           'offset' => '4',
                                                           'type' => '2385'
                                                         },
                                                  '2' => {
                                                           'name' => 'max_send_sge',
                                                           'offset' => '8',
                                                           'type' => '2385'
                                                         },
                                                  '3' => {
                                                           'name' => 'max_recv_sge',
                                                           'offset' => '18',
                                                           'type' => '2385'
                                                         },
                                                  '4' => {
                                                           'name' => 'max_inline_data',
                                                           'offset' => '22',
                                                           'type' => '2385'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_cap',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '8979' => {
                                      'Header' => undef,
                                      'Line' => '963',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rx_hash_function',
                                                           'offset' => '0',
                                                           'type' => '2361'
                                                         },
                                                  '1' => {
                                                           'name' => 'rx_hash_key_len',
                                                           'offset' => '1',
                                                           'type' => '2361'
                                                         },
                                                  '2' => {
                                                           'name' => 'rx_hash_key',
                                                           'offset' => '8',
                                                           'type' => '9049'
                                                         },
                                                  '3' => {
                                                           'name' => 'rx_hash_fields_mask',
                                                           'offset' => '22',
                                                           'type' => '2397'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rx_hash_conf',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '9049' => {
                                      'BaseType' => '2361',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9054' => {
                                      'Header' => undef,
                                      'Line' => '972',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '78'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '6123'
                                                         },
                                                  '10' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '128',
                                                            'type' => '2385'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_tso_header',
                                                            'offset' => '132',
                                                            'type' => '2373'
                                                          },
                                                  '12' => {
                                                            'name' => 'rwq_ind_tbl',
                                                            'offset' => '136',
                                                            'type' => '9291'
                                                          },
                                                  '13' => {
                                                            'name' => 'rx_hash_conf',
                                                            'offset' => '150',
                                                            'type' => '8979'
                                                          },
                                                  '14' => {
                                                            'name' => 'source_qpn',
                                                            'offset' => '288',
                                                            'type' => '2385'
                                                          },
                                                  '15' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '296',
                                                            'type' => '2397'
                                                          },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '22',
                                                           'type' => '6123'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '36',
                                                           'type' => '6439'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '50',
                                                           'type' => '8783'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '82',
                                                           'type' => '8724'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '86',
                                                           'type' => '152'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '96',
                                                           'type' => '2385'
                                                         },
                                                  '8' => {
                                                           'name' => 'pd',
                                                           'offset' => '100',
                                                           'type' => '7705'
                                                         },
                                                  '9' => {
                                                           'name' => 'xrcd',
                                                           'offset' => '114',
                                                           'type' => '8316'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr_ex',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '92' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '9291' => {
                                      'BaseType' => '8593',
                                      'Name' => 'struct ibv_rwq_ind_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9380' => {
                                      'Header' => undef,
                                      'Line' => '1050',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPS_INIT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPS_RTR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPS_RTS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPS_SQD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPS_SQE',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPS_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_QPS_UNKNOWN',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '9928' => {
                                      'Header' => undef,
                                      'Line' => '1103',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WR_TSO',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WR_DRIVER1',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WR_FLUSH',
                                                            'value' => '14'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WR_ATOMIC_WRITE',
                                                            'value' => '15'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WR_SEND',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WR_SEND_WITH_IMM',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WR_RDMA_READ',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WR_LOCAL_INV',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WR_BIND_MW',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WR_SEND_WITH_INV',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wr_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libhns.so.1.0.56.0' => {
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                            '__stack_chk_fail@GLIBC_2.4' => 0,
                                                            '__verbs_log@IBVERBS_PRIVATE_34' => 0,
                                                            '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_34' => 0,
                                                            'calloc@GLIBC_2.2.5' => 0,
                                                            'fcntl@GLIBC_2.2.5' => 0,
                                                            'free@GLIBC_2.2.5' => 0,
                                                            'getenv@GLIBC_2.2.5' => 0,
                                                            'getrandom@GLIBC_2.25' => 0,
                                                            'ibv_cmd_alloc_mw@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_close_xrcd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_ah@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_cq_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_qp_ex2@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_create_srq_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dealloc_mw@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_ah@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_destroy_srq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_get_context@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_modify_cq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_modify_qp_ex@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_modify_srq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_open_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_open_xrcd@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_device_any@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_port@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_qp@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_query_srq@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_reg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_cmd_rereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_dofork_range@IBVERBS_1.1' => 0,
                                                            'ibv_dontfork_range@IBVERBS_1.1' => 0,
                                                            'ibv_query_gid_type@IBVERBS_PRIVATE_34' => 0,
                                                            'ibv_resolve_eth_l2_from_gid@IBVERBS_1.1' => 0,
                                                            'malloc@GLIBC_2.2.5' => 0,
                                                            'memcpy@GLIBC_2.14' => 0,
                                                            'memset@GLIBC_2.2.5' => 0,
                                                            'mmap@GLIBC_2.2.5' => 0,
                                                            'munmap@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                            'pthread_spin_destroy@GLIBC_2.34' => 0,
                                                            'pthread_spin_init@GLIBC_2.34' => 0,
                                                            'pthread_spin_lock@GLIBC_2.34' => 0,
                                                            'pthread_spin_unlock@GLIBC_2.34' => 0,
                                                            'rand_r@GLIBC_2.2.5' => 0,
                                                            'sysconf@GLIBC_2.2.5' => 0,
                                                            'time@GLIBC_2.2.5' => 0,
                                                            'verbs_register_driver_34@IBVERBS_PRIVATE_34' => 0,
                                                            'verbs_set_ops@IBVERBS_PRIVATE_34' => 0,
                                                            'verbs_uninit_context@IBVERBS_PRIVATE_34' => 0
                                                          }
                                },
          'WordSize' => '8'
        };
