$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.0.1',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libibumad.so.3.2.30.0',
          'LibraryVersion' => 'ibumad',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '10854' => {
                                         'Header' => undef,
                                         'Line' => '998',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'fd',
                                                               'type' => '111'
                                                             }
                                                    },
                                         'Return' => '111',
                                         'ShortName' => 'umad_get_fd'
                                       },
                            '11067' => {
                                         'Header' => undef,
                                         'Line' => '992',
                                         'Param' => {

                                                      'umad_done@@IBUMAD_1.0' => 1,
                                                      'umad_dump@@IBUMAD_1.0' => 1,
                                                      'umad_free_ca_device_list@@IBUMAD_1.1' => 1,
                                                      'umad_get_ca@@IBUMAD_1.0' => 1,
                                                      'umad_get_ca_device_list@@IBUMAD_1.1' => 1,
                                                      'umad_get_ca_portguids@@IBUMAD_1.0' => 1,
                                                      'umad_get_cas_names@@IBUMAD_1.0' => 1,
                                                      'umad_get_fd@@IBUMAD_1.0' => 1,
                                                      'umad_get_issm_path@@IBUMAD_1.0' => 1,
                                                      'umad_get_mad@@IBUMAD_1.0' => 1,
                                                      'umad_get_mad_addr@@IBUMAD_1.0' => 1,
                                                      'umad_get_pkey@@IBUMAD_1.0' => 1,
                                                      'umad_get_port@@IBUMAD_1.0' => 1,
                                                      'umad_init@@IBUMAD_1.0' => 1,
                                                      'umad_method_str@@IBUMAD_1.0' => 1,
                                                      'umad_open_port@@IBUMAD_1.0' => 1,
                                                      'umad_poll@@IBUMAD_1.0' => 1,
                                                      'umad_recv@@IBUMAD_1.0' => 1,
                                                      'umad_register2@@IBUMAD_1.0' => 1,
                                                      'umad_register@@IBUMAD_1.0' => 1,
                                                      'umad_register_oui@@IBUMAD_1.0' => 1,
                                                      'umad_release_ca@@IBUMAD_1.0' => 1,
                                                      'umad_release_port@@IBUMAD_1.0' => 1,
                                                      'umad_sa_mad_status_str@@IBUMAD_1.0' => 1,
                                                      'umad_send@@IBUMAD_1.0' => 1,
                                                      'umad_set_addr@@IBUMAD_1.0' => 1,
                                                      'umad_set_addr_net@@IBUMAD_1.0' => 1,
                                                      'umad_set_grh@@IBUMAD_1.0' => 1,
                                                      'umad_set_pkey@@IBUMAD_1.0' => 1,
                                                      'umad_size@@IBUMAD_1.0' => 1,
                                                      'umad_sort_ca_device_list@@IBUMAD_1.2' => 1,
                                                      'umad_status@@IBUMAD_1.0' => 1,
                                                      'umad_unregister@@IBUMAD_1.0' => 1
                                                    }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10827' => {
                                       'BaseType' => '174',
                                       'Name' => 'uint8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '111' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '118' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '12442' => {
                                       'BaseType' => '111',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '125' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '137' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '151' => {
                                     'BaseType' => '162',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '16080' => {
                                       'BaseType' => '4888',
                                       'Name' => 'umad_ca_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '162' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1646' => {
                                      'BaseType' => '299',
                                      'Name' => '__be64*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '169' => {
                                     'BaseType' => '162',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '174' => {
                                     'BaseType' => '80',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '186' => {
                                     'BaseType' => '125',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '198' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '209',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '20395' => {
                                       'BaseType' => '3594',
                                       'Name' => 'char[20]*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '210' => {
                                     'BaseType' => '169',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '240' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '263' => {
                                     'BaseType' => '52',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => '__u16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '275' => {
                                     'BaseType' => '240',
                                     'Header' => undef,
                                     'Line' => '31',
                                     'Name' => '__u64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '287' => {
                                     'BaseType' => '263',
                                     'Header' => undef,
                                     'Line' => '25',
                                     'Name' => '__be16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '2972' => {
                                      'BaseType' => '59',
                                      'Header' => undef,
                                      'Line' => '42',
                                      'Name' => '__uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '299' => {
                                     'BaseType' => '275',
                                     'Header' => undef,
                                     'Line' => '29',
                                     'Name' => '__be64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '311' => {
                                     'BaseType' => '174',
                                     'Name' => 'uint8_t[16]',
                                     'Size' => '16',
                                     'Type' => 'Array'
                                   },
                          '327' => {
                                     'Header' => undef,
                                     'Line' => '59',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'subnet_prefix',
                                                          'offset' => '0',
                                                          'type' => '299'
                                                        },
                                                 '1' => {
                                                          'name' => 'interface_id',
                                                          'offset' => '8',
                                                          'type' => '299'
                                                        }
                                               },
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '3594' => {
                                      'BaseType' => '162',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '363' => {
                                     'Header' => undef,
                                     'Line' => '56',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'raw',
                                                          'offset' => '0',
                                                          'type' => '311'
                                                        },
                                                 '1' => {
                                                          'name' => 'raw_be16',
                                                          'offset' => '0',
                                                          'type' => '414'
                                                        },
                                                 '2' => {
                                                          'name' => 'global',
                                                          'offset' => '0',
                                                          'type' => '327'
                                                        }
                                               },
                                     'Name' => 'union umad_gid',
                                     'Size' => '16',
                                     'Type' => 'Union'
                                   },
                          '3640' => {
                                      'BaseType' => '162',
                                      'Name' => 'char[40]',
                                      'Size' => '40',
                                      'Type' => 'Array'
                                    },
                          '3888' => {
                                      'BaseType' => '99',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '3900' => {
                                      'BaseType' => '2972',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '3980' => {
                                      'BaseType' => '59',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4016' => {
                                      'BaseType' => '3980',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '414' => {
                                     'BaseType' => '287',
                                     'Name' => '__be16[8]',
                                     'Size' => '16',
                                     'Type' => 'Array'
                                   },
                          '4143' => {
                                      'Header' => undef,
                                      'Line' => '77',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'gid',
                                                           'offset' => '0',
                                                           'type' => '311'
                                                         },
                                                  '1' => {
                                                           'name' => 'ib_gid',
                                                           'offset' => '0',
                                                           'type' => '363'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '4179' => {
                                      'Header' => undef,
                                      'Line' => '67',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qpn',
                                                           'offset' => '0',
                                                           'type' => '4016'
                                                         },
                                                  '1' => {
                                                           'name' => 'qkey',
                                                           'offset' => '4',
                                                           'type' => '4016'
                                                         },
                                                  '10' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '32',
                                                            'type' => '4016'
                                                          },
                                                  '11' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '36',
                                                            'type' => '3888'
                                                          },
                                                  '12' => {
                                                            'name' => 'reserved',
                                                            'offset' => '38',
                                                            'type' => '4356'
                                                          },
                                                  '2' => {
                                                           'name' => 'lid',
                                                           'offset' => '8',
                                                           'type' => '287'
                                                         },
                                                  '3' => {
                                                           'name' => 'sl',
                                                           'offset' => '10',
                                                           'type' => '174'
                                                         },
                                                  '4' => {
                                                           'name' => 'path_bits',
                                                           'offset' => '11',
                                                           'type' => '174'
                                                         },
                                                  '5' => {
                                                           'name' => 'grh_present',
                                                           'offset' => '12',
                                                           'type' => '174'
                                                         },
                                                  '6' => {
                                                           'name' => 'gid_index',
                                                           'offset' => '13',
                                                           'type' => '174'
                                                         },
                                                  '7' => {
                                                           'name' => 'hop_limit',
                                                           'offset' => '14',
                                                           'type' => '174'
                                                         },
                                                  '8' => {
                                                           'name' => 'traffic_class',
                                                           'offset' => '15',
                                                           'type' => '174'
                                                         },
                                                  '9' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '16',
                                                           'type' => '4143'
                                                         }
                                                },
                                      'Name' => 'struct ib_mad_addr',
                                      'Size' => '44',
                                      'Type' => 'Struct'
                                    },
                          '4356' => {
                                      'BaseType' => '174',
                                      'Name' => 'uint8_t[6]',
                                      'Size' => '6',
                                      'Type' => 'Array'
                                    },
                          '4372' => {
                                      'BaseType' => '4179',
                                      'Header' => undef,
                                      'Line' => '84',
                                      'Name' => 'ib_mad_addr_t',
                                      'Size' => '44',
                                      'Type' => 'Typedef'
                                    },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '4508' => {
                                      'Header' => undef,
                                      'Line' => '142',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ca_name',
                                                           'offset' => '0',
                                                           'type' => '3594'
                                                         },
                                                  '1' => {
                                                           'name' => 'portnum',
                                                           'offset' => '20',
                                                           'type' => '111'
                                                         },
                                                  '10' => {
                                                            'name' => 'gid_prefix',
                                                            'offset' => '56',
                                                            'type' => '299'
                                                          },
                                                  '11' => {
                                                            'name' => 'port_guid',
                                                            'offset' => '64',
                                                            'type' => '299'
                                                          },
                                                  '12' => {
                                                            'name' => 'pkeys_size',
                                                            'offset' => '72',
                                                            'type' => '59'
                                                          },
                                                  '13' => {
                                                            'name' => 'pkeys',
                                                            'offset' => '80',
                                                            'type' => '4717'
                                                          },
                                                  '14' => {
                                                            'name' => 'link_layer',
                                                            'offset' => '88',
                                                            'type' => '3594'
                                                          },
                                                  '2' => {
                                                           'name' => 'base_lid',
                                                           'offset' => '24',
                                                           'type' => '59'
                                                         },
                                                  '3' => {
                                                           'name' => 'lmc',
                                                           'offset' => '28',
                                                           'type' => '59'
                                                         },
                                                  '4' => {
                                                           'name' => 'sm_lid',
                                                           'offset' => '32',
                                                           'type' => '59'
                                                         },
                                                  '5' => {
                                                           'name' => 'sm_sl',
                                                           'offset' => '36',
                                                           'type' => '59'
                                                         },
                                                  '6' => {
                                                           'name' => 'state',
                                                           'offset' => '40',
                                                           'type' => '59'
                                                         },
                                                  '7' => {
                                                           'name' => 'phys_state',
                                                           'offset' => '44',
                                                           'type' => '59'
                                                         },
                                                  '8' => {
                                                           'name' => 'rate',
                                                           'offset' => '48',
                                                           'type' => '59'
                                                         },
                                                  '9' => {
                                                           'name' => 'capmask',
                                                           'offset' => '52',
                                                           'type' => '4016'
                                                         }
                                                },
                                      'Name' => 'struct umad_port',
                                      'Size' => '112',
                                      'Type' => 'Struct'
                                    },
                          '4717' => {
                                      'BaseType' => '3888',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4723' => {
                                      'BaseType' => '4508',
                                      'Header' => undef,
                                      'Line' => '158',
                                      'Name' => 'umad_port_t',
                                      'Size' => '112',
                                      'Type' => 'Typedef'
                                    },
                          '4735' => {
                                      'Header' => undef,
                                      'Line' => '160',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ca_name',
                                                           'offset' => '0',
                                                           'type' => '3594'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_type',
                                                           'offset' => '20',
                                                           'type' => '59'
                                                         },
                                                  '2' => {
                                                           'name' => 'numports',
                                                           'offset' => '24',
                                                           'type' => '111'
                                                         },
                                                  '3' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '28',
                                                           'type' => '3594'
                                                         },
                                                  '4' => {
                                                           'name' => 'ca_type',
                                                           'offset' => '48',
                                                           'type' => '3640'
                                                         },
                                                  '5' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '88',
                                                           'type' => '3594'
                                                         },
                                                  '6' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '112',
                                                           'type' => '299'
                                                         },
                                                  '7' => {
                                                           'name' => 'system_guid',
                                                           'offset' => '120',
                                                           'type' => '299'
                                                         },
                                                  '8' => {
                                                           'name' => 'ports',
                                                           'offset' => '128',
                                                           'type' => '4866'
                                                         }
                                                },
                                      'Name' => 'struct umad_ca',
                                      'Size' => '208',
                                      'Type' => 'Struct'
                                    },
                          '4866' => {
                                      'BaseType' => '4882',
                                      'Name' => 'umad_port_t*[10]',
                                      'Size' => '80',
                                      'Type' => 'Array'
                                    },
                          '4882' => {
                                      'BaseType' => '4723',
                                      'Name' => 'umad_port_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4888' => {
                                      'BaseType' => '4735',
                                      'Header' => undef,
                                      'Line' => '170',
                                      'Name' => 'umad_ca_t',
                                      'Size' => '208',
                                      'Type' => 'Typedef'
                                    },
                          '4900' => {
                                      'Header' => undef,
                                      'Line' => '172',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '4940'
                                                         },
                                                  '1' => {
                                                           'name' => 'ca_name',
                                                           'offset' => '8',
                                                           'type' => '210'
                                                         }
                                                },
                                      'Name' => 'struct umad_device_node',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4940' => {
                                      'BaseType' => '4900',
                                      'Name' => 'struct umad_device_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4946' => {
                                      'Header' => undef,
                                      'Line' => '224',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mgmt_class',
                                                           'offset' => '0',
                                                           'type' => '174'
                                                         },
                                                  '1' => {
                                                           'name' => 'mgmt_class_version',
                                                           'offset' => '1',
                                                           'type' => '174'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '3900'
                                                         },
                                                  '3' => {
                                                           'name' => 'method_mask',
                                                           'offset' => '8',
                                                           'type' => '5038'
                                                         },
                                                  '4' => {
                                                           'name' => 'oui',
                                                           'offset' => '24',
                                                           'type' => '3900'
                                                         },
                                                  '5' => {
                                                           'name' => 'rmpp_version',
                                                           'offset' => '28',
                                                           'type' => '174'
                                                         }
                                                },
                                      'Name' => 'struct umad_reg_attr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '5038' => {
                                      'BaseType' => '186',
                                      'Name' => 'uint64_t[2]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6637' => {
                                      'BaseType' => '4940',
                                      'Name' => 'struct umad_device_node**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7265' => {
                                      'BaseType' => '4372',
                                      'Name' => 'ib_mad_addr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '80' => {
                                    'BaseType' => '45',
                                    'Header' => undef,
                                    'Line' => '38',
                                    'Name' => '__uint8_t',
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '9053' => {
                                      'BaseType' => '4946',
                                      'Name' => 'struct umad_reg_attr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9059' => {
                                      'BaseType' => '3900',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '99' => {
                                    'BaseType' => '52',
                                    'Header' => undef,
                                    'Line' => '40',
                                    'Name' => '__uint16_t',
                                    'Size' => '2',
                                    'Type' => 'Typedef'
                                  },
                          '9903' => {
                                      'BaseType' => '118',
                                      'Name' => 'long*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libibumad.so.3.2.30.0' => {
                                                               '_ITM_deregisterTMCloneTable' => 0,
                                                               '_ITM_registerTMCloneTable' => 0,
                                                               '__ctype_b_loc@GLIBC_2.3' => 0,
                                                               '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                               '__errno_location@GLIBC_2.2.5' => 0,
                                                               '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                               '__gmon_start__' => 0,
                                                               '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                               '__stack_chk_fail@GLIBC_2.4' => 0,
                                                               'alphasort@GLIBC_2.2.5' => 0,
                                                               'calloc@GLIBC_2.2.5' => 0,
                                                               'close@GLIBC_2.2.5' => 0,
                                                               'closedir@GLIBC_2.2.5' => 0,
                                                               'free@GLIBC_2.2.5' => 0,
                                                               'getpid@GLIBC_2.2.5' => 0,
                                                               'ioctl@GLIBC_2.2.5' => 0,
                                                               'open@GLIBC_2.2.5' => 0,
                                                               'opendir@GLIBC_2.2.5' => 0,
                                                               'poll@GLIBC_2.2.5' => 0,
                                                               'qsort@GLIBC_2.2.5' => 0,
                                                               'read@GLIBC_2.2.5' => 0,
                                                               'readdir@GLIBC_2.2.5' => 0,
                                                               'scandir@GLIBC_2.2.5' => 0,
                                                               'snprintf@GLIBC_2.2.5' => 0,
                                                               'stderr@GLIBC_2.2.5' => 0,
                                                               'strcmp@GLIBC_2.2.5' => 0,
                                                               'strcpy@GLIBC_2.2.5' => 0,
                                                               'strdup@GLIBC_2.2.5' => 0,
                                                               'strerror@GLIBC_2.2.5' => 0,
                                                               'strlen@GLIBC_2.2.5' => 0,
                                                               'strncmp@GLIBC_2.2.5' => 0,
                                                               'strncpy@GLIBC_2.2.5' => 0,
                                                               'strrchr@GLIBC_2.2.5' => 0,
                                                               'strsep@GLIBC_2.2.5' => 0,
                                                               'strtol@GLIBC_2.2.5' => 0,
                                                               'strtoul@GLIBC_2.2.5' => 0,
                                                               'strtoull@GLIBC_2.2.5' => 0,
                                                               'write@GLIBC_2.2.5' => 0
                                                             }
                                },
          'WordSize' => '8'
        };
