$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.0.1',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libibverbs.so.1.9.30.0',
          'LibraryVersion' => 'ibverbs',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libnl-3.so.200' => 1,
                        'libnl-route-3.so.200' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '124089' => {
                                          'Header' => undef,
                                          'Line' => '35',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'flow_id',
                                                                'type' => '20808'
                                                              }
                                                     },
                                          'Return' => '130',
                                          'ShortName' => 'ibv_cmd_destroy_flow'
                                        },

                                                       'ibv_query_gid_type@@IBVERBS_PRIVATE_25' => 1,
                                                       'ibv_query_pkey@@IBVERBS_1.1' => 1,
                                                       'ibv_query_pkey@IBVERBS_1.0' => 1,
                                                       'ibv_query_port@@IBVERBS_1.1' => 1,
                                                       'ibv_query_port@IBVERBS_1.0' => 1,
                                                       'ibv_query_qp@@IBVERBS_1.1' => 1,
                                                       'ibv_query_qp@IBVERBS_1.0' => 1,
                                                       'ibv_query_srq@@IBVERBS_1.1' => 1,
                                                       'ibv_query_srq@IBVERBS_1.0' => 1,
                                                       'ibv_rate_to_mbps@@IBVERBS_1.1' => 1,
                                                       'ibv_rate_to_mult@@IBVERBS_1.0' => 1,
                                                       'ibv_read_ibdev_sysfs_file@@IBVERBS_PRIVATE_25' => 1,
                                                       'ibv_read_sysfs_file@@IBVERBS_1.0' => 1,
                                                       'ibv_reg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_reg_mr@IBVERBS_1.0' => 1,
                                                       'ibv_reg_mr_iova2@@IBVERBS_1.8' => 1,
                                                       'ibv_reg_mr_iova@@IBVERBS_1.7' => 1,
                                                       'ibv_register_driver@IBVERBS_1.1' => 1,
                                                       'ibv_rereg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@IBVERBS_1.0' => 1,
                                                       'ibv_resolve_eth_l2_from_gid@@IBVERBS_1.1' => 1,
                                                       'ibv_wc_status_str@@IBVERBS_1.1' => 1,
                                                       'mbps_to_ibv_rate@@IBVERBS_1.1' => 1,
                                                       'mult_to_ibv_rate@@IBVERBS_1.0' => 1,
                                                       'verbs_allow_disassociate_destroy@@IBVERBS_PRIVATE_25' => -1,
                                                       'verbs_init_cq@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_open_device@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_register_driver_25@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_set_ops@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_uninit_context@@IBVERBS_PRIVATE_25' => 1
                                                     }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10005' => {
                                       'Header' => undef,
                                       'Line' => '1257',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '886'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '4',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '886'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '20',
                                                            'type' => '886'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_wq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '100526' => {
                                        'Header' => undef,
                                        'Line' => '419',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'IBV_EVENT_CQ_ERR',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'IBV_EVENT_QP_FATAL',
                                                             'value' => '1'
                                                           },
                                                    '10' => {
                                                              'name' => 'IBV_EVENT_PORT_ERR',
                                                              'value' => '10'
                                                            },
                                                    '11' => {
                                                              'name' => 'IBV_EVENT_LID_CHANGE',
                                                              'value' => '11'
                                                            },
                                                    '12' => {
                                                              'name' => 'IBV_EVENT_PKEY_CHANGE',
                                                              'value' => '12'
                                                            },
                                                    '13' => {
                                                              'name' => 'IBV_EVENT_SM_CHANGE',
                                                              'value' => '13'
                                                            },
                                                    '14' => {
                                                              'name' => 'IBV_EVENT_SRQ_ERR',
                                                              'value' => '14'
                                                            },
                                                    '15' => {
                                                              'name' => 'IBV_EVENT_SRQ_LIMIT_REACHED',
                                                              'value' => '15'
                                                            },
                                                    '16' => {
                                                              'name' => 'IBV_EVENT_QP_LAST_WQE_REACHED',
                                                              'value' => '16'
                                                            },
                                                    '17' => {
                                                              'name' => 'IBV_EVENT_CLIENT_REREGISTER',
                                                              'value' => '17'
                                                            },
                                                    '18' => {
                                                              'name' => 'IBV_EVENT_GID_CHANGE',
                                                              'value' => '18'
                                                            },
                                                    '19' => {
                                                              'name' => 'IBV_EVENT_WQ_FATAL',
                                                              'value' => '19'
                                                            },
                                                    '2' => {
                                                             'name' => 'IBV_EVENT_QP_REQ_ERR',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'IBV_EVENT_QP_ACCESS_ERR',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'IBV_EVENT_COMM_EST',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'IBV_EVENT_SQ_DRAINED',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'IBV_EVENT_PATH_MIG',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'IBV_EVENT_PATH_MIG_ERR',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'IBV_EVENT_DEVICE_FATAL',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'IBV_EVENT_PORT_ACTIVE',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum ibv_event_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '100666' => {
                                        'Header' => undef,
                                        'Line' => '443',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cq',
                                                             'offset' => '0',
                                                             'type' => '12223'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp',
                                                             'offset' => '0',
                                                             'type' => '12425'
                                                           },
                                                    '2' => {
                                                             'name' => 'srq',
                                                             'offset' => '0',
                                                             'type' => '12543'
                                                           },
                                                    '3' => {
                                                             'name' => 'wq',
                                                             'offset' => '0',
                                                             'type' => '12744'
                                                           },
                                                    '4' => {
                                                             'name' => 'port_num',
                                                             'offset' => '0',
                                                             'type' => '130'
                                                           }
                                                  },
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '101407' => {
                                        'Header' => undef,
                                        'Line' => '442',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'element',
                                                             'offset' => '0',
                                                             'type' => '100666'
                                                           },
                                                    '1' => {
                                                             'name' => 'event_type',
                                                             'offset' => '8',
                                                             'type' => '100526'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_async_event',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '10177' => {
                                       'Header' => undef,
                                       'Line' => '1278',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '886'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_rwq_ind_table_resp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10248' => {
                                       'Header' => undef,
                                       'Line' => '1290',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cq_count',
                                                            'offset' => '0',
                                                            'type' => '874'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_period',
                                                            'offset' => '2',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_cq_moderation',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '102705' => {
                                        'Header' => undef,
                                        'Line' => '744',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'srq_context',
                                                             'offset' => '0',
                                                             'type' => '71'
                                                           },
                                                    '1' => {
                                                             'name' => 'attr',
                                                             'offset' => '8',
                                                             'type' => '14200'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_srq_init_attr',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '10291' => {
                                       'Header' => undef,
                                       'Line' => '1295',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '0',
                                                            'type' => '886'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '4',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '10248'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_cq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10362' => {
                                       'Header' => undef,
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'subnet_prefix',
                                                            'offset' => '0',
                                                            'type' => '934'
                                                          },
                                                   '1' => {
                                                            'name' => 'interface_id',
                                                            'offset' => '8',
                                                            'type' => '934'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10398' => {
                                       'Header' => undef,
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'raw',
                                                            'offset' => '0',
                                                            'type' => '10441'
                                                          },
                                                   '1' => {
                                                            'name' => 'global',
                                                            'offset' => '0',
                                                            'type' => '10362'
                                                          }
                                                 },
                                       'Name' => 'union ibv_gid',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '10436' => {
                                       'BaseType' => '10398',
                                       'Name' => 'union ibv_gid const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '10441' => {
                                       'BaseType' => '802',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '10457' => {
                                       'Header' => undef,
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_NODE_UNKNOWN',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_NODE_CA',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_NODE_SWITCH',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_NODE_ROUTER',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_NODE_RNIC',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_NODE_USNIC',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_NODE_USNIC_UDP',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_NODE_UNSPECIFIED',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_node_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10524' => {
                                       'Header' => undef,
                                       'Line' => '90',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_TRANSPORT_IB',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_TRANSPORT_IWARP',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_TRANSPORT_USNIC',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_transport_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10579' => {
                                       'Header' => undef,
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_ATOMIC_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_ATOMIC_HCA',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_ATOMIC_GLOB',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_atomic_cap',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10616' => {
                                       'Header' => undef,
                                       'Line' => '1937',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'device',
                                                            'offset' => '0',
                                                            'type' => '19850'
                                                          },
                                                   '1' => {
                                                            'name' => 'ops',
                                                            'offset' => '8',
                                                            'type' => '20039'
                                                          },
                                                   '2' => {
                                                            'name' => 'cmd_fd',
                                                            'offset' => '264',
                                                            'type' => '130'
                                                          },
                                                   '3' => {
                                                            'name' => 'async_fd',
                                                            'offset' => '268',
                                                            'type' => '130'
                                                          },
                                                   '4' => {
                                                            'name' => 'num_comp_vectors',
                                                            'offset' => '272',
                                                            'type' => '130'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '280',
                                                            'type' => '704'
                                                          },
                                                   '6' => {
                                                            'name' => 'abi_compat',
                                                            'offset' => '320',
                                                            'type' => '71'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context',
                                       'Size' => '328',
                                       'Type' => 'Struct'
                                     },
                          '10735' => {
                                       'BaseType' => '10616',
                                       'Name' => 'struct ibv_context*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10741' => {
                                       'Header' => undef,
                                       'Line' => '154',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fw_ver',
                                                            'offset' => '0',
                                                            'type' => '11275'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_guid',
                                                            'offset' => '64',
                                                            'type' => '934'
                                                          },
                                                   '10' => {
                                                             'name' => 'device_cap_flags',
                                                             'offset' => '116',
                                                             'type' => '64'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_sge',
                                                             'offset' => '120',
                                                             'type' => '130'
                                                           },
                                                   '12' => {
                                                             'name' => 'max_sge_rd',
                                                             'offset' => '124',
                                                             'type' => '130'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_cq',
                                                             'offset' => '128',
                                                             'type' => '130'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_cqe',
                                                             'offset' => '132',
                                                             'type' => '130'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_mr',
                                                             'offset' => '136',
                                                             'type' => '130'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_pd',
                                                             'offset' => '140',
                                                             'type' => '130'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_qp_rd_atom',
                                                             'offset' => '144',
                                                             'type' => '130'
                                                           },
                                                   '18' => {
                                                             'name' => 'max_ee_rd_atom',
                                                             'offset' => '148',
                                                             'type' => '130'
                                                           },
                                                   '19' => {
                                                             'name' => 'max_res_rd_atom',
                                                             'offset' => '152',
                                                             'type' => '130'
                                                           },
                                                   '2' => {
                                                            'name' => 'sys_image_guid',
                                                            'offset' => '72',
                                                            'type' => '934'
                                                          },
                                                   '20' => {
                                                             'name' => 'max_qp_init_rd_atom',
                                                             'offset' => '156',
                                                             'type' => '130'
                                                           },
                                                   '21' => {
                                                             'name' => 'max_ee_init_rd_atom',
                                                             'offset' => '160',
                                                             'type' => '130'
                                                           },
                                                   '22' => {
                                                             'name' => 'atomic_cap',
                                                             'offset' => '164',
                                                             'type' => '10579'
                                                           },
                                                   '23' => {
                                                             'name' => 'max_ee',
                                                             'offset' => '168',
                                                             'type' => '130'
                                                           },
                                                   '24' => {
                                                             'name' => 'max_rdd',
                                                             'offset' => '172',
                                                             'type' => '130'
                                                           },
                                                   '25' => {
                                                             'name' => 'max_mw',
                                                             'offset' => '176',
                                                             'type' => '130'
                                                           },
                                                   '26' => {
                                                             'name' => 'max_raw_ipv6_qp',
                                                             'offset' => '180',
                                                             'type' => '130'
                                                           },
                                                   '27' => {
                                                             'name' => 'max_raw_ethy_qp',
                                                             'offset' => '184',
                                                             'type' => '130'
                                                           },
                                                   '28' => {
                                                             'name' => 'max_mcast_grp',
                                                             'offset' => '188',
                                                             'type' => '130'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_mcast_qp_attach',
                                                             'offset' => '192',
                                                             'type' => '130'
                                                           },
                                                   '3' => {
                                                            'name' => 'max_mr_size',
                                                            'offset' => '80',
                                                            'type' => '838'
                                                          },
                                                   '30' => {
                                                             'name' => 'max_total_mcast_qp_attach',
                                                             'offset' => '196',
                                                             'type' => '130'
                                                           },
                                                   '31' => {
                                                             'name' => 'max_ah',
                                                             'offset' => '200',
                                                             'type' => '130'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_fmr',
                                                             'offset' => '204',
                                                             'type' => '130'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_map_per_fmr',
                                                             'offset' => '208',
                                                             'type' => '130'
                                                           },
                                                   '34' => {
                                                             'name' => 'max_srq',
                                                             'offset' => '212',
                                                             'type' => '130'
                                                           },
                                                   '35' => {
                                                             'name' => 'max_srq_wr',
                                                             'offset' => '216',
                                                             'type' => '130'
                                                           },
                                                   '36' => {
                                                             'name' => 'max_srq_sge',
                                                             'offset' => '220',
                                                             'type' => '130'
                                                           },
                                                   '37' => {
                                                             'name' => 'max_pkeys',
                                                             'offset' => '224',
                                                             'type' => '814'
                                                           },
                                                   '38' => {
                                                             'name' => 'local_ca_ack_delay',
                                                             'offset' => '226',
                                                             'type' => '802'
                                                           },
                                                   '39' => {
                                                             'name' => 'phys_port_cnt',
                                                             'offset' => '227',
                                                             'type' => '802'
                                                           },
                                                   '4' => {
                                                            'name' => 'page_size_cap',
                                                            'offset' => '88',
                                                            'type' => '838'
                                                          },
                                                   '5' => {
                                                            'name' => 'vendor_id',
                                                            'offset' => '96',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'vendor_part_id',
                                                            'offset' => '100',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'hw_ver',
                                                            'offset' => '104',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_qp',
                                                            'offset' => '108',
                                                            'type' => '130'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_qp_wr',
                                                            'offset' => '112',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device_attr',
                                       'Size' => '232',
                                       'Type' => 'Struct'
                                     },
                          '110728' => {
                                        'Header' => undef,
                                        'Line' => '239',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'advise_mr',
                                                             'offset' => '0',
                                                             'type' => '79732'
                                                           },
                                                    '1' => {
                                                             'name' => 'alloc_dm',
                                                             'offset' => '8',
                                                             'type' => '79964'
                                                           },
                                                    '10' => {
                                                              'name' => 'bind_mw',
                                                              'offset' => '80',
                                                              'type' => '20613'
                                                            },
                                                    '11' => {
                                                              'name' => 'close_xrcd',
                                                              'offset' => '88',
                                                              'type' => '80758'
                                                            },
                                                    '12' => {
                                                              'name' => 'cq_event',
                                                              'offset' => '96',
                                                              'type' => '111805'
                                                            },
                                                    '13' => {
                                                              'name' => 'create_ah',
                                                              'offset' => '104',
                                                              'type' => '111837'
                                                            },
                                                    '14' => {
                                                              'name' => 'create_counters',
                                                              'offset' => '112',
                                                              'type' => '79870'
                                                            },
                                                    '15' => {
                                                              'name' => 'create_cq',
                                                              'offset' => '120',
                                                              'type' => '111873'
                                                            },
                                                    '16' => {
                                                              'name' => 'create_cq_ex',
                                                              'offset' => '128',
                                                              'type' => '80458'
                                                            },
                                                    '17' => {
                                                              'name' => 'create_flow',
                                                              'offset' => '136',
                                                              'type' => '80577'
                                                            },
                                                    '18' => {
                                                              'name' => 'create_flow_action_esp',
                                                              'offset' => '144',
                                                              'type' => '80070'
                                                            },
                                                    '19' => {
                                                              'name' => 'create_qp',
                                                              'offset' => '152',
                                                              'type' => '111905'
                                                            },
                                                    '2' => {
                                                             'name' => 'alloc_mw',
                                                             'offset' => '16',
                                                             'type' => '20576'
                                                           },
                                                    '20' => {
                                                              'name' => 'create_qp_ex',
                                                              'offset' => '160',
                                                              'type' => '80641'
                                                            },
                                                    '21' => {
                                                              'name' => 'create_rwq_ind_table',
                                                              'offset' => '168',
                                                              'type' => '80309'
                                                            },
                                                    '22' => {
                                                              'name' => 'create_srq',
                                                              'offset' => '176',
                                                              'type' => '111937'
                                                            },
                                                    '23' => {
                                                              'name' => 'create_srq_ex',
                                                              'offset' => '184',
                                                              'type' => '80705'
                                                            },
                                                    '24' => {
                                                              'name' => 'create_wq',
                                                              'offset' => '192',
                                                              'type' => '80394'
                                                            },
                                                    '25' => {
                                                              'name' => 'dealloc_mw',
                                                              'offset' => '200',
                                                              'type' => '20634'
                                                            },
                                                    '26' => {
                                                              'name' => 'dealloc_pd',
                                                              'offset' => '208',
                                                              'type' => '111958'
                                                            },
                                                    '27' => {
                                                              'name' => 'dealloc_td',
                                                              'offset' => '216',
                                                              'type' => '80155'
                                                            },
                                                    '28' => {
                                                              'name' => 'dereg_mr',
                                                              'offset' => '224',
                                                              'type' => '111985'
                                                            },
                                                    '29' => {
                                                              'name' => 'destroy_ah',
                                                              'offset' => '232',
                                                              'type' => '112006'
                                                            },
                                                    '3' => {
                                                             'name' => 'alloc_null_mr',
                                                             'offset' => '24',
                                                             'type' => '79753'
                                                           },
                                                    '30' => {
                                                              'name' => 'destroy_counters',
                                                              'offset' => '240',
                                                              'type' => '79891'
                                                            },
                                                    '31' => {
                                                              'name' => 'destroy_cq',
                                                              'offset' => '248',
                                                              'type' => '112027'
                                                            },
                                                    '32' => {
                                                              'name' => 'destroy_flow',
                                                              'offset' => '256',
                                                              'type' => '80538'
                                                            },
                                                    '33' => {
                                                              'name' => 'destroy_flow_action',
                                                              'offset' => '264',
                                                              'type' => '80044'
                                                            },
                                                    '34' => {
                                                              'name' => 'destroy_qp',
                                                              'offset' => '272',
                                                              'type' => '112048'
                                                            },
                                                    '35' => {
                                                              'name' => 'destroy_rwq_ind_table',
                                                              'offset' => '280',
                                                              'type' => '80277'
                                                            },
                                                    '36' => {
                                                              'name' => 'destroy_srq',
                                                              'offset' => '288',
                                                              'type' => '112069'
                                                            },
                                                    '37' => {
                                                              'name' => 'destroy_wq',
                                                              'offset' => '296',
                                                              'type' => '80330'
                                                            },
                                                    '38' => {
                                                              'name' => 'detach_mcast',
                                                              'offset' => '304',
                                                              'type' => '111788'
                                                            },
                                                    '39' => {
                                                              'name' => 'free_context',
                                                              'offset' => '312',
                                                              'type' => '19988'
                                                            },
                                                    '4' => {
                                                             'name' => 'alloc_parent_domain',
                                                             'offset' => '32',
                                                             'type' => '80134'
                                                           },
                                                    '40' => {
                                                              'name' => 'free_dm',
                                                              'offset' => '320',
                                                              'type' => '79985'
                                                            },
                                                    '41' => {
                                                              'name' => 'get_srq_num',
                                                              'offset' => '328',
                                                              'type' => '80673'
                                                            },
                                                    '42' => {
                                                              'name' => 'modify_cq',
                                                              'offset' => '336',
                                                              'type' => '80219'
                                                            },
                                                    '43' => {
                                                              'name' => 'modify_flow_action_esp',
                                                              'offset' => '344',
                                                              'type' => '80023'
                                                            },
                                                    '44' => {
                                                              'name' => 'modify_qp',
                                                              'offset' => '352',
                                                              'type' => '112106'
                                                            },
                                                    '45' => {
                                                              'name' => 'modify_qp_rate_limit',
                                                              'offset' => '360',
                                                              'type' => '80102'
                                                            },
                                                    '46' => {
                                                              'name' => 'modify_srq',
                                                              'offset' => '368',
                                                              'type' => '112143'
                                                            },
                                                    '47' => {
                                                              'name' => 'modify_wq',
                                                              'offset' => '376',
                                                              'type' => '80362'
                                                            },
                                                    '48' => {
                                                              'name' => 'open_qp',
                                                              'offset' => '384',
                                                              'type' => '80609'
                                                            },
                                                    '49' => {
                                                              'name' => 'open_xrcd',
                                                              'offset' => '392',
                                                              'type' => '80737'
                                                            },
                                                    '5' => {
                                                             'name' => 'alloc_pd',
                                                             'offset' => '40',
                                                             'type' => '111723'
                                                           },
                                                    '50' => {
                                                              'name' => 'poll_cq',
                                                              'offset' => '400',
                                                              'type' => '20671'
                                                            },
                                                    '51' => {
                                                              'name' => 'post_recv',
                                                              'offset' => '408',
                                                              'type' => '20796'
                                                            },
                                                    '52' => {
                                                              'name' => 'post_send',
                                                              'offset' => '416',
                                                              'type' => '20765'
                                                            },
                                                    '53' => {
                                                              'name' => 'post_srq_ops',
                                                              'offset' => '424',
                                                              'type' => '80256'
                                                            },
                                                    '54' => {
                                                              'name' => 'post_srq_recv',
                                                              'offset' => '432',
                                                              'type' => '20728'
                                                            },
                                                    '55' => {
                                                              'name' => 'query_device',
                                                              'offset' => '440',
                                                              'type' => '112175'
                                                            },
                                                    '56' => {
                                                              'name' => 'query_device_ex',
                                                              'offset' => '448',
                                                              'type' => '80517'
                                                            },
                                                    '57' => {
                                                              'name' => 'query_port',
                                                              'offset' => '456',
                                                              'type' => '112206'
                                                            },
                                                    '58' => {
                                                              'name' => 'query_qp',
                                                              'offset' => '464',
                                                              'type' => '112242'
                                                            },
                                                    '59' => {
                                                              'name' => 'query_rt_values',
                                                              'offset' => '472',
                                                              'type' => '80426'
                                                            },
                                                    '6' => {
                                                             'name' => 'alloc_td',
                                                             'offset' => '48',
                                                             'type' => '80187'
                                                           },
                                                    '60' => {
                                                              'name' => 'query_srq',
                                                              'offset' => '480',
                                                              'type' => '112268'
                                                            },
                                                    '61' => {
                                                              'name' => 'read_counters',
                                                              'offset' => '488',
                                                              'type' => '79795'
                                                            },
                                                    '62' => {
                                                              'name' => 'reg_dm_mr',
                                                              'offset' => '496',
                                                              'type' => '79932'
                                                            },
                                                    '63' => {
                                                              'name' => 'reg_mr',
                                                              'offset' => '504',
                                                              'type' => '112309'
                                                            },
                                                    '64' => {
                                                              'name' => 'req_notify_cq',
                                                              'offset' => '512',
                                                              'type' => '20697'
                                                            },
                                                    '65' => {
                                                              'name' => 'rereg_mr',
                                                              'offset' => '520',
                                                              'type' => '112355'
                                                            },
                                                    '66' => {
                                                              'name' => 'resize_cq',
                                                              'offset' => '528',
                                                              'type' => '20697'
                                                            },
                                                    '7' => {
                                                             'name' => 'async_event',
                                                             'offset' => '56',
                                                             'type' => '111751'
                                                           },
                                                    '8' => {
                                                             'name' => 'attach_counters_point_flow',
                                                             'offset' => '64',
                                                             'type' => '79838'
                                                           },
                                                    '9' => {
                                                             'name' => 'attach_mcast',
                                                             'offset' => '72',
                                                             'type' => '111788'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_context_ops',
                                        'Size' => '536',
                                        'Type' => 'Struct'
                                      },
                          '111723' => {
                                        'Name' => 'struct ibv_pd*(*)(struct ibv_context*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '10735'
                                                            }
                                                   },
                                        'Return' => '13881',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111745' => {
                                        'BaseType' => '101407',
                                        'Name' => 'struct ibv_async_event*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111751' => {
                                        'Name' => 'void(*)(struct ibv_context*, struct ibv_async_event*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '10735'
                                                            },
                                                     '1' => {
                                                              'type' => '111745'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111788' => {
                                        'Name' => 'int(*)(struct ibv_qp*, union ibv_gid const*, uint16_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12425'
                                                            },
                                                     '1' => {
                                                              'type' => '26634'
                                                            },
                                                     '2' => {
                                                              'type' => '814'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111805' => {
                                        'Name' => 'void(*)(struct ibv_cq*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12223'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111837' => {
                                        'Name' => 'struct ibv_ah*(*)(struct ibv_pd*, struct ibv_ah_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '13881'
                                                            },
                                                     '1' => {
                                                              'type' => '26640'
                                                            }
                                                   },
                                        'Return' => '16189',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111873' => {
                                        'Name' => 'struct ibv_cq*(*)(struct ibv_context*, int, struct ibv_comp_channel*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '10735'
                                                            },
                                                     '1' => {
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'type' => '17624'
                                                            },
                                                     '3' => {
                                                              'type' => '130'
                                                            }
                                                   },
                                        'Return' => '12223',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111905' => {
                                        'Name' => 'struct ibv_qp*(*)(struct ibv_pd*, struct ibv_qp_init_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '13881'
                                                            },
                                                     '1' => {
                                                              'type' => '26646'
                                                            }
                                                   },
                                        'Return' => '12425',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111931' => {
                                        'BaseType' => '102705',
                                        'Name' => 'struct ibv_srq_init_attr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111937' => {
                                        'Name' => 'struct ibv_srq*(*)(struct ibv_pd*, struct ibv_srq_init_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '13881'
                                                            },
                                                     '1' => {
                                                              'type' => '111931'
                                                            }
                                                   },
                                        'Return' => '12543',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111958' => {
                                        'Name' => 'int(*)(struct ibv_pd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '13881'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '111985' => {
                                        'Name' => 'int(*)(struct verbs_mr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '26652'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112006' => {
                                        'Name' => 'int(*)(struct ibv_ah*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '16189'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112027' => {
                                        'Name' => 'int(*)(struct ibv_cq*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12223'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112048' => {
                                        'Name' => 'int(*)(struct ibv_qp*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12425'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112069' => {
                                        'Name' => 'int(*)(struct ibv_srq*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12543'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112106' => {
                                        'Name' => 'int(*)(struct ibv_qp*, struct ibv_qp_attr*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12425'
                                                            },
                                                     '1' => {
                                                              'type' => '26658'
                                                            },
                                                     '2' => {
                                                              'type' => '130'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112143' => {
                                        'Name' => 'int(*)(struct ibv_srq*, struct ibv_srq_attr*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12543'
                                                            },
                                                     '1' => {
                                                              'type' => '26664'
                                                            },
                                                     '2' => {
                                                              'type' => '130'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112175' => {
                                        'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '10735'
                                                            },
                                                     '1' => {
                                                              'type' => '26670'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112206' => {
                                        'Name' => 'int(*)(struct ibv_context*, uint8_t, struct ibv_port_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '10735'
                                                            },
                                                     '1' => {
                                                              'type' => '802'
                                                            },
                                                     '2' => {
                                                              'type' => '79685'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112242' => {
                                        'Name' => 'int(*)(struct ibv_qp*, struct ibv_qp_attr*, int, struct ibv_qp_init_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12425'
                                                            },
                                                     '1' => {
                                                              'type' => '26658'
                                                            },
                                                     '2' => {
                                                              'type' => '130'
                                                            },
                                                     '3' => {
                                                              'type' => '26646'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112268' => {
                                        'Name' => 'int(*)(struct ibv_srq*, struct ibv_srq_attr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '12543'
                                                            },
                                                     '1' => {
                                                              'type' => '26664'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112309' => {
                                        'Name' => 'struct ibv_mr*(*)(struct ibv_pd*, void*, size_t, uint64_t, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '13881'
                                                            },
                                                     '1' => {
                                                              'type' => '71'
                                                            },
                                                     '2' => {
                                                              'type' => '52'
                                                            },
                                                     '3' => {
                                                              'type' => '838'
                                                            },
                                                     '4' => {
                                                              'type' => '130'
                                                            }
                                                   },
                                        'Return' => '13659',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112355' => {
                                        'Name' => 'int(*)(struct verbs_mr*, int, struct ibv_pd*, void*, size_t, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '26652'
                                                            },
                                                     '1' => {
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'type' => '13881'
                                                            },
                                                     '3' => {
                                                              'type' => '71'
                                                            },
                                                     '4' => {
                                                              'type' => '52'
                                                            },
                                                     '5' => {
                                                              'type' => '130'
                                                            }
                                                   },
                                        'Return' => '130',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '11275' => {
                                       'BaseType' => '186',
                                       'Name' => 'char[64]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '11291' => {
                                       'Header' => undef,
                                       'Line' => '199',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_device_ex_input',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '11318' => {
                                       'BaseType' => '11291',
                                       'Name' => 'struct ibv_query_device_ex_input const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '11323' => {
                                       'Header' => undef,
                                       'Line' => '214',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rc_odp_caps',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'uc_odp_caps',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud_odp_caps',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '11372' => {
                                       'Header' => undef,
                                       'Line' => '212',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'general_caps',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'per_transport_caps',
                                                            'offset' => '8',
                                                            'type' => '11323'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_odp_caps',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11412' => {
                                       'Header' => undef,
                                       'Line' => '226',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_tso',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_tso_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '11452' => {
                                       'Header' => undef,
                                       'Line' => '257',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_rwq_indirection_tables',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_rwq_indirection_table_size',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '3' => {
                                                            'name' => 'rx_hash_fields_mask',
                                                            'offset' => '16',
                                                            'type' => '838'
                                                          },
                                                   '4' => {
                                                            'name' => 'rx_hash_function',
                                                            'offset' => '24',
                                                            'type' => '802'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rss_caps',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '11537' => {
                                       'Header' => undef,
                                       'Line' => '265',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_rate_limit_min',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_rate_limit_max',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_packet_pacing_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '11594' => {
                                       'Header' => undef,
                                       'Line' => '282',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_rndv_hdr_size',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_num_tags',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_ops',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_tm_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '11679' => {
                                       'Header' => undef,
                                       'Line' => '295',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_cq_count',
                                                            'offset' => '0',
                                                            'type' => '814'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_cq_period',
                                                            'offset' => '2',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_moderation_caps',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '11722' => {
                                       'Header' => undef,
                                       'Line' => '310',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fetch_add',
                                                            'offset' => '0',
                                                            'type' => '814'
                                                          },
                                                   '1' => {
                                                            'name' => 'swap',
                                                            'offset' => '2',
                                                            'type' => '814'
                                                          },
                                                   '2' => {
                                                            'name' => 'compare_swap',
                                                            'offset' => '4',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_pci_atomic_caps',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '11779' => {
                                       'Header' => undef,
                                       'Line' => '316',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'orig_attr',
                                                            'offset' => '0',
                                                            'type' => '10741'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '232',
                                                            'type' => '826'
                                                          },
                                                   '10' => {
                                                             'name' => 'raw_packet_caps',
                                                             'offset' => '344',
                                                             'type' => '826'
                                                           },
                                                   '11' => {
                                                             'name' => 'tm_caps',
                                                             'offset' => '348',
                                                             'type' => '11594'
                                                           },
                                                   '12' => {
                                                             'name' => 'cq_mod_caps',
                                                             'offset' => '368',
                                                             'type' => '11679'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_dm_size',
                                                             'offset' => '376',
                                                             'type' => '838'
                                                           },
                                                   '14' => {
                                                             'name' => 'pci_atomic_caps',
                                                             'offset' => '384',
                                                             'type' => '11722'
                                                           },
                                                   '15' => {
                                                             'name' => 'xrc_odp_caps',
                                                             'offset' => '392',
                                                             'type' => '826'
                                                           },
                                                   '2' => {
                                                            'name' => 'odp_caps',
                                                            'offset' => '240',
                                                            'type' => '11372'
                                                          },
                                                   '3' => {
                                                            'name' => 'completion_timestamp_mask',
                                                            'offset' => '264',
                                                            'type' => '838'
                                                          },
                                                   '4' => {
                                                            'name' => 'hca_core_clock',
                                                            'offset' => '272',
                                                            'type' => '838'
                                                          },
                                                   '5' => {
                                                            'name' => 'device_cap_flags_ex',
                                                            'offset' => '280',
                                                            'type' => '838'
                                                          },
                                                   '6' => {
                                                            'name' => 'tso_caps',
                                                            'offset' => '288',
                                                            'type' => '11412'
                                                          },
                                                   '7' => {
                                                            'name' => 'rss_caps',
                                                            'offset' => '296',
                                                            'type' => '11452'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_wq_type_rq',
                                                            'offset' => '328',
                                                            'type' => '826'
                                                          },
                                                   '9' => {
                                                            'name' => 'packet_pacing_caps',
                                                            'offset' => '332',
                                                            'type' => '11537'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device_attr_ex',
                                       'Size' => '400',
                                       'Type' => 'Struct'
                                     },
                          '118' => {
                                     'BaseType' => '85',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '12032' => {
                                       'Header' => undef,
                                       'Line' => '335',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_MTU_256',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_MTU_512',
                                                            'value' => '2'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_MTU_1024',
                                                            'value' => '3'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_MTU_2048',
                                                            'value' => '4'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_MTU_4096',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_mtu',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12082' => {
                                       'Header' => undef,
                                       'Line' => '1410',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '17624'
                                                          },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '16',
                                                            'type' => '71'
                                                          },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '28',
                                                            'type' => '130'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '704'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '778'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '120',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '124',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '12223' => {
                                       'BaseType' => '12082',
                                       'Name' => 'struct ibv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12229' => {
                                       'Header' => undef,
                                       'Line' => '1219',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '8',
                                                            'type' => '71'
                                                          },
                                                   '10' => {
                                                             'name' => 'mutex',
                                                             'offset' => '64',
                                                             'type' => '704'
                                                           },
                                                   '11' => {
                                                             'name' => 'cond',
                                                             'offset' => '104',
                                                             'type' => '778'
                                                           },
                                                   '12' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '152',
                                                             'type' => '826'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '13881'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq',
                                                            'offset' => '24',
                                                            'type' => '12223'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq',
                                                            'offset' => '32',
                                                            'type' => '12223'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq',
                                                            'offset' => '40',
                                                            'type' => '12543'
                                                          },
                                                   '6' => {
                                                            'name' => 'handle',
                                                            'offset' => '48',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '52',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'state',
                                                            'offset' => '56',
                                                            'type' => '15251'
                                                          },
                                                   '9' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '60',
                                                            'type' => '14672'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp',
                                       'Size' => '160',
                                       'Type' => 'Struct'
                                     },
                          '12425' => {
                                       'BaseType' => '12229',
                                       'Name' => 'struct ibv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12431' => {
                                       'Header' => undef,
                                       'Line' => '1179',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_context',
                                                            'offset' => '8',
                                                            'type' => '71'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '13881'
                                                          },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '704'
                                                          },
                                                   '5' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '778'
                                                          },
                                                   '6' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '120',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_srq',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '12543' => {
                                       'BaseType' => '12431',
                                       'Name' => 'struct ibv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12549' => {
                                       'Header' => undef,
                                       'Line' => '1201',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_context',
                                                            'offset' => '8',
                                                            'type' => '71'
                                                          },
                                                   '10' => {
                                                             'name' => 'cond',
                                                             'offset' => '96',
                                                             'type' => '778'
                                                           },
                                                   '11' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '144',
                                                             'type' => '826'
                                                           },
                                                   '12' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '148',
                                                             'type' => '826'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '13881'
                                                          },
                                                   '3' => {
                                                            'name' => 'cq',
                                                            'offset' => '24',
                                                            'type' => '12223'
                                                          },
                                                   '4' => {
                                                            'name' => 'wq_num',
                                                            'offset' => '32',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle',
                                                            'offset' => '36',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'state',
                                                            'offset' => '40',
                                                            'type' => '14339'
                                                          },
                                                   '7' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '44',
                                                            'type' => '14263'
                                                          },
                                                   '8' => {
                                                            'name' => 'post_recv',
                                                            'offset' => '48',
                                                            'type' => '16756'
                                                          },
                                                   '9' => {
                                                            'name' => 'mutex',
                                                            'offset' => '56',
                                                            'type' => '704'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '12744' => {
                                       'BaseType' => '12549',
                                       'Name' => 'struct ibv_wq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12750' => {
                                       'Header' => undef,
                                       'Line' => '453',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WC_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WC_LOC_LEN_ERR',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WC_REM_OP_ERR',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'IBV_WC_REM_ABORT_ERR',
                                                             'value' => '16'
                                                           },
                                                   '17' => {
                                                             'name' => 'IBV_WC_INV_EECN_ERR',
                                                             'value' => '17'
                                                           },
                                                   '18' => {
                                                             'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                             'value' => '18'
                                                           },
                                                   '19' => {
                                                             'name' => 'IBV_WC_FATAL_ERR',
                                                             'value' => '19'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                            'value' => '2'
                                                          },
                                                   '20' => {
                                                             'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                             'value' => '20'
                                                           },
                                                   '21' => {
                                                             'name' => 'IBV_WC_GENERAL_ERR',
                                                             'value' => '21'
                                                           },
                                                   '22' => {
                                                             'name' => 'IBV_WC_TM_ERR',
                                                             'value' => '22'
                                                           },
                                                   '23' => {
                                                             'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                             'value' => '23'
                                                           },
                                                   '3' => {
                                                            'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WC_LOC_PROT_ERR',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WC_MW_BIND_ERR',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WC_BAD_RESP_ERR',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wc_status',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12914' => {
                                       'Header' => undef,
                                       'Line' => '481',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WC_SEND',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WC_RDMA_WRITE',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WC_TM_ADD',
                                                             'value' => '130'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WC_TM_DEL',
                                                             'value' => '131'
                                                           },
                                                   '12' => {
                                                             'name' => 'IBV_WC_TM_SYNC',
                                                             'value' => '132'
                                                           },
                                                   '13' => {
                                                             'name' => 'IBV_WC_TM_RECV',
                                                             'value' => '133'
                                                           },
                                                   '14' => {
                                                             'name' => 'IBV_WC_TM_NO_TAG',
                                                             'value' => '134'
                                                           },
                                                   '15' => {
                                                             'name' => 'IBV_WC_DRIVER1',
                                                             'value' => '135'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WC_RDMA_READ',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WC_COMP_SWAP',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WC_FETCH_ADD',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WC_BIND_MW',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WC_LOCAL_INV',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WC_TSO',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WC_RECV',
                                                            'value' => '128'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                            'value' => '129'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wc_opcode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '130' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1305' => {
                                      'Header' => undef,
                                      'Line' => '129',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max_cq_moderation_count',
                                                           'offset' => '0',
                                                           'type' => '874'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_cq_moderation_period',
                                                           'offset' => '2',
                                                           'type' => '874'
                                                         },
                                                  '2' => {
                                                           'name' => 'reserved',
                                                           'offset' => '4',
                                                           'type' => '886'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_cq_moderation_caps',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '131347' => {
                                        'BaseType' => '26524',
                                        'Name' => 'struct verbs_flow_action*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '13170' => {
                                       'Header' => undef,
                                       'Line' => '562',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '922'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidated_rkey',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '13207' => {
                                       'Header' => undef,
                                       'Line' => '553',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '12750'
                                                          },
                                                   '10' => {
                                                             'name' => 'slid',
                                                             'offset' => '42',
                                                             'type' => '814'
                                                           },
                                                   '11' => {
                                                             'name' => 'sl',
                                                             'offset' => '44',
                                                             'type' => '802'
                                                           },
                                                   '12' => {
                                                             'name' => 'dlid_path_bits',
                                                             'offset' => '45',
                                                             'type' => '802'
                                                           },
                                                   '2' => {
                                                            'name' => 'opcode',
                                                            'offset' => '12',
                                                            'type' => '12914'
                                                          },
                                                   '3' => {
                                                            'name' => 'vendor_err',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'byte_len',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '13170'
                                                          },
                                                   '6' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '28',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'src_qp',
                                                            'offset' => '32',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '36',
                                                            'type' => '64'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '40',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wc',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '134717' => {
                                        'BaseType' => '71',
                                        'Name' => 'void**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '13472' => {
                                       'Header' => undef,
                                       'Line' => '587',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mr',
                                                            'offset' => '0',
                                                            'type' => '13659'
                                                          },
                                                   '1' => {
                                                            'name' => 'addr',
                                                            'offset' => '8',
                                                            'type' => '838'
                                                          },
                                                   '2' => {
                                                            'name' => 'length',
                                                            'offset' => '16',
                                                            'type' => '838'
                                                          },
                                                   '3' => {
                                                            'name' => 'mw_access_flags',
                                                            'offset' => '24',
                                                            'type' => '64'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '13542' => {
                                       'BaseType' => '13472',
                                       'Name' => 'struct ibv_mw_bind_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '13547' => {
                                       'Header' => undef,
                                       'Line' => '631',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '13881'
                                                          },
                                                   '2' => {
                                                            'name' => 'addr',
                                                            'offset' => '16',
                                                            'type' => '71'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '52'
                                                          },
                                                   '4' => {
                                                            'name' => 'handle',
                                                            'offset' => '32',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'lkey',
                                                            'offset' => '36',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'rkey',
                                                            'offset' => '40',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1358' => {
                                      'Header' => undef,
                                      'Line' => '146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'command',
                                                           'offset' => '0',
                                                           'type' => '886'
                                                         },
                                                  '1' => {
                                                           'name' => 'in_words',
                                                           'offset' => '4',
                                                           'type' => '874'
                                                         },
                                                  '2' => {
                                                           'name' => 'out_words',
                                                           'offset' => '6',
                                                           'type' => '874'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_cmd_hdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '13659' => {
                                       'BaseType' => '13547',
                                       'Name' => 'struct ibv_mr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13665' => {
                                       'Header' => undef,
                                       'Line' => '594',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '137' => {
                                     'BaseType' => '64',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '13746' => {
                                       'Header' => undef,
                                       'Line' => '613',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '4',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'oflags',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_xrcd_init_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '13802' => {
                                       'Header' => undef,
                                       'Line' => '619',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_xrcd',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '13881' => {
                                       'BaseType' => '13665',
                                       'Name' => 'struct ibv_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13887' => {
                                       'Header' => undef,
                                       'Line' => '641',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_MW_TYPE_1',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_MW_TYPE_2',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_mw_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13919' => {
                                       'Header' => undef,
                                       'Line' => '646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '13881'
                                                          },
                                                   '2' => {
                                                            'name' => 'rkey',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'type',
                                                            'offset' => '24',
                                                            'type' => '13887'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '14003' => {
                                       'Header' => undef,
                                       'Line' => '654',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '10398'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '20',
                                                            'type' => '802'
                                                          },
                                                   '3' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '21',
                                                            'type' => '802'
                                                          },
                                                   '4' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '22',
                                                            'type' => '802'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_global_route',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14088' => {
                                       'Header' => undef,
                                       'Line' => '723',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'grh',
                                                            'offset' => '0',
                                                            'type' => '14003'
                                                          },
                                                   '1' => {
                                                            'name' => 'dlid',
                                                            'offset' => '24',
                                                            'type' => '814'
                                                          },
                                                   '2' => {
                                                            'name' => 'sl',
                                                            'offset' => '26',
                                                            'type' => '802'
                                                          },
                                                   '3' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '27',
                                                            'type' => '802'
                                                          },
                                                   '4' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '28',
                                                            'type' => '802'
                                                          },
                                                   '5' => {
                                                            'name' => 'is_global',
                                                            'offset' => '29',
                                                            'type' => '802'
                                                          },
                                                   '6' => {
                                                            'name' => 'port_num',
                                                            'offset' => '30',
                                                            'type' => '802'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1411' => {
                                      'Header' => undef,
                                      'Line' => '152',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'provider_in_words',
                                                           'offset' => '8',
                                                           'type' => '874'
                                                         },
                                                  '2' => {
                                                           'name' => 'provider_out_words',
                                                           'offset' => '10',
                                                           'type' => '874'
                                                         },
                                                  '3' => {
                                                           'name' => 'cmd_hdr_reserved',
                                                           'offset' => '12',
                                                           'type' => '886'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_ex_cmd_hdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '14200' => {
                                       'Header' => undef,
                                       'Line' => '738',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_srq_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14257' => {
                                       'BaseType' => '13802',
                                       'Name' => 'struct ibv_xrcd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14263' => {
                                       'Header' => undef,
                                       'Line' => '781',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WQT_RQ',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wq_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '14339' => {
                                       'Header' => undef,
                                       'Line' => '809',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WQS_RESET',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WQS_RDY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_WQS_ERR',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WQS_UNKNOWN',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wq_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '14427' => {
                                       'Header' => undef,
                                       'Line' => '823',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '4',
                                                            'type' => '14339'
                                                          },
                                                   '2' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '8',
                                                            'type' => '14339'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq_attr',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '14512' => {
                                       'Header' => undef,
                                       'Line' => '841',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '130'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14609' => {
                                       'Header' => undef,
                                       'Line' => '855',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_ind_tbl_size',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl',
                                                            'offset' => '8',
                                                            'type' => '14666'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14666' => {
                                       'BaseType' => '12744',
                                       'Name' => 'struct ibv_wq**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14672' => {
                                       'Header' => undef,
                                       'Line' => '862',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_QPT_RC',
                                                            'value' => '2'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_QPT_UC',
                                                            'value' => '3'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_QPT_UD',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_QPT_RAW_PACKET',
                                                            'value' => '8'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_QPT_XRC_SEND',
                                                            'value' => '9'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_QPT_XRC_RECV',
                                                            'value' => '10'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_QPT_DRIVER',
                                                            'value' => '255'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_qp_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '14734' => {
                                       'Header' => undef,
                                       'Line' => '872',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_cap',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '1479' => {
                                      'Header' => undef,
                                      'Line' => '170',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '8',
                                                           'type' => '1522'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_query_device',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '14819' => {
                                       'Header' => undef,
                                       'Line' => '880',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '0',
                                                            'type' => '71'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_cq',
                                                            'offset' => '8',
                                                            'type' => '12223'
                                                          },
                                                   '2' => {
                                                            'name' => 'recv_cq',
                                                            'offset' => '16',
                                                            'type' => '12223'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq',
                                                            'offset' => '24',
                                                            'type' => '12543'
                                                          },
                                                   '4' => {
                                                            'name' => 'cap',
                                                            'offset' => '32',
                                                            'type' => '14734'
                                                          },
                                                   '5' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '52',
                                                            'type' => '14672'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_sig_all',
                                                            'offset' => '56',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_init_attr',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '149' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '14932' => {
                                       'BaseType' => '14512',
                                       'Name' => 'struct ibv_rwq_ind_table*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14988' => {
                                       'Header' => undef,
                                       'Line' => '960',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '8',
                                                            'type' => '14257'
                                                          },
                                                   '3' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '16',
                                                            'type' => '71'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '14672'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_open_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1522' => {
                                      'BaseType' => '898',
                                      'Name' => '__u64[]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '15251' => {
                                       'Header' => undef,
                                       'Line' => '1000',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_QPS_RESET',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_QPS_INIT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_QPS_RTR',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_QPS_RTS',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_QPS_SQD',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_QPS_SQE',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_QPS_ERR',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_QPS_UNKNOWN',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_qp_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15319' => {
                                       'Header' => undef,
                                       'Line' => '1011',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_MIG_MIGRATED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_MIG_REARM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_MIG_ARMED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_mig_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15357' => {
                                       'Header' => undef,
                                       'Line' => '1017',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_state',
                                                            'offset' => '0',
                                                            'type' => '15251'
                                                          },
                                                   '1' => {
                                                            'name' => 'cur_qp_state',
                                                            'offset' => '4',
                                                            'type' => '15251'
                                                          },
                                                   '10' => {
                                                             'name' => 'ah_attr',
                                                             'offset' => '56',
                                                             'type' => '14088'
                                                           },
                                                   '11' => {
                                                             'name' => 'alt_ah_attr',
                                                             'offset' => '88',
                                                             'type' => '14088'
                                                           },
                                                   '12' => {
                                                             'name' => 'pkey_index',
                                                             'offset' => '120',
                                                             'type' => '814'
                                                           },
                                                   '13' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '122',
                                                             'type' => '814'
                                                           },
                                                   '14' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '124',
                                                             'type' => '802'
                                                           },
                                                   '15' => {
                                                             'name' => 'sq_draining',
                                                             'offset' => '125',
                                                             'type' => '802'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '126',
                                                             'type' => '802'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '127',
                                                             'type' => '802'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '128',
                                                             'type' => '802'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '129',
                                                             'type' => '802'
                                                           },
                                                   '2' => {
                                                            'name' => 'path_mtu',
                                                            'offset' => '8',
                                                            'type' => '12032'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '130',
                                                             'type' => '802'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '131',
                                                             'type' => '802'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '132',
                                                             'type' => '802'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '133',
                                                             'type' => '802'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '134',
                                                             'type' => '802'
                                                           },
                                                   '25' => {
                                                             'name' => 'rate_limit',
                                                             'offset' => '136',
                                                             'type' => '826'
                                                           },
                                                   '3' => {
                                                            'name' => 'path_mig_state',
                                                            'offset' => '12',
                                                            'type' => '15319'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '28',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '32',
                                                            'type' => '64'
                                                          },
                                                   '9' => {
                                                            'name' => 'cap',
                                                            'offset' => '36',
                                                            'type' => '14734'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_attr',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '1538' => {
                                      'Header' => undef,
                                      'Line' => '175',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '8',
                                                           'type' => '934'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '60',
                                                            'type' => '886'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '64',
                                                            'type' => '886'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '68',
                                                            'type' => '886'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '72',
                                                            'type' => '886'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '76',
                                                            'type' => '886'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '80',
                                                            'type' => '886'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '84',
                                                            'type' => '886'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '88',
                                                            'type' => '886'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '92',
                                                            'type' => '886'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '96',
                                                            'type' => '886'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '16',
                                                           'type' => '934'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '100',
                                                            'type' => '886'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '104',
                                                            'type' => '886'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '108',
                                                            'type' => '886'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '112',
                                                            'type' => '886'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '116',
                                                            'type' => '886'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '120',
                                                            'type' => '886'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '124',
                                                            'type' => '886'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '128',
                                                            'type' => '886'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '132',
                                                            'type' => '886'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '136',
                                                            'type' => '886'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '24',
                                                           'type' => '898'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '140',
                                                            'type' => '886'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '144',
                                                            'type' => '886'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '148',
                                                            'type' => '886'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '152',
                                                            'type' => '886'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '156',
                                                            'type' => '886'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '160',
                                                            'type' => '886'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '164',
                                                            'type' => '886'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '168',
                                                            'type' => '874'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '170',
                                                            'type' => '862'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '171',
                                                            'type' => '862'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '32',
                                                           'type' => '898'
                                                         },
                                                  '40' => {
                                                            'name' => 'reserved',
                                                            'offset' => '172',
                                                            'type' => '2089'
                                                          },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '40',
                                                           'type' => '886'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '44',
                                                           'type' => '886'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '48',
                                                           'type' => '886'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '52',
                                                           'type' => '886'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '56',
                                                           'type' => '886'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_query_device_resp',
                                      'Size' => '176',
                                      'Type' => 'Struct'
                                    },
                          '156' => {
                                     'BaseType' => '45',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '15736' => {
                                       'Header' => undef,
                                       'Line' => '1053',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WR_RDMA_WRITE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WR_TSO',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WR_DRIVER1',
                                                             'value' => '11'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WR_SEND',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WR_SEND_WITH_IMM',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WR_RDMA_READ',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WR_LOCAL_INV',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WR_BIND_MW',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WR_SEND_WITH_INV',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wr_opcode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15828' => {
                                       'Header' => undef,
                                       'Line' => '1076',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '71'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_data_buf',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '15871' => {
                                       'BaseType' => '15828',
                                       'Name' => 'struct ibv_data_buf const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '15876' => {
                                       'Header' => undef,
                                       'Line' => '1081',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'lkey',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_sge',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '15933' => {
                                       'BaseType' => '15876',
                                       'Name' => 'struct ibv_sge const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '15938' => {
                                       'Header' => undef,
                                       'Line' => '1097',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '922'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '15975' => {
                                       'Header' => undef,
                                       'Line' => '1102',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16014' => {
                                       'Header' => undef,
                                       'Line' => '1106',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '838'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '16',
                                                            'type' => '838'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '16081' => {
                                       'Header' => undef,
                                       'Line' => '1112',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '16189'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16133' => {
                                       'Header' => undef,
                                       'Line' => '1597',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '13881'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16189' => {
                                       'BaseType' => '16133',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16195' => {
                                       'Header' => undef,
                                       'Line' => '1101',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '15975'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '16014'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '16081'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '16244' => {
                                       'Header' => undef,
                                       'Line' => '1119',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16269' => {
                                       'Header' => undef,
                                       'Line' => '1118',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '16244'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '16293' => {
                                       'Header' => undef,
                                       'Line' => '1124',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '16345'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '13472'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '16345' => {
                                       'BaseType' => '13919',
                                       'Name' => 'struct ibv_mw*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16351' => {
                                       'Header' => undef,
                                       'Line' => '1129',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '71'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '814'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '10',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16404' => {
                                       'Header' => undef,
                                       'Line' => '1123',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '16293'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '16351'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '16441' => {
                                       'Header' => undef,
                                       'Line' => '1087',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '16579'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '16585'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '130'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '28',
                                                            'type' => '15736'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '32',
                                                            'type' => '64'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '36',
                                                            'type' => '15938'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '40',
                                                            'type' => '16195'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '72',
                                                            'type' => '16269'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '80',
                                                            'type' => '16404'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '16579' => {
                                       'BaseType' => '16441',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16585' => {
                                       'BaseType' => '15876',
                                       'Name' => 'struct ibv_sge*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16591' => {
                                       'Header' => undef,
                                       'Line' => '1137',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '16662'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '16585'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_recv_wr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '16662' => {
                                       'BaseType' => '16591',
                                       'Name' => 'struct ibv_recv_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16668' => {
                                       'Header' => undef,
                                       'Line' => '1173',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '8',
                                                            'type' => '64'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '13472'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '16750' => {
                                       'BaseType' => '16662',
                                       'Name' => 'struct ibv_recv_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16756' => {
                                       'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12744'
                                                           },
                                                    '1' => {
                                                             'type' => '16662'
                                                           },
                                                    '2' => {
                                                             'type' => '16750'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '16762' => {
                                       'Header' => undef,
                                       'Line' => '1236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_base',
                                                            'offset' => '0',
                                                            'type' => '12229'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '160',
                                                            'type' => '838'
                                                          },
                                                   '10' => {
                                                             'name' => 'wr_rdma_write_imm',
                                                             'offset' => '232',
                                                             'type' => '17313'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_send',
                                                             'offset' => '240',
                                                             'type' => '17330'
                                                           },
                                                   '12' => {
                                                             'name' => 'wr_send_imm',
                                                             'offset' => '248',
                                                             'type' => '17352'
                                                           },
                                                   '13' => {
                                                             'name' => 'wr_send_inv',
                                                             'offset' => '256',
                                                             'type' => '17254'
                                                           },
                                                   '14' => {
                                                             'name' => 'wr_send_tso',
                                                             'offset' => '264',
                                                             'type' => '17384'
                                                           },
                                                   '15' => {
                                                             'name' => 'wr_set_ud_addr',
                                                             'offset' => '272',
                                                             'type' => '17416'
                                                           },
                                                   '16' => {
                                                             'name' => 'wr_set_xrc_srqn',
                                                             'offset' => '280',
                                                             'type' => '17254'
                                                           },
                                                   '17' => {
                                                             'name' => 'wr_set_inline_data',
                                                             'offset' => '288',
                                                             'type' => '17443'
                                                           },
                                                   '18' => {
                                                             'name' => 'wr_set_inline_data_list',
                                                             'offset' => '296',
                                                             'type' => '17476'
                                                           },
                                                   '19' => {
                                                             'name' => 'wr_set_sge',
                                                             'offset' => '304',
                                                             'type' => '17508'
                                                           },
                                                   '2' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '168',
                                                            'type' => '838'
                                                          },
                                                   '20' => {
                                                             'name' => 'wr_set_sge_list',
                                                             'offset' => '312',
                                                             'type' => '17541'
                                                           },
                                                   '21' => {
                                                             'name' => 'wr_start',
                                                             'offset' => '320',
                                                             'type' => '17330'
                                                           },
                                                   '22' => {
                                                             'name' => 'wr_complete',
                                                             'offset' => '328',
                                                             'type' => '17562'
                                                           },
                                                   '23' => {
                                                             'name' => 'wr_abort',
                                                             'offset' => '336',
                                                             'type' => '17330'
                                                           },
                                                   '3' => {
                                                            'name' => 'wr_flags',
                                                            'offset' => '176',
                                                            'type' => '64'
                                                          },
                                                   '4' => {
                                                            'name' => 'wr_atomic_cmp_swp',
                                                            'offset' => '184',
                                                            'type' => '17162'
                                                          },
                                                   '5' => {
                                                            'name' => 'wr_atomic_fetch_add',
                                                            'offset' => '192',
                                                            'type' => '17194'
                                                          },
                                                   '6' => {
                                                            'name' => 'wr_bind_mw',
                                                            'offset' => '200',
                                                            'type' => '17232'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr_local_inv',
                                                            'offset' => '208',
                                                            'type' => '17254'
                                                          },
                                                   '8' => {
                                                            'name' => 'wr_rdma_read',
                                                            'offset' => '216',
                                                            'type' => '17281'
                                                          },
                                                   '9' => {
                                                            'name' => 'wr_rdma_write',
                                                            'offset' => '224',
                                                            'type' => '17281'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_ex',
                                       'Size' => '344',
                                       'Type' => 'Struct'
                                     },
                          '17156' => {
                                       'BaseType' => '16762',
                                       'Name' => 'struct ibv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17162' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, uint64_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '838'
                                                           },
                                                    '4' => {
                                                             'type' => '838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17194' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17226' => {
                                       'BaseType' => '13542',
                                       'Name' => 'struct ibv_mw_bind_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17232' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, struct ibv_mw*, uint32_t, struct ibv_mw_bind_info const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '16345'
                                                           },
                                                    '2' => {
                                                             'type' => '826'
                                                           },
                                                    '3' => {
                                                             'type' => '17226'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17254' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17281' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17313' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, __be32)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '922'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17330' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17352' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, __be32)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '922'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17384' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, void*, uint16_t, uint16_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '71'
                                                           },
                                                    '2' => {
                                                             'type' => '814'
                                                           },
                                                    '3' => {
                                                             'type' => '814'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17416' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, struct ibv_ah*, uint32_t, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '16189'
                                                           },
                                                    '2' => {
                                                             'type' => '826'
                                                           },
                                                    '3' => {
                                                             'type' => '826'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17443' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, void*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '71'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17470' => {
                                       'BaseType' => '15871',
                                       'Name' => 'struct ibv_data_buf const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17476' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, size_t, struct ibv_data_buf const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '52'
                                                           },
                                                    '2' => {
                                                             'type' => '17470'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17508' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '826'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17535' => {
                                       'BaseType' => '15933',
                                       'Name' => 'struct ibv_sge const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17541' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, size_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           },
                                                    '1' => {
                                                             'type' => '52'
                                                           },
                                                    '2' => {
                                                             'type' => '17535'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17562' => {
                                       'Name' => 'int(*)(struct ibv_qp_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17156'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17568' => {
                                       'Header' => undef,
                                       'Line' => '1404',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '10735'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '12',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17624' => {
                                       'BaseType' => '17568',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '176260' => {
                                        'Header' => undef,
                                        'Line' => '561',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'response',
                                                             'offset' => '0',
                                                             'type' => '898'
                                                           },
                                                    '1' => {
                                                             'name' => 'user_handle',
                                                             'offset' => '8',
                                                             'type' => '898'
                                                           },
                                                    '10' => {
                                                              'name' => 'max_inline_data',
                                                              'offset' => '48',
                                                              'type' => '886'
                                                            },
                                                    '11' => {
                                                              'name' => 'sq_sig_all',
                                                              'offset' => '52',
                                                              'type' => '862'
                                                            },
                                                    '12' => {
                                                              'name' => 'qp_type',
                                                              'offset' => '53',
                                                              'type' => '862'
                                                            },
                                                    '13' => {
                                                              'name' => 'is_srq',
                                                              'offset' => '54',
                                                              'type' => '862'
                                                            },
                                                    '14' => {
                                                              'name' => 'reserved',
                                                              'offset' => '55',
                                                              'type' => '862'
                                                            },
                                                    '15' => {
                                                              'name' => 'driver_data',
                                                              'offset' => '56',
                                                              'type' => '1522'
                                                            },
                                                    '2' => {
                                                             'name' => 'pd_handle',
                                                             'offset' => '16',
                                                             'type' => '886'
                                                           },
                                                    '3' => {
                                                             'name' => 'send_cq_handle',
                                                             'offset' => '20',
                                                             'type' => '886'
                                                           },
                                                    '4' => {
                                                             'name' => 'recv_cq_handle',
                                                             'offset' => '24',
                                                             'type' => '886'
                                                           },
                                                    '5' => {
                                                             'name' => 'srq_handle',
                                                             'offset' => '28',
                                                             'type' => '886'
                                                           },
                                                    '6' => {
                                                             'name' => 'max_send_wr',
                                                             'offset' => '32',
