$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.7',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'Compiler' => 'clang version 4.0.1-svn305264-1~exp1 (branches/release_40)',
          'Headers' => {
                         'driver.h' => 1,
                         'ib_user_sa.h' => 1,
                         'int-ll64.h' => 1,
                         'kern-abi.h' => 1,
                         'list.h' => 1,
                         'pthreadtypes.h' => 1,
                         'sa.h' => 1,
                         'stdatomic.h' => 1,
                         'stddef.h' => 1,
                         'stdint.h' => 1,
                         'time.h' => 1,
                         'types.h' => 1,
                         'verbs.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libibverbs.so.1.1.15',
          'LibraryVersion' => 'ibverbs',
          'LocalSymbols' => {},
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libnl-3.so.200' => 1,
                        'libnl-route-3.so.200' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {
                         'cmd.c' => 1,
                         'compat-1_0.c' => 1,
                         'device.c' => 1,
                         'enum_strs.c' => 1,

                                                     'ibv_node_type_str@@IBVERBS_1.1' => 1,
                                                     'ibv_open_device@@IBVERBS_1.1' => 1,
                                                     'ibv_open_device@IBVERBS_1.0' => 1,
                                                     'ibv_port_state_str@@IBVERBS_1.1' => 1,
                                                     'ibv_query_device@@IBVERBS_1.1' => 1,
                                                     'ibv_query_device@IBVERBS_1.0' => 1,
                                                     'ibv_query_gid@@IBVERBS_1.1' => 1,
                                                     'ibv_query_gid@IBVERBS_1.0' => 1,
                                                     'ibv_query_gid_type@@IBVERBS_PRIVATE_15' => 1,
                                                     'ibv_query_pkey@@IBVERBS_1.1' => 1,
                                                     'ibv_query_pkey@IBVERBS_1.0' => 1,
                                                     'ibv_query_port@@IBVERBS_1.1' => 1,
                                                     'ibv_query_port@IBVERBS_1.0' => 1,
                                                     'ibv_query_qp@@IBVERBS_1.1' => 1,
                                                     'ibv_query_qp@IBVERBS_1.0' => 1,
                                                     'ibv_query_srq@@IBVERBS_1.1' => 1,
                                                     'ibv_query_srq@IBVERBS_1.0' => 1,
                                                     'ibv_rate_to_mbps@@IBVERBS_1.1' => 1,
                                                     'ibv_rate_to_mult@@IBVERBS_1.0' => 1,
                                                     'ibv_read_sysfs_file@@IBVERBS_1.0' => 1,
                                                     'ibv_reg_mr@@IBVERBS_1.1' => 1,
                                                     'ibv_reg_mr@IBVERBS_1.0' => 1,
                                                     'ibv_register_driver@IBVERBS_1.1' => 1,
                                                     'ibv_rereg_mr@@IBVERBS_1.1' => 1,
                                                     'ibv_resize_cq@@IBVERBS_1.1' => 1,
                                                     'ibv_resize_cq@IBVERBS_1.0' => 1,
                                                     'ibv_resolve_eth_l2_from_gid@@IBVERBS_1.1' => 1,
                                                     'ibv_wc_status_str@@IBVERBS_1.1' => 1,
                                                     'mbps_to_ibv_rate@@IBVERBS_1.1' => 1,
                                                     'mult_to_ibv_rate@@IBVERBS_1.0' => 1,
                                                     'verbs_init_cq@@IBVERBS_PRIVATE_15' => 1,
                                                     'verbs_register_driver_15@@IBVERBS_PRIVATE_15' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '11529' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '216',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fw_ver',
                                                            'offset' => '0',
                                                            'type' => '4058'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_guid',
                                                            'offset' => '8',
                                                            'type' => '4047'
                                                          },
                                                   '10' => {
                                                             'name' => 'device_cap_flags',
                                                             'offset' => '60',
                                                             'type' => '2678'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_sge',
                                                             'offset' => '64',
                                                             'type' => '2678'
                                                           },
                                                   '12' => {
                                                             'name' => 'max_sge_rd',
                                                             'offset' => '68',
                                                             'type' => '2678'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_cq',
                                                             'offset' => '72',
                                                             'type' => '2678'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_cqe',
                                                             'offset' => '76',
                                                             'type' => '2678'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_mr',
                                                             'offset' => '80',
                                                             'type' => '2678'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_pd',
                                                             'offset' => '84',
                                                             'type' => '2678'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_qp_rd_atom',
                                                             'offset' => '88',
                                                             'type' => '2678'
                                                           },
                                                   '18' => {
                                                             'name' => 'max_ee_rd_atom',
                                                             'offset' => '92',
                                                             'type' => '2678'
                                                           },
                                                   '19' => {
                                                             'name' => 'max_res_rd_atom',
                                                             'offset' => '96',
                                                             'type' => '2678'
                                                           },
                                                   '2' => {
                                                            'name' => 'sys_image_guid',
                                                            'offset' => '16',
                                                            'type' => '4047'
                                                          },
                                                   '20' => {
                                                             'name' => 'max_qp_init_rd_atom',
                                                             'offset' => '100',
                                                             'type' => '2678'
                                                           },
                                                   '21' => {
                                                             'name' => 'max_ee_init_rd_atom',
                                                             'offset' => '104',
                                                             'type' => '2678'
                                                           },
                                                   '22' => {
                                                             'name' => 'atomic_cap',
                                                             'offset' => '108',
                                                             'type' => '2678'
                                                           },
                                                   '23' => {
                                                             'name' => 'max_ee',
                                                             'offset' => '112',
                                                             'type' => '2678'
                                                           },
                                                   '24' => {
                                                             'name' => 'max_rdd',
                                                             'offset' => '116',
                                                             'type' => '2678'
                                                           },
                                                   '25' => {
                                                             'name' => 'max_mw',
                                                             'offset' => '120',
                                                             'type' => '2678'
                                                           },
                                                   '26' => {
                                                             'name' => 'max_raw_ipv6_qp',
                                                             'offset' => '124',
                                                             'type' => '2678'
                                                           },
                                                   '27' => {
                                                             'name' => 'max_raw_ethy_qp',
                                                             'offset' => '128',
                                                             'type' => '2678'
                                                           },
                                                   '28' => {
                                                             'name' => 'max_mcast_grp',
                                                             'offset' => '132',
                                                             'type' => '2678'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_mcast_qp_attach',
                                                             'offset' => '136',
                                                             'type' => '2678'
                                                           },
                                                   '3' => {
                                                            'name' => 'max_mr_size',
                                                            'offset' => '24',
                                                            'type' => '4058'
                                                          },
                                                   '30' => {
                                                             'name' => 'max_total_mcast_qp_attach',
                                                             'offset' => '140',
                                                             'type' => '2678'
                                                           },
                                                   '31' => {
                                                             'name' => 'max_ah',
                                                             'offset' => '144',
                                                             'type' => '2678'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_fmr',
                                                             'offset' => '148',
                                                             'type' => '2678'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_map_per_fmr',
                                                             'offset' => '152',
                                                             'type' => '2678'
                                                           },
                                                   '34' => {
                                                             'name' => 'max_srq',
                                                             'offset' => '156',
                                                             'type' => '2678'
                                                           },
                                                   '35' => {
                                                             'name' => 'max_srq_wr',
                                                             'offset' => '160',
                                                             'type' => '2678'
                                                           },
                                                   '36' => {
                                                             'name' => 'max_srq_sge',
                                                             'offset' => '164',
                                                             'type' => '2678'
                                                           },
                                                   '37' => {
                                                             'name' => 'max_pkeys',
                                                             'offset' => '168',
                                                             'type' => '9397'
                                                           },
                                                   '38' => {
                                                             'name' => 'local_ca_ack_delay',
                                                             'offset' => '170',
                                                             'type' => '8630'
                                                           },
                                                   '39' => {
                                                             'name' => 'phys_port_cnt',
                                                             'offset' => '171',
                                                             'type' => '8630'
                                                           },
                                                   '4' => {
                                                            'name' => 'page_size_cap',
                                                            'offset' => '32',
                                                            'type' => '4058'
                                                          },
                                                   '40' => {
                                                             'name' => 'reserved',
                                                             'offset' => '172',
                                                             'type' => '9545'
                                                           },
                                                   '5' => {
                                                            'name' => 'vendor_id',
                                                            'offset' => '40',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'vendor_part_id',
                                                            'offset' => '44',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'hw_ver',
                                                            'offset' => '48',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_qp',
                                                            'offset' => '52',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_qp_wr',
                                                            'offset' => '56',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_device_resp',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '12044' => {
                                       'BaseType' => '4069',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '132' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '146',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_ATOMIC_NONE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_ATOMIC_HCA',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_ATOMIC_GLOB',
                                                          'value' => '2'
                                                        }
                                               },
                                     'Name' => 'enum ibv_atomic_cap',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '159' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '294',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_PORT_NOP',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_PORT_DOWN',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_PORT_INIT',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_PORT_ARMED',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_PORT_ACTIVE',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_PORT_ACTIVE_DEFER',
                                                          'value' => '5'
                                                        }
                                               },
                                     'Name' => 'enum ibv_port_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '19175' => {
                                       'BaseType' => '3047',
                                       'Name' => 'int*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '19292' => {
                                       'BaseType' => '3078',
                                       'Name' => 'char*',
                                       'Size' => '1',
                                       'Type' => 'Pointer'
                                     },
                          '1959' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '659',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_SRQT_BASIC',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_SRQT_XRC',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum ibv_srq_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '205' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '286',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_MTU_256',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_MTU_512',
                                                          'value' => '2'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_MTU_1024',
                                                          'value' => '3'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_MTU_2048',
                                                          'value' => '4'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_MTU_4096',
                                                          'value' => '5'
                                                        }
                                               },
                                     'Name' => 'enum ibv_mtu',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '20818' => {
                                       'BaseType' => '20823',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '20823' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1394',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2770'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '20889' => {
                                       'BaseType' => '20894',
                                       'Name' => 'struct ibv_get_context*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '20894' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_get_context',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20963' => {
                                       'BaseType' => '4058',
                                       'Name' => '__u64[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '20975' => {
                                       'BaseType' => '20980',
                                       'Name' => 'struct ibv_get_context_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20980' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '203',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'async_fd',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_comp_vectors',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_get_context_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21013' => {
                                       'BaseType' => '21018',
                                       'Name' => 'struct ibv_query_device*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '21018' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '208',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_device',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21087' => {
                                       'BaseType' => '21092',
                                       'Name' => 'struct ibv_query_device_ex_input const*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '21092' => {
                                       'BaseType' => '21097',
                                       'Name' => 'struct ibv_query_device_ex_input const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '21097' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '197',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_device_ex_input',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21118' => {
                                       'BaseType' => '21123',
                                       'Name' => 'struct ibv_device_attr_ex*',
                                       'Size' => '352',
                                       'Type' => 'Pointer'
                                     },
                          '21123' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '272',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'orig_attr',
                                                            'offset' => '0',
                                                            'type' => '3558'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '232',
                                                            'type' => '4080'
                                                          },
                                                   '10' => {
                                                             'name' => 'raw_packet_caps',
                                                             'offset' => '344',
                                                             'type' => '4080'
                                                           },
                                                   '2' => {
                                                            'name' => 'odp_caps',
                                                            'offset' => '240',
                                                            'type' => '21285'
                                                          },
                                                   '3' => {
                                                            'name' => 'completion_timestamp_mask',
                                                            'offset' => '264',
                                                            'type' => '4069'
                                                          },
                                                   '4' => {
                                                            'name' => 'hca_core_clock',
                                                            'offset' => '272',
                                                            'type' => '4069'
                                                          },
                                                   '5' => {
                                                            'name' => 'device_cap_flags_ex',
                                                            'offset' => '280',
                                                            'type' => '4069'
                                                          },
                                                   '6' => {
                                                            'name' => 'tso_caps',
                                                            'offset' => '288',
                                                            'type' => '21359'
                                                          },
                                                   '7' => {
                                                            'name' => 'rss_caps',
                                                            'offset' => '296',
                                                            'type' => '21392'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_wq_type_rq',
                                                            'offset' => '328',
                                                            'type' => '4080'
                                                          },
                                                   '9' => {
                                                            'name' => 'packet_pacing_caps',
                                                            'offset' => '332',
                                                            'type' => '21462'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device_attr_ex',
                                       'Size' => '352',
                                       'Type' => 'Struct'
                                     },
                          '21285' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '209',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'general_caps',
                                                            'offset' => '0',
                                                            'type' => '4069'
                                                          },
                                                   '1' => {
                                                            'name' => 'per_transport_caps',
                                                            'offset' => '8',
                                                            'type' => '21317'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_odp_caps',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21317' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '211',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rc_odp_caps',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'uc_odp_caps',
                                                            'offset' => '4',
                                                            'type' => '4080'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud_odp_caps',
                                                            'offset' => '8',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'ibv_odp_caps::anon-struct-verbs.h-211',
                                       'NameSpace' => 'ibv_odp_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '21359' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '222',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_tso',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_tso_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21392' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '251',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_rwq_indirection_tables',
                                                            'offset' => '4',
                                                            'type' => '4080'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_rwq_indirection_table_size',
                                                            'offset' => '8',
                                                            'type' => '4080'
                                                          },
                                                   '3' => {
                                                            'name' => 'rx_hash_fields_mask',
                                                            'offset' => '16',
                                                            'type' => '4069'
                                                          },
                                                   '4' => {
                                                            'name' => 'rx_hash_function',
                                                            'offset' => '24',
                                                            'type' => '4109'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rss_caps',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '21462' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '259',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_rate_limit_min',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_rate_limit_max',
                                                            'offset' => '4',
                                                            'type' => '4080'
                                                          },
                                                   '2' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '8',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_packet_pacing_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '21511' => {
                                       'BaseType' => '21516',
                                       'Name' => 'struct ibv_query_device_ex*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '21516' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '260',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_device_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '21565' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '150',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '21581'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '8',
                                                            'type' => '21630'
                                                          },
                                                   '2' => {
                                                            'name' => 'unnamed2',
                                                            'offset' => '16',
                                                            'type' => '21655'
                                                          }
                                                 },
                                       'Name' => 'struct ex_hdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21581' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '151',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          }
                                                 },
                                       'Name' => 'ex_hdr::anon-struct-kern-abi.h-151',
                                       'NameSpace' => 'ex_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21630' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '156',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '4058'
                                                          }
                                                 },
                                       'Name' => 'ex_hdr::anon-struct-kern-abi.h-156',
                                       'NameSpace' => 'ex_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21655' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '159',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'provider_in_words',
                                                            'offset' => '0',
                                                            'type' => '9397'
                                                          },
                                                   '1' => {
                                                            'name' => 'provider_out_words',
                                                            'offset' => '2',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'ex_hdr::anon-struct-kern-abi.h-159',
                                       'NameSpace' => 'ex_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21697' => {
                                       'BaseType' => '21702',
                                       'Name' => 'struct ibv_query_device_resp_ex*',
                                       'Size' => '256',
                                       'Type' => 'Pointer'
                                     },
                          '21702' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '283',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '11529'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '176',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'response_length',
                                                            'offset' => '180',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'odp_caps',
                                                            'offset' => '184',
                                                            'type' => '21843'
                                                          },
                                                   '4' => {
                                                            'name' => 'timestamp_mask',
                                                            'offset' => '208',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'hca_core_clock',
                                                            'offset' => '216',
                                                            'type' => '4058'
                                                          },
                                                   '6' => {
                                                            'name' => 'device_cap_flags_ex',
                                                            'offset' => '224',
                                                            'type' => '4058'
                                                          },
                                                   '7' => {
                                                            'name' => 'rss_caps',
                                                            'offset' => '232',
                                                            'type' => '21937'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_wq_type_rq',
                                                            'offset' => '248',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'raw_packet_caps',
                                                            'offset' => '252',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_device_resp_ex',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '21843' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '266',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'general_caps',
                                                            'offset' => '0',
                                                            'type' => '4058'
                                                          },
                                                   '1' => {
                                                            'name' => 'per_transport_caps',
                                                            'offset' => '8',
                                                            'type' => '21878'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_odp_caps_resp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21878' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '268',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rc_odp_caps',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'uc_odp_caps',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud_odp_caps',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'ibv_odp_caps_resp::anon-struct-kern-abi.h-268',
                                       'NameSpace' => 'ibv_odp_caps_resp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '21937' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '276',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_rwq_indirection_tables',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_rwq_indirection_table_size',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rss_caps_resp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21999' => {
                                       'BaseType' => '22004',
                                       'Name' => 'struct ibv_query_port*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22004' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '296',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'port_num',
                                                            'offset' => '16',
                                                            'type' => '8630'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '17',
                                                            'type' => '9545'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '24',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_port',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22412' => {
                                       'BaseType' => '22417',
                                       'Name' => 'struct ibv_alloc_pd*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '22417' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '330',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '22492' => {
                                       'BaseType' => '22497',
                                       'Name' => 'struct ibv_alloc_pd_resp*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '22497' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '338',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_pd_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '22582' => {
                                       'BaseType' => '22587',
                                       'Name' => 'struct ibv_xrcd_init_attr*',
                                       'Size' => '12',
                                       'Type' => 'Pointer'
                                     },
                          '22587' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '527',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '4',
                                                            'type' => '3047'
                                                          },
                                                   '2' => {
                                                            'name' => 'oflags',
                                                            'offset' => '8',
                                                            'type' => '3047'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_xrcd_init_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '22636' => {
                                       'BaseType' => '22641',
                                       'Name' => 'struct ibv_open_xrcd*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22641' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'fd',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'oflags',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '24',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_xrcd',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22742' => {
                                       'BaseType' => '22747',
                                       'Name' => 'struct ibv_open_xrcd_resp*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '22747' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '359',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrcd_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_xrcd_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '22832' => {
                                       'BaseType' => '22837',
                                       'Name' => 'struct ibv_reg_mr*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '22837' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '370',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'start',
                                                            'offset' => '16',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '4058'
                                                          },
                                                   '6' => {
                                                            'name' => 'hca_va',
                                                            'offset' => '32',
                                                            'type' => '4058'
                                                          },
                                                   '7' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '40',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'access_flags',
                                                            'offset' => '44',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '48',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_reg_mr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '22977' => {
                                       'BaseType' => '22982',
                                       'Name' => 'struct ibv_reg_mr_resp*',
                                       'Size' => '12',
                                       'Type' => 'Pointer'
                                     },
                          '22982' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '383',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mr_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'lkey',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_reg_mr_resp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '23031' => {
                                       'BaseType' => '23036',
                                       'Name' => 'struct ibv_rereg_mr_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23036' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '404',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rereg_mr_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '23072' => {
                                       'BaseType' => '23077',
                                       'Name' => 'struct ibv_rereg_mr*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '23077' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '389',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '10' => {
                                                             'name' => 'access_flags',
                                                             'offset' => '52',
                                                             'type' => '2678'
                                                           },
                                                   '11' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '20963'
                                                           },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'mr_handle',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'start',
                                                            'offset' => '24',
                                                            'type' => '4058'
                                                          },
                                                   '7' => {
                                                            'name' => 'length',
                                                            'offset' => '32',
                                                            'type' => '4058'
                                                          },
                                                   '8' => {
                                                            'name' => 'hca_va',
                                                            'offset' => '40',
                                                            'type' => '4058'
                                                          },
                                                   '9' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '48',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rereg_mr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '23305' => {
                                       'BaseType' => '23310',
                                       'Name' => 'struct ibv_alloc_mw*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '23310' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '416',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'mw_type',
                                                            'offset' => '20',
                                                            'type' => '8630'
                                                          },
                                                   '6' => {
                                                            'name' => 'reserved',
                                                            'offset' => '21',
                                                            'type' => '9545'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_mw',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '23423' => {
                                       'BaseType' => '23428',
                                       'Name' => 'struct ibv_alloc_mw_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23428' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '426',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_mw_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '23464' => {
                                       'BaseType' => '23469',
                                       'Name' => 'struct ibv_dealloc_mw*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '23469' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '431',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'mw_handle',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_dealloc_mw',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23544' => {
                                       'BaseType' => '23549',
                                       'Name' => 'struct ibv_create_cq*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '23549' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '450',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '16',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'cqe',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_channel',
                                                            'offset' => '32',
                                                            'type' => '23689'
                                                          },
                                                   '8' => {
                                                            'name' => 'reserved',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '40',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_cq',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '23689' => {
                                       'BaseType' => '3047',
                                       'Header' => 'int-ll64.h',
                                       'Line' => '25',
                                       'Name' => '__s32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '23700' => {
                                       'BaseType' => '23705',
                                       'Name' => 'struct ibv_create_cq_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23705' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '463',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_cq_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '23741' => {
                                       'BaseType' => '23746',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '23746' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1506',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '2696'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '16',
                                                            'type' => '5162'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '24',
                                                            'type' => '4080'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '32',
                                                            'type' => '4069'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '4080'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '44',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '23847' => {
                                       'BaseType' => '23852',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '272',
                                       'Type' => 'Pointer'
                                     },
                          '23852' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1093',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2770'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '5162'
                                                          },
                                                   '10' => {
                                                             'name' => 'status',
                                                             'offset' => '132',
                                                             'type' => '371'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '136',
                                                             'type' => '4069'
                                                           },
                                                   '12' => {
                                                             'name' => 'start_poll',
                                                             'offset' => '144',
                                                             'type' => '24229'
                                                           },
                                                   '13' => {
                                                             'name' => 'next_poll',
                                                             'offset' => '152',
                                                             'type' => '24278'
                                                           },
                                                   '14' => {
                                                             'name' => 'end_poll',
                                                             'offset' => '160',
                                                             'type' => '24294'
                                                           },
                                                   '15' => {
                                                             'name' => 'read_opcode',
                                                             'offset' => '168',
                                                             'type' => '24306'
                                                           },
                                                   '16' => {
                                                             'name' => 'read_vendor_err',
                                                             'offset' => '176',
                                                             'type' => '24322'
                                                           },
                                                   '17' => {
                                                             'name' => 'read_byte_len',
                                                             'offset' => '184',
                                                             'type' => '24322'
                                                           },
                                                   '18' => {
                                                             'name' => 'read_imm_data',
                                                             'offset' => '192',
                                                             'type' => '24338'
                                                           },
                                                   '19' => {
                                                             'name' => 'read_qp_num',
                                                             'offset' => '200',
                                                             'type' => '24322'
                                                           },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '16',
                                                            'type' => '2696'
                                                          },
                                                   '20' => {
                                                             'name' => 'read_src_qp',
                                                             'offset' => '208',
                                                             'type' => '24322'
                                                           },
                                                   '21' => {
                                                             'name' => 'read_wc_flags',
                                                             'offset' => '216',
                                                             'type' => '24278'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_slid',
                                                             'offset' => '224',
                                                             'type' => '24322'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_sl',
                                                             'offset' => '232',
                                                             'type' => '24354'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_dlid_path_bits',
                                                             'offset' => '240',
                                                             'type' => '24354'
                                                           },
                                                   '25' => {
                                                             'name' => 'read_completion_ts',
                                                             'offset' => '248',
                                                             'type' => '24370'
                                                           },
                                                   '26' => {
                                                             'name' => 'read_cvlan',
                                                             'offset' => '256',
                                                             'type' => '24386'
                                                           },
                                                   '27' => {
                                                             'name' => 'read_flow_tag',
                                                             'offset' => '264',
                                                             'type' => '24322'
                                                           },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '4080'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '28',
                                                            'type' => '3047'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '5216'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '5448'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '120',
                                                            'type' => '4080'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '124',
                                                            'type' => '4080'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '128',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_ex',
                                       'Size' => '272',
                                       'Type' => 'Struct'
                                     },
                          '2409' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1240',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum ibv_flow_attr_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '24229' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           },
                                                    '1' => {
                                                             'type' => '24250'
                                                           }
                                                  },
                                       'Return' => '3047',
                                       'Type' => 'FuncPtr'
                                     },
                          '24250' => {
                                       'BaseType' => '24255',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '24255' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1089',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_poll_cq_attr',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '24278' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '3047',
                                       'Type' => 'FuncPtr'
                                     },
                          '24294' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Type' => 'FuncPtr'
                                     },
                          '24306' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '513',
                                       'Type' => 'FuncPtr'
                                     },
                          '24322' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '4080',
                                       'Type' => 'FuncPtr'
                                     },
                          '24338' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '6127',
                                       'Type' => 'FuncPtr'
                                     },
                          '24354' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '4109',
                                       'Type' => 'FuncPtr'
                                     },
                          '24370' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '4069',
                                       'Type' => 'FuncPtr'
                                     },
                          '24386' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23847'
                                                           }
                                                  },
                                       'Return' => '4091',
                                       'Type' => 'FuncPtr'
                                     },
                          '24402' => {
                                       'BaseType' => '24407',
                                       'Name' => 'struct ibv_create_cq_ex*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '24407' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '472',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '24',
                                                            'type' => '4058'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqe',
                                                            'offset' => '32',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_channel',
                                                            'offset' => '40',
                                                            'type' => '23689'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '44',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '52',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_cq_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '245' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '555',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_MW_TYPE_1',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_MW_TYPE_2',
                                                          'value' => '2'
                                                        }
                                               },
                                     'Name' => 'enum ibv_mw_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '24521' => {
                                       'BaseType' => '24526',
                                       'Name' => 'struct ibv_create_cq_resp_ex*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '24526' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '483',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '23705'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'response_length',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_cq_resp_ex',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '25009' => {
                                       'BaseType' => '25014',
                                       'Name' => 'struct ibv_resize_cq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '25014' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '530',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'cqe',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '24',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_resize_cq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '25115' => {
                                       'BaseType' => '25120',
                                       'Name' => 'struct ibv_resize_cq_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25120' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '540',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'reserved',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '8',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_resize_cq_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '25293' => {
                                       'BaseType' => '25298',
                                       'Name' => 'struct ibv_create_srq*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '25298' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1095',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '16',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '32',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '40',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_srq',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '25438' => {
                                       'BaseType' => '25443',
                                       'Name' => 'struct ibv_create_srq_resp*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '25443' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'srqn',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_srq_resp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '25505' => {
                                       'BaseType' => '25510',
                                       'Name' => 'struct verbs_srq*',
                                       'Size' => '160',
                                       'Type' => 'Pointer'
                                     },
                          '25510' => {
                                       'Header' => 'driver.h',
                                       'Line' => '73',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq',
                                                            'offset' => '0',
                                                            'type' => '5625'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '128',
                                                            'type' => '4080'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '132',
                                                            'type' => '1959'
                                                          },
                                                   '3' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '136',
                                                            'type' => '2697'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq',
                                                            'offset' => '144',
                                                            'type' => '5030'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_num',
                                                            'offset' => '152',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct verbs_srq',
                                       'Size' => '160',
                                       'Type' => 'Struct'
                                     },
                          '25591' => {
                                       'BaseType' => '25596',
                                       'Name' => 'struct ibv_srq_init_attr_ex*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '25596' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '672',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_context',
                                                            'offset' => '0',
                                                            'type' => '2696'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '6249'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '20',
                                                            'type' => '4080'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '24',
                                                            'type' => '1959'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd',
                                                            'offset' => '32',
                                                            'type' => '4457'
                                                          },
                                                   '5' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '40',
                                                            'type' => '25697'
                                                          },
                                                   '6' => {
                                                            'name' => 'cq',
                                                            'offset' => '48',
                                                            'type' => '5030'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_srq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '25697' => {
                                       'BaseType' => '2747',
                                       'Name' => 'struct ibv_xrcd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25702' => {
                                       'BaseType' => '25707',
                                       'Name' => 'struct ibv_create_xsrq*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '25707' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1108',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '10' => {
                                                             'name' => 'reserved',
                                                             'offset' => '44',
                                                             'type' => '2678'
                                                           },
                                                   '11' => {
                                                             'name' => 'xrcd_handle',
                                                             'offset' => '48',
                                                             'type' => '2678'
                                                           },
                                                   '12' => {
                                                             'name' => 'cq_handle',
                                                             'offset' => '52',
                                                             'type' => '2678'
                                                           },
                                                   '13' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '20963'
                                                           },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '16',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '32',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '40',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_xsrq',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '25899' => {
                                       'BaseType' => '25904',
                                       'Name' => 'struct ibv_modify_srq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '25904' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '24',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '26163' => {
                                       'BaseType' => '26168',
                                       'Name' => 'struct ibv_query_srq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '26168' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '24',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2636' => {
                                      'Name' => 'unsigned long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '2643' => {
                                      'Name' => 'unsigned long long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '26442' => {
                                       'BaseType' => '26447',
                                       'Name' => 'struct verbs_qp*',
                                       'Size' => '176',
                                       'Type' => 'Pointer'
                                     },
                          '26447' => {
                                       'Header' => 'driver.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '4851'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '160',
                                                            'type' => '4080'
                                                          },
                                                   '2' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '168',
                                                            'type' => '2697'
                                                          }
                                                 },
                                       'Name' => 'struct verbs_qp',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '26492' => {
                                       'BaseType' => '26497',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '128',
                                       'Type' => 'Pointer'
                                     },
                          '26497' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '816',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '0',
                                                            'type' => '2696'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_cq',
                                                            'offset' => '8',
                                                            'type' => '5030'
                                                          },
                                                   '10' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '80',
                                                             'type' => '4080'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_tso_header',
                                                             'offset' => '84',
                                                             'type' => '4091'
                                                           },
                                                   '12' => {
                                                             'name' => 'rwq_ind_tbl',
                                                             'offset' => '88',
                                                             'type' => '26702'
                                                           },
                                                   '13' => {
                                                             'name' => 'rx_hash_conf',
                                                             'offset' => '96',
                                                             'type' => '26769'
                                                           },
                                                   '14' => {
                                                             'name' => 'source_qpn',
                                                             'offset' => '120',
                                                             'type' => '4080'
                                                           },
                                                   '2' => {
                                                            'name' => 'recv_cq',
                                                            'offset' => '16',
                                                            'type' => '5030'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq',
                                                            'offset' => '24',
                                                            'type' => '5620'
                                                          },
                                                   '4' => {
                                                            'name' => 'cap',
                                                            'offset' => '32',
                                                            'type' => '6645'
                                                          },
                                                   '5' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '52',
                                                            'type' => '325'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_sig_all',
                                                            'offset' => '56',
                                                            'type' => '3047'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '60',
                                                            'type' => '4080'
                                                          },
                                                   '8' => {
                                                            'name' => 'pd',
                                                            'offset' => '64',
                                                            'type' => '4457'
                                                          },
                                                   '9' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '72',
                                                            'type' => '25697'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_init_attr_ex',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '267' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '876',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_QPS_RESET',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_QPS_INIT',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_QPS_RTR',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_QPS_RTS',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_QPS_SQD',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_QPS_SQE',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_QPS_ERR',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_QPS_UNKNOWN',
                                                          'value' => '7'
                                                        }
                                               },
                                     'Name' => 'enum ibv_qp_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '26702' => {
                                       'BaseType' => '26707',
                                       'Name' => 'struct ibv_rwq_ind_table*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '26707' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '742',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2770'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '3047'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '3047'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '26769' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '807',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rx_hash_function',
                                                            'offset' => '0',
                                                            'type' => '4109'
                                                          },
                                                   '1' => {
                                                            'name' => 'rx_hash_key_len',
                                                            'offset' => '1',
                                                            'type' => '4109'
                                                          },
                                                   '2' => {
                                                            'name' => 'rx_hash_key',
                                                            'offset' => '8',
                                                            'type' => '8428'
                                                          },
                                                   '3' => {
                                                            'name' => 'rx_hash_fields_mask',
                                                            'offset' => '16',
                                                            'type' => '4069'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rx_hash_conf',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2678' => {
                                      'BaseType' => '2689',
                                      'Header' => 'int-ll64.h',
                                      'Line' => '26',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '26831' => {
                                       'BaseType' => '26836',
                                       'Name' => 'struct ibv_create_qp_ex*',
                                       'Size' => '88',
                                       'Type' => 'Pointer'
                                     },
                          '26836' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '676',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'base',
                                                            'offset' => '24',
                                                            'type' => '8438'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '76',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '80',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'source_qpn',
                                                            'offset' => '84',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp_ex',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '2689' => {
                                      'Name' => 'unsigned int',
                                      'Size' => '4',
                                      'Type' => 'Intrinsic'
                                    },
                          '26924' => {
                                       'BaseType' => '26929',
                                       'Name' => 'struct ibv_create_qp_resp_ex*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '26929' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '685',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '26978'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'response_length',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp_resp_ex',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '2696' => {
                                      'BaseType' => '1',
                                      'Name' => 'void*',
                                      'Type' => 'Pointer'
                                    },
                          '2697' => {
                                      'BaseType' => '2702',
                                      'Name' => 'struct verbs_xrcd*',
                                      'Size' => '16',
                                      'Type' => 'Pointer'
                                    },
                          '26978' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '661',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'qpn',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp_resp',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '2702' => {
                                      'Header' => 'driver.h',
                                      'Line' => '59',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'xrcd',
                                                           'offset' => '0',
                                                           'type' => '2747'
                                                         },
                                                  '1' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '8',
                                                           'type' => '4080'
                                                         },
                                                  '2' => {
                                                           'name' => 'handle',
                                                           'offset' => '12',
                                                           'type' => '4080'
                                                         }
                                                },
                                      'Name' => 'struct verbs_xrcd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '27092' => {
                                       'BaseType' => '26978',
                                       'Name' => 'struct ibv_create_qp_resp*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '27097' => {
                                       'BaseType' => '27102',
                                       'Name' => 'struct ibv_create_qp*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '27102' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '634',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '10' => {
                                                             'name' => 'max_recv_wr',
                                                             'offset' => '44',
                                                             'type' => '2678'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_send_sge',
                                                             'offset' => '48',
                                                             'type' => '2678'
                                                           },
                                                   '12' => {
                                                             'name' => 'max_recv_sge',
                                                             'offset' => '52',
                                                             'type' => '2678'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '56',
                                                             'type' => '2678'
                                                           },
                                                   '14' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '60',
                                                             'type' => '8630'
                                                           },
                                                   '15' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '61',
                                                             'type' => '8630'
                                                           },
                                                   '16' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '62',
                                                             'type' => '8630'
                                                           },
                                                   '17' => {
                                                             'name' => 'reserved',
                                                             'offset' => '63',
                                                             'type' => '8630'
                                                           },
                                                   '18' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '64',
                                                             'type' => '20963'
                                                           },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '16',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '32',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '40',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '27359' => {
                                       'BaseType' => '27364',
                                       'Name' => 'struct ibv_qp_open_attr*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '27364' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '843',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '4',
                                                            'type' => '4080'
                                                          },
                                                   '2' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '8',
                                                            'type' => '25697'
                                                          },
                                                   '3' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '16',
                                                            'type' => '2696'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '325'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_open_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '27439' => {
                                       'BaseType' => '27444',
                                       'Name' => 'struct ibv_open_qp*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '27444' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '647',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '16',
                                                            'type' => '4058'
                                                          },
                                                   '5' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'qpn',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '32',
                                                            'type' => '8630'
                                                          },
                                                   '8' => {
                                                            'name' => 'reserved',
                                                            'offset' => '33',
                                                            'type' => '9545'
                                                          },
                                                   '9' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '40',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_qp',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '2747' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '533',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2770'
                                                         }
                                                },
                                      'Name' => 'struct ibv_xrcd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '27584' => {
                                       'BaseType' => '27589',
                                       'Name' => 'struct ibv_query_qp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '27589' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '706',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'response',
                                                            'offset' => '8',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '24',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_qp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2770' => {
                                      'BaseType' => '2775',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '328',
                                      'Type' => 'Pointer'
                                    },
                          '2775' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1486',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '2882'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '3105'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '264',
                                                           'type' => '3047'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '268',
                                                           'type' => '3047'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '272',
                                                           'type' => '3047'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '280',
                                                           'type' => '5216'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '320',
                                                           'type' => '2696'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '28103' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '691',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '9545'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '10' => {
                                                             'name' => 'is_global',
                                                             'offset' => '30',
                                                             'type' => '8630'
                                                           },
                                                   '11' => {
                                                             'name' => 'port_num',
                                                             'offset' => '31',
                                                             'type' => '8630'
                                                           },
                                                   '2' => {
                                                            'name' => 'dlid',
                                                            'offset' => '20',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '22',
                                                            'type' => '9397'
                                                          },
                                                   '4' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '24',
                                                            'type' => '8630'
                                                          },
                                                   '5' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '25',
                                                            'type' => '8630'
                                                          },
                                                   '6' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '26',
                                                            'type' => '8630'
                                                          },
                                                   '7' => {
                                                            'name' => 'sl',
                                                            'offset' => '27',
                                                            'type' => '8630'
                                                          },
                                                   '8' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '28',
                                                            'type' => '8630'
                                                          },
                                                   '9' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '29',
                                                            'type' => '8630'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_dest',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '28281' => {
                                       'BaseType' => '28286',
                                       'Name' => 'struct ibv_modify_qp*',
                                       'Size' => '120',
                                       'Type' => 'Pointer'
                                     },
                          '28286' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '779',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '9397'
                                                          },
                                                   '3' => {
                                                            'name' => 'base',
                                                            'offset' => '8',
                                                            'type' => '28361'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '120',
                                                            'type' => '20963'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '28361' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '750',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dest',
                                                            'offset' => '0',
                                                            'type' => '28103'
                                                          },
                                                   '1' => {
                                                            'name' => 'alt_dest',
                                                            'offset' => '32',
                                                            'type' => '28103'
                                                          },
                                                   '10' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '94',
                                                             'type' => '9397'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '96',
                                                             'type' => '8630'
                                                           },
                                                   '12' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '97',
                                                             'type' => '8630'
                                                           },
                                                   '13' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '98',
                                                             'type' => '8630'
                                                           },
                                                   '14' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '99',
                                                             'type' => '8630'
                                                           },
                                                   '15' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '100',
                                                             'type' => '8630'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '101',
                                                             'type' => '8630'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '102',
                                                             'type' => '8630'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '103',
                                                             'type' => '8630'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '104',
                                                             'type' => '8630'
                                                           },
                                                   '2' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '64',
                                                            'type' => '2678'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '105',
                                                             'type' => '8630'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '106',
                                                             'type' => '8630'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '107',
                                                             'type' => '8630'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '108',
                                                             'type' => '8630'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '109',
                                                             'type' => '8630'
                                                           },
                                                   '25' => {
                                                             'name' => 'reserved',
                                                             'offset' => '110',
                                                             'type' => '9545'
                                                           },
                                                   '3' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '68',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '72',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '76',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '80',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '84',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '88',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '92',
                                                            'type' => '9397'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp_common',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '28714' => {
                                       'BaseType' => '28719',
                                       'Name' => 'struct ibv_modify_qp_ex*',
                                       'Size' => '144',
                                       'Type' => 'Pointer'
                                     },
                          '28719' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '787',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'base',
                                                            'offset' => '24',
                                                            'type' => '28361'
                                                          },
                                                   '2' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '136',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '140',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp_ex',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '28781' => {
                                       'BaseType' => '28786',
                                       'Name' => 'struct ibv_modify_qp_resp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '28786' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '794',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp_resp_ex',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '2882' => {
                                      'BaseType' => '2887',
                                      'Name' => 'struct ibv_device*',
                                      'Size' => '664',
                                      'Type' => 'Pointer'
                                    },
                          '2887' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1414',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_ops',
                                                           'offset' => '0',
                                                           'type' => '2990'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_type',
                                                           'offset' => '16',
                                                           'type' => '42'
                                                         },
                                                  '2' => {
                                                           'name' => 'transport_type',
                                                           'offset' => '20',
                                                           'type' => '93'
                                                         },
                                                  '3' => {
                                                           'name' => 'name',
                                                           'offset' => '24',
                                                           'type' => '3066'
                                                         },
                                                  '4' => {
                                                           'name' => 'dev_name',
                                                           'offset' => '88',
                                                           'type' => '3066'
                                                         },
                                                  '5' => {
                                                           'name' => 'dev_path',
                                                           'offset' => '152',
                                                           'type' => '3066'
                                                         },
                                                  '6' => {
                                                           'name' => 'ibdev_path',
                                                           'offset' => '408',
                                                           'type' => '3066'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device',
                                      'Size' => '664',
                                      'Type' => 'Struct'
                                    },
                          '29311' => {
                                       'BaseType' => '29316',
                                       'Name' => 'struct ibv_create_ah_resp*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '29316' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1044',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'handle',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_ah_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '29453' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '569',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'grh',
                                                            'offset' => '0',
                                                            'type' => '29567'
                                                          },
                                                   '1' => {
                                                            'name' => 'dlid',
                                                            'offset' => '24',
                                                            'type' => '9397'
                                                          },
                                                   '2' => {
                                                            'name' => 'sl',
                                                            'offset' => '26',
                                                            'type' => '8630'
                                                          },
                                                   '3' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '27',
                                                            'type' => '8630'
                                                          },
                                                   '4' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '28',
                                                            'type' => '8630'
                                                          },
                                                   '5' => {
                                                            'name' => 'is_global',
                                                            'offset' => '29',
                                                            'type' => '8630'
                                                          },
                                                   '6' => {
                                                            'name' => 'port_num',
                                                            'offset' => '30',
                                                            'type' => '8630'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '31',
                                                            'type' => '8630'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_kern_ah_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '29567' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '560',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '9545'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '20',
                                                            'type' => '8630'
                                                          },
                                                   '3' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '21',
                                                            'type' => '8630'
                                                          },
                                                   '4' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '22',
                                                            'type' => '8630'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '23',
                                                            'type' => '8630'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_kern_global_route',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2990' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1404',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_dummy1',
                                                           'offset' => '0',
                                                           'type' => '3026'
                                                         },
                                                  '1' => {
                                                           'name' => '_dummy2',
                                                           'offset' => '8',
                                                           'type' => '3054'
                                                         }
                                                },
                                      'Name' => 'struct _ibv_device_ops',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '30056' => {
                                       'BaseType' => '30061',
                                       'Name' => 'struct ibv_flow_attr*',
                                       'Size' => '20',
                                       'Type' => 'Pointer'
                                     },
                          '30061' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1380',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '4',
                                                            'type' => '2409'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '4091'
                                                          },
                                                   '3' => {
                                                            'name' => 'priority',
                                                            'offset' => '10',
                                                            'type' => '4091'
                                                          },
                                                   '4' => {
                                                            'name' => 'num_of_specs',
                                                            'offset' => '12',
                                                            'type' => '4109'
                                                          },
                                                   '5' => {
                                                            'name' => 'port',
                                                            'offset' => '13',
                                                            'type' => '4109'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_attr',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '3026' => {
                                      'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2882'
                                                          },
                                                   '1' => {
                                                            'type' => '3047'
                                                          }
                                                 },
                                      'Return' => '2770',
                                      'Type' => 'FuncPtr'
                                    },
                          '30415' => {
                                       'BaseType' => '30420',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '30420' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '699',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wq_context',
                                                            'offset' => '0',
                                                            'type' => '2696'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '8',
                                                            'type' => '723'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '12',
                                                            'type' => '4080'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd',
                                                            'offset' => '24',
                                                            'type' => '4457'
                                                          },
                                                   '5' => {
                                                            'name' => 'cq',
                                                            'offset' => '32',
                                                            'type' => '5030'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '4080'
                                                          },
                                                   '7' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '44',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq_init_attr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '3047' => {
                                      'Name' => 'int',
                                      'Size' => '4',
                                      'Type' => 'Intrinsic'
                                    },
                          '30534' => {
                                       'BaseType' => '30539',
                                       'Name' => 'struct ibv_create_wq*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '30539' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1271',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '32',
                                                            'type' => '4058'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '40',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '44',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '48',
                                                            'type' => '2678'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '52',
                                                            'type' => '2678'
                                                          },
                                                   '8' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '56',
                                                            'type' => '2678'
                                                          },
                                                   '9' => {
                                                            'name' => 'reserved',
                                                            'offset' => '60',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_wq',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '3054' => {
                                      'Name' => 'void(*)(struct ibv_context*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2770'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Type' => 'FuncPtr'
                                    },
                          '3066' => {
                                      'BaseType' => '3078',
                                      'Name' => 'char[]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '30679' => {
                                       'BaseType' => '30684',
                                       'Name' => 'struct ibv_create_wq_resp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '30684' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1284',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '16',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'wqn',
                                                            'offset' => '20',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_wq_resp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '30772' => {
                                       'BaseType' => '30777',
                                       'Name' => 'struct ibv_wq_attr*',
                                       'Size' => '20',
                                       'Type' => 'Pointer'
                                     },
                          '30777' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '724',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '4',
                                                            'type' => '689'
                                                          },
                                                   '2' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '8',
                                                            'type' => '689'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '4080'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq_attr',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '3078' => {
                                      'Name' => 'char',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '30852' => {
                                       'BaseType' => '30857',
                                       'Name' => 'struct ibv_modify_wq*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '30857' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1306',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '32',
                                                            'type' => '2678'
                                                          },
                                                   '4' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '36',
                                                            'type' => '2678'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '40',
                                                            'type' => '2678'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '44',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_wq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '3105' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1428',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'query_device',
                                                           'offset' => '0',
                                                           'type' => '3532'
                                                         },
                                                  '1' => {
                                                           'name' => 'query_port',
                                                           'offset' => '8',
                                                           'type' => '4127'
                                                         },
                                                  '10' => {
                                                            'name' => 'create_cq',
                                                            'offset' => '80',
                                                            'type' => '5858'
                                                          },
                                                  '11' => {
                                                            'name' => 'poll_cq',
                                                            'offset' => '88',
                                                            'type' => '5889'
                                                          },
                                                  '12' => {
                                                            'name' => 'req_notify_cq',
                                                            'offset' => '96',
                                                            'type' => '6138'
                                                          },
                                                  '13' => {
                                                            'name' => 'cq_event',
                                                            'offset' => '104',
                                                            'type' => '6159'
                                                          },
                                                  '14' => {
                                                            'name' => 'resize_cq',
                                                            'offset' => '112',
                                                            'type' => '6138'
                                                          },
                                                  '15' => {
                                                            'name' => 'destroy_cq',
                                                            'offset' => '120',
                                                            'type' => '6171'
                                                          },
                                                  '16' => {
                                                            'name' => 'create_srq',
                                                            'offset' => '128',
                                                            'type' => '6187'
                                                          },
                                                  '17' => {
                                                            'name' => 'modify_srq',
                                                            'offset' => '136',
                                                            'type' => '6298'
                                                          },
                                                  '18' => {
                                                            'name' => 'query_srq',
                                                            'offset' => '144',
                                                            'type' => '6329'
                                                          },
                                                  '19' => {
                                                            'name' => 'destroy_srq',
                                                            'offset' => '152',
                                                            'type' => '6350'
                                                          },
                                                  '2' => {
                                                           'name' => 'alloc_pd',
                                                           'offset' => '16',
                                                           'type' => '4441'
                                                         },
                                                  '20' => {
                                                            'name' => 'post_srq_recv',
                                                            'offset' => '160',
                                                            'type' => '6366'
                                                          },
                                                  '21' => {
                                                            'name' => 'create_qp',
                                                            'offset' => '168',
                                                            'type' => '6518'
                                                          },
                                                  '22' => {
                                                            'name' => 'query_qp',
                                                            'offset' => '176',
                                                            'type' => '6720'
                                                          },
                                                  '23' => {
                                                            'name' => 'modify_qp',
                                                            'offset' => '184',
                                                            'type' => '7354'
                                                          },
                                                  '24' => {
                                                            'name' => 'destroy_qp',
                                                            'offset' => '192',
                                                            'type' => '7380'
                                                          },
                                                  '25' => {
                                                            'name' => 'post_send',
                                                            'offset' => '200',
                                                            'type' => '7396'
                                                          },
                                                  '26' => {
                                                            'name' => 'post_recv',
                                                            'offset' => '208',
                                                            'type' => '7990'
                                                          },
                                                  '27' => {
                                                            'name' => 'create_ah',
                                                            'offset' => '216',
                                                            'type' => '8016'
                                                          },
                                                  '28' => {
                                                            'name' => 'destroy_ah',
                                                            'offset' => '224',
                                                            'type' => '8042'
                                                          },
                                                  '29' => {
                                                            'name' => 'attach_mcast',
                                                            'offset' => '232',
                                                            'type' => '8058'
                                                          },
                                                  '3' => {
                                                           'name' => 'dealloc_pd',
                                                           'offset' => '24',
                                                           'type' => '4498'
                                                         },
                                                  '30' => {
                                                            'name' => 'detach_mcast',
                                                            'offset' => '240',
                                                            'type' => '8058'
                                                          },
                                                  '31' => {
                                                            'name' => 'async_event',
                                                            'offset' => '248',
                                                            'type' => '8094'
                                                          },
                                                  '4' => {
                                                           'name' => 'reg_mr',
                                                           'offset' => '32',
                                                           'type' => '4514'
                                                         },
                                                  '5' => {
                                                           'name' => 'rereg_mr',
                                                           'offset' => '40',
                                                           'type' => '4662'
                                                         },
                                                  '6' => {
                                                           'name' => 'dereg_mr',
                                                           'offset' => '48',
                                                           'type' => '4703'
                                                         },
                                                  '7' => {
                                                           'name' => 'alloc_mw',
                                                           'offset' => '56',
                                                           'type' => '4719'
                                                         },
                                                  '8' => {
                                                           'name' => 'bind_mw',
                                                           'offset' => '64',
                                                           'type' => '4820'
                                                         },
                                                  '9' => {
                                                           'name' => 'dealloc_mw',
                                                           'offset' => '72',
                                                           'type' => '5842'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context_ops',
                                      'Size' => '256',
                                      'Type' => 'Struct'
                                    },
                          '31069' => {
                                       'BaseType' => '31074',
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '31074' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '756',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_ind_tbl_size',
                                                            'offset' => '0',
                                                            'type' => '4080'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl',
                                                            'offset' => '8',
                                                            'type' => '31123'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '31123' => {
                                       'BaseType' => '8218',
                                       'Name' => 'struct ibv_wq**',
                                       'Size' => '152',
                                       'Type' => 'Pointer'
                                     },
                          '31128' => {
                                       'BaseType' => '31133',
                                       'Name' => 'struct ibv_create_rwq_ind_table*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '31133' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1316',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '21565'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'log_ind_tbl_size',
                                                            'offset' => '28',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_rwq_ind_table',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '31182' => {
                                       'BaseType' => '31187',
                                       'Name' => 'struct ibv_create_rwq_ind_table_resp*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '31187' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '1326',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2678'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2678'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '2678'
                                                          },
                                                   '3' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '2678'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_rwq_ind_table_resp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '32193' => {
                                       'BaseType' => '32198',
                                       'Name' => 'struct ibv_cq_1_0*',
                                       'Size' => '128',
                                       'Type' => 'Pointer'
                                     },
                          '32198' => {
                                       'Line' => '137',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '32315'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '2696'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '4080'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe',
                                                            'offset' => '20',
                                                            'type' => '3047'
                                                          },
                                                   '4' => {
                                                            'name' => 'mutex',
                                                            'offset' => '24',
                                                            'type' => '5216'
                                                          },
                                                   '5' => {
                                                            'name' => 'cond',
                                                            'offset' => '64',
                                                            'type' => '5448'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '112',
                                                            'type' => '4080'
                                                          },
                                                   '7' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '116',
                                                            'type' => '4080'
                                                          },
                                                   '8' => {
                                                            'name' => 'real_cq',
                                                            'offset' => '120',
                                                            'type' => '5030'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_1_0',
                                       'Size' => '128',
                                       'Source' => 'compat-1_0.c',
                                       'Type' => 'Struct'
                                     },
                          '32315' => {
                                       'BaseType' => '32320',
                                       'Name' => 'struct ibv_context_1_0*',
                                       'Size' => '248',
                                       'Type' => 'Pointer'
                                     },
                          '32320' => {
                                       'Line' => '218',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'device',
                                                            'offset' => '0',
                                                            'type' => '32401'
                                                          },
                                                   '1' => {
                                                            'name' => 'ops',
                                                            'offset' => '8',
                                                            'type' => '38153'
                                                          },
                                                   '2' => {
                                                            'name' => 'cmd_fd',
                                                            'offset' => '224',
                                                            'type' => '3047'
                                                          },
                                                   '3' => {
                                                            'name' => 'async_fd',
                                                            'offset' => '228',
                                                            'type' => '3047'
                                                          },
                                                   '4' => {
                                                            'name' => 'num_comp_vectors',
                                                            'offset' => '232',
                                                            'type' => '3047'
                                                          },
                                                   '5' => {
                                                            'name' => 'real_context',
                                                            'offset' => '240',
                                                            'type' => '2770'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_1_0',
                                       'Size' => '248',
                                       'Source' => 'compat-1_0.c',
                                       'Type' => 'Struct'
                                     },
                          '32401' => {
                                       'BaseType' => '32406',
                                       'Name' => 'struct ibv_device_1_0*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '32406' => {
                                       'Line' => '159',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'obsolete_sysfs_dev',
                                                            'offset' => '0',
                                                            'type' => '2696'
                                                          },
                                                   '1' => {
                                                            'name' => 'obsolete_sysfs_ibdev',
                                                            'offset' => '8',
                                                            'type' => '2696'
                                                          },
                                                   '2' => {
                                                            'name' => 'real_device',
                                                            'offset' => '16',
