$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.12',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'Compiler' => 'clang version 7.0.0 (tags/RELEASE_700/final)',
          'Headers' => {
                         'bitmap.h' => 1,
                         'cmd_ioctl.h' => 1,
                         'driver.h' => 1,
                         'ib_user_ioctl_verbs.h' => 1,
                         'ib_user_sa.h' => 1,
                         'ib_user_verbs.h' => 1,
                         'ibverbs.h' => 1,
                         'int-ll64.h' => 1,
                         'kern-abi.h' => 1,
                         'list.h' => 1,
                         'pthreadtypes.h' => 1,
                         'rdma_user_ioctl_cmds.h' => 1,
                         'sa.h' => 1,
                         'stdatomic.h' => 1,
                         'stddef.h' => 1,
                         'stdint.h' => 1,
                         'time.h' => 1,
                         'types.h' => 1,
                         'verbs.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libibverbs.so.1.7.25.0',
          'LibraryVersion' => 'ibverbs',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libnl-3.so.200' => 1,
                        'libnl-route-3.so.200' => 1,
                        'libpthread.so.0' => 1

                                                       'ibv_query_gid@IBVERBS_1.0' => 1,
                                                       'ibv_query_gid_type@@IBVERBS_PRIVATE_25' => 1,
                                                       'ibv_query_pkey@@IBVERBS_1.1' => 1,
                                                       'ibv_query_pkey@IBVERBS_1.0' => 1,
                                                       'ibv_query_port@@IBVERBS_1.1' => 1,
                                                       'ibv_query_port@IBVERBS_1.0' => 1,
                                                       'ibv_query_qp@@IBVERBS_1.1' => 1,
                                                       'ibv_query_qp@IBVERBS_1.0' => 1,
                                                       'ibv_query_srq@@IBVERBS_1.1' => 1,
                                                       'ibv_query_srq@IBVERBS_1.0' => 1,
                                                       'ibv_rate_to_mbps@@IBVERBS_1.1' => 1,
                                                       'ibv_rate_to_mult@@IBVERBS_1.0' => 1,
                                                       'ibv_read_ibdev_sysfs_file@@IBVERBS_PRIVATE_25' => 1,
                                                       'ibv_read_sysfs_file@@IBVERBS_1.0' => 1,
                                                       'ibv_reg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_reg_mr@IBVERBS_1.0' => 1,
                                                       'ibv_reg_mr_iova@@IBVERBS_1.7' => 1,
                                                       'ibv_register_driver@IBVERBS_1.1' => 1,
                                                       'ibv_rereg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@IBVERBS_1.0' => 1,
                                                       'ibv_resolve_eth_l2_from_gid@@IBVERBS_1.1' => 1,
                                                       'ibv_wc_status_str@@IBVERBS_1.1' => 1,
                                                       'mbps_to_ibv_rate@@IBVERBS_1.1' => 1,
                                                       'mult_to_ibv_rate@@IBVERBS_1.0' => 1,
                                                       'verbs_allow_disassociate_destroy@@IBVERBS_PRIVATE_25' => -1,
                                                       'verbs_init_cq@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_open_device@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_register_driver_25@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_set_ops@@IBVERBS_PRIVATE_25' => 1,
                                                       'verbs_uninit_context@@IBVERBS_PRIVATE_25' => 1
                                                     }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10007' => {
                                       'BaseType' => '10012',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '128',
                                       'Type' => 'Pointer'
                                     },
                          '10012' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1083',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '9353'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10007'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '9922'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '125'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '28',
                                                            'type' => '603'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '32',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '36',
                                                            'type' => '10108'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '40',
                                                            'type' => '10153'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '72',
                                                            'type' => '10346'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '80',
                                                            'type' => '10393'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '10108' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1093',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '6479'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '8382'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1093',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10153' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1097',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '10171'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '10216'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '10287'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1097',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '10171' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1098',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '9353'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '8382'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1098',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10216' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1102',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '9353'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '9353'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '16',
                                                            'type' => '9353'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '24',
                                                            'type' => '8382'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1102',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10287' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1108',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '10516'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '8382'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '12',
                                                            'type' => '8382'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1108',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10346' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1114',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '10364'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1114',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10364' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1115',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '8382'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1115',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10393' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1119',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '10411'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '10469'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1119',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10411' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '8261'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '8382'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '9364'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1120',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10469' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '6661'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '9797'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '10',
                                                            'type' => '9797'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1125',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10516' => {
                                       'BaseType' => '10521',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '10521' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1593',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '7435'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '8341'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '8382'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '105629' => {
                                        'BaseType' => '23675',
                                        'Name' => 'struct verbs_flow_action*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '10570' => {
                                       'BaseType' => '10007',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '128',
                                       'Type' => 'Pointer'
                                     },
                          '10575' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '8419'
                                                           },
                                                    '1' => {
                                                             'type' => '9855'
                                                           },
                                                    '2' => {
                                                             'type' => '9976'
                                                           }
                                                  },
                                       'Return' => '125',
                                       'Type' => 'FuncPtr'
                                     },
                          '10601' => {
                                       'BaseType' => '7736',
                                       'Name' => 'char*',
                                       'Size' => '1',
                                       'Type' => 'Pointer'
                                     },
                          '10606' => {
                                       'BaseType' => '7412',
                                       'Name' => 'struct ibv_xrcd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10616' => {
                                       'BaseType' => '10621',
                                       'Name' => 'struct ibv_create_xsrq*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '10621' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '10649'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_xsrq',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10649' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '10661'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '10815'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_xsrq::anon-union-kern-abi.h-184',
                                       'NameSpace' => 'ibv_create_xsrq',
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10661' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '10' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '48',
                                                             'type' => '2721'
                                                           },
                                                   '2' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_num_tags',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'xrcd_handle',
                                                            'offset' => '40',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '44',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-184',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10815' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1170',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '10' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '48',
                                                             'type' => '2721'
                                                           },
                                                   '2' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_num_tags',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'xrcd_handle',
                                                            'offset' => '40',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '44',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_xsrq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11018' => {
                                       'BaseType' => '11023',
                                       'Name' => 'struct ibv_modify_srq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '1102' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '1605',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum ibv_flow_attr_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '11023' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '11051'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11051' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '11063'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '11143'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_srq::anon-union-kern-abi.h-195',
                                       'NameSpace' => 'ibv_modify_srq',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '11063' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-195',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11143' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1192',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_modify_srq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11245' => {
                                       'BaseType' => '11250',
                                       'Name' => 'struct ibv_query_srq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '11250' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '11278'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11278' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '11290'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '11359'
                                                          }
                                                 },
                                       'Name' => 'ibv_query_srq::anon-union-kern-abi.h-205',
                                       'NameSpace' => 'ibv_query_srq',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '11290' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-205',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11359' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1200',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_query_srq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1140' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '745',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_SRQT_BASIC',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_SRQT_XRC',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_SRQT_TM',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_srq_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1172' => {
                                      'BaseType' => '201',
                                      'Header' => 'driver.h',
                                      'Line' => '89',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MR_TYPE_MR',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MR_TYPE_NULL_MR',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mr_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '11773' => {
                                       'BaseType' => '11778',
                                       'Name' => 'struct ibv_create_qp_ex*',
                                       'Size' => '88',
                                       'Type' => 'Pointer'
                                     },
                          '11778' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '213',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3693'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '11806'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp_ex',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11806' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '213',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '11818'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '12054'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_qp_ex::anon-union-kern-abi.h-213',
                                       'NameSpace' => 'ibv_create_qp_ex',
                                       'Size' => '64',
                                       'Type' => 'Union'
                                     },
                          '11818' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '213',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '10' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '44',
                                                             'type' => '3549'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '45',
                                                             'type' => '3549'
                                                           },
                                                   '12' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '46',
                                                             'type' => '3549'
                                                           },
                                                   '13' => {
                                                             'name' => 'reserved',
                                                             'offset' => '47',
                                                             'type' => '3549'
                                                           },
                                                   '14' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '48',
                                                             'type' => '2674'
                                                           },
                                                   '15' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '52',
                                                             'type' => '2674'
                                                           },
                                                   '16' => {
                                                             'name' => 'rwq_ind_tbl_handle',
                                                             'offset' => '56',
                                                             'type' => '2674'
                                                           },
                                                   '17' => {
                                                             'name' => 'source_qpn',
                                                             'offset' => '60',
                                                             'type' => '2674'
                                                           },
                                                   '2' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '40',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-213',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1197' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '1007',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MIG_MIGRATED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MIG_REARM',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_MIG_ARMED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mig_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '12054' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '602',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '10' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '44',
                                                             'type' => '3549'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '45',
                                                             'type' => '3549'
                                                           },
                                                   '12' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '46',
                                                             'type' => '3549'
                                                           },
                                                   '13' => {
                                                             'name' => 'reserved',
                                                             'offset' => '47',
                                                             'type' => '3549'
                                                           },
                                                   '14' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '48',
                                                             'type' => '2674'
                                                           },
                                                   '15' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '52',
                                                             'type' => '2674'
                                                           },
                                                   '16' => {
                                                             'name' => 'rwq_ind_tbl_handle',
                                                             'offset' => '56',
                                                             'type' => '2674'
                                                           },
                                                   '17' => {
                                                             'name' => 'source_qpn',
                                                             'offset' => '60',
                                                             'type' => '2674'
                                                           },
                                                   '2' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '40',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_qp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1229' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '131',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '12325' => {
                                       'BaseType' => '12330',
                                       'Name' => 'struct ib_uverbs_ex_create_qp_resp*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '12330' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '12379'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'response_length',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_qp_resp',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '12379' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '634',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'qpn',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '4555'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_qp_resp',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '125' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12532' => {
                                       'BaseType' => '12537',
                                       'Name' => 'struct ibv_create_qp*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '12537' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '12565'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12565' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '12577'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '12791'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_qp::anon-union-kern-abi.h-182',
                                       'NameSpace' => 'ibv_create_qp',
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '12577' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '10' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '48',
                                                             'type' => '2674'
                                                           },
                                                   '11' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '52',
                                                             'type' => '3549'
                                                           },
                                                   '12' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '53',
                                                             'type' => '3549'
                                                           },
                                                   '13' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '54',
                                                             'type' => '3549'
                                                           },
                                                   '14' => {
                                                             'name' => 'reserved',
                                                             'offset' => '55',
                                                             'type' => '3549'
                                                           },
                                                   '15' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '2721'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '40',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '44',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-182',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '12791' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '561',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '10' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '48',
                                                             'type' => '2674'
                                                           },
                                                   '11' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '52',
                                                             'type' => '3549'
                                                           },
                                                   '12' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '53',
                                                             'type' => '3549'
                                                           },
                                                   '13' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '54',
                                                             'type' => '3549'
                                                           },
                                                   '14' => {
                                                             'name' => 'reserved',
                                                             'offset' => '55',
                                                             'type' => '3549'
                                                           },
                                                   '15' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '2721'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '40',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '44',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_qp',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '13038' => {
                                       'BaseType' => '12379',
                                       'Name' => 'struct ib_uverbs_create_qp_resp*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '132' => {
                                     'BaseType' => '125',
                                     'Header' => 'verbs.h',
                                     'Line' => '89',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                          'value' => '-1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_TRANSPORT_IB',
                                                          'value' => '0'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_TRANSPORT_IWARP',
                                                          'value' => '1'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC',
                                                          'value' => '2'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum ibv_transport_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '13216' => {
                                       'BaseType' => '13221',
                                       'Name' => 'struct ibv_open_qp*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '13221' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '13249'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_qp',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '13249' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '13261'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '13379'
                                                          }
                                                 },
                                       'Name' => 'ibv_open_qp::anon-union-kern-abi.h-196',
                                       'NameSpace' => 'ibv_open_qp',
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '13261' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'qpn',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '3549'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '25',
                                                            'type' => '3567'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-196',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '13379' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '623',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'qpn',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '3549'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '25',
                                                            'type' => '3567'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_open_qp',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '13530' => {
                                       'BaseType' => '13535',
                                       'Name' => 'struct ibv_query_qp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '13535' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '13563'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_qp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13563' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '13575'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '13644'
                                                          }
                                                 },
                                       'Name' => 'ibv_query_qp::anon-union-kern-abi.h-204',
                                       'NameSpace' => 'ibv_query_qp',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '13575' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-204',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13644' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '671',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2703'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2721'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_query_qp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14153' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '656',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '3567'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '10' => {
                                                             'name' => 'is_global',
                                                             'offset' => '30',
                                                             'type' => '3549'
                                                           },
                                                   '11' => {
                                                             'name' => 'port_num',
                                                             'offset' => '31',
                                                             'type' => '3549'
                                                           },
                                                   '2' => {
                                                            'name' => 'dlid',
                                                            'offset' => '20',
                                                            'type' => '2685'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '22',
                                                            'type' => '2685'
                                                          },
                                                   '4' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '24',
                                                            'type' => '3549'
                                                          },
                                                   '5' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '25',
                                                            'type' => '3549'
                                                          },
                                                   '6' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '26',
                                                            'type' => '3549'
                                                          },
                                                   '7' => {
                                                            'name' => 'sl',
                                                            'offset' => '27',
                                                            'type' => '3549'
                                                          },
                                                   '8' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '28',
                                                            'type' => '3549'
                                                          },
                                                   '9' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '29',
                                                            'type' => '3549'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_qp_dest',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '14369' => {
                                       'BaseType' => '14374',
                                       'Name' => 'struct ibv_modify_qp*',
                                       'Size' => '120',
                                       'Type' => 'Pointer'
                                     },
                          '14374' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2629'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '14402'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '14402' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '14414'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '14770'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_qp::anon-union-kern-abi.h-194',
                                       'NameSpace' => 'ibv_modify_qp',
                                       'Size' => '112',
                                       'Type' => 'Union'
                                     },
                          '14414' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dest',
                                                            'offset' => '0',
                                                            'type' => '14153'
                                                          },
                                                   '1' => {
                                                            'name' => 'alt_dest',
                                                            'offset' => '32',
                                                            'type' => '14153'
                                                          },
                                                   '10' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '94',
                                                             'type' => '2685'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '96',
                                                             'type' => '3549'
                                                           },
                                                   '12' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '97',
                                                             'type' => '3549'
                                                           },
                                                   '13' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '98',
                                                             'type' => '3549'
                                                           },
                                                   '14' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '99',
                                                             'type' => '3549'
                                                           },
                                                   '15' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '100',
                                                             'type' => '3549'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '101',
                                                             'type' => '3549'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '102',
                                                             'type' => '3549'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '103',
                                                             'type' => '3549'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '104',
                                                             'type' => '3549'
                                                           },
                                                   '2' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '64',
                                                            'type' => '2674'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '105',
                                                             'type' => '3549'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '106',
                                                             'type' => '3549'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '107',
                                                             'type' => '3549'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '108',
                                                             'type' => '3549'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '109',
                                                             'type' => '3549'
                                                           },
                                                   '25' => {
                                                             'name' => 'reserved',
                                                             'offset' => '110',
                                                             'type' => '3567'
                                                           },
                                                   '26' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '112',
                                                             'type' => '2721'
                                                           },
                                                   '3' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '68',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '72',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '76',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '80',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '84',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '88',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '92',
                                                            'type' => '2685'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-194',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '14770' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '712',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dest',
                                                            'offset' => '0',
                                                            'type' => '14153'
                                                          },
                                                   '1' => {
                                                            'name' => 'alt_dest',
                                                            'offset' => '32',
                                                            'type' => '14153'
                                                          },
                                                   '10' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '94',
                                                             'type' => '2685'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '96',
                                                             'type' => '3549'
                                                           },
                                                   '12' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '97',
                                                             'type' => '3549'
                                                           },
                                                   '13' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '98',
                                                             'type' => '3549'
                                                           },
                                                   '14' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '99',
                                                             'type' => '3549'
                                                           },
                                                   '15' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '100',
                                                             'type' => '3549'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '101',
                                                             'type' => '3549'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '102',
                                                             'type' => '3549'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '103',
                                                             'type' => '3549'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '104',
                                                             'type' => '3549'
                                                           },
                                                   '2' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '64',
                                                            'type' => '2674'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '105',
                                                             'type' => '3549'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '106',
                                                             'type' => '3549'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '107',
                                                             'type' => '3549'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '108',
                                                             'type' => '3549'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '109',
                                                             'type' => '3549'
                                                           },
                                                   '25' => {
                                                             'name' => 'reserved',
                                                             'offset' => '110',
                                                             'type' => '3567'
                                                           },
                                                   '26' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '112',
                                                             'type' => '2721'
                                                           },
                                                   '3' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '68',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '72',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '76',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '80',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '84',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '88',
                                                            'type' => '2674'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '92',
                                                            'type' => '2685'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_modify_qp',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '150274' => {
                                        'BaseType' => '150279',
                                        'Name' => 'struct ibv_cq_1_0*',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '150279' => {
                                        'Line' => '137',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '150396'
                                                           },
                                                    '1' => {
                                                             'name' => 'cq_context',
                                                             'offset' => '8',
                                                             'type' => '6661'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '8382'
                                                           },
                                                    '3' => {
                                                             'name' => 'cqe',
                                                             'offset' => '20',
                                                             'type' => '125'
                                                           },
                                                    '4' => {
                                                             'name' => 'mutex',
                                                             'offset' => '24',
                                                             'type' => '8789'
                                                           },
                                                    '5' => {
                                                             'name' => 'cond',
                                                             'offset' => '64',
                                                             'type' => '9021'
                                                           },
                                                    '6' => {
                                                             'name' => 'comp_events_completed',
                                                             'offset' => '112',
                                                             'type' => '8382'
                                                           },
                                                    '7' => {
                                                             'name' => 'async_events_completed',
                                                             'offset' => '116',
                                                             'type' => '8382'
                                                           },
                                                    '8' => {
                                                             'name' => 'real_cq',
                                                             'offset' => '120',
                                                             'type' => '8603'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_cq_1_0',
                                        'Size' => '128',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '150396' => {
                                        'BaseType' => '150401',
                                        'Name' => 'struct ibv_context_1_0*',
                                        'Size' => '248',
                                        'Type' => 'Pointer'
                                      },
                          '150401' => {
                                        'Line' => '218',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'device',
                                                             'offset' => '0',
                                                             'type' => '150482'
                                                           },
                                                    '1' => {
                                                             'name' => 'ops',
                                                             'offset' => '8',
                                                             'type' => '153767'
                                                           },
                                                    '2' => {
                                                             'name' => 'cmd_fd',
                                                             'offset' => '224',
                                                             'type' => '125'
                                                           },
                                                    '3' => {
                                                             'name' => 'async_fd',
                                                             'offset' => '228',
                                                             'type' => '125'
                                                           },
                                                    '4' => {
                                                             'name' => 'num_comp_vectors',
                                                             'offset' => '232',
                                                             'type' => '125'
                                                           },
                                                    '5' => {
                                                             'name' => 'real_context',
                                                             'offset' => '240',
                                                             'type' => '7435'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_context_1_0',
                                        'Size' => '248',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '150482' => {
                                        'BaseType' => '150487',
                                        'Name' => 'struct ibv_device_1_0*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '150487' => {
                                        'Line' => '159',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'obsolete_sysfs_dev',
                                                             'offset' => '0',
                                                             'type' => '6661'
                                                           },
                                                    '1' => {
                                                             'name' => 'obsolete_sysfs_ibdev',
                                                             'offset' => '8',
                                                             'type' => '6661'
                                                           },
                                                    '2' => {
                                                             'name' => 'real_device',
                                                             'offset' => '16',
                                                             'type' => '7547'
                                                           },
                                                    '3' => {
                                                             'name' => '_ops',
                                                             'offset' => '24',
                                                             'type' => '7655'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_device_1_0',
                                        'Size' => '40',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '15158' => {
                                       'BaseType' => '15163',
                                       'Name' => 'struct ibv_modify_qp_ex*',
                                       'Size' => '144',
                                       'Type' => 'Pointer'
                                     },
                          '15163' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3693'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '15191'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp_ex',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '15191' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '15203'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '15258'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_qp_ex::anon-union-kern-abi.h-220',
                                       'NameSpace' => 'ibv_modify_qp_ex',
                                       'Size' => '120',
                                       'Type' => 'Union'
                                     },
                          '15203' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '14770'
                                                          },
                                                   '1' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '112',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '116',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-220',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '15258' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '742',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '14770'
                                                          },
                                                   '1' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '112',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '116',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_qp',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '15333' => {
                                       'BaseType' => '15338',
                                       'Name' => 'struct ib_uverbs_ex_modify_qp_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15338' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '748',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_qp_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '153767' => {
                                        'Line' => '166',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'query_device',
                                                             'offset' => '0',
                                                             'type' => '38386'
                                                           },
                                                    '1' => {
                                                             'name' => 'query_port',
                                                             'offset' => '8',
                                                             'type' => '39096'
                                                           },
                                                    '10' => {
                                                              'name' => 'resize_cq',
                                                              'offset' => '80',
                                                              'type' => '9808'
                                                            },
                                                    '11' => {
                                                              'name' => 'destroy_cq',
                                                              'offset' => '88',
                                                              'type' => '37710'
                                                            },
                                                    '12' => {
                                                              'name' => 'create_srq',
                                                              'offset' => '96',
                                                              'type' => '37337'
                                                            },
                                                    '13' => {
                                                              'name' => 'modify_srq',
                                                              'offset' => '104',
                                                              'type' => '38179'
                                                            },
                                                    '14' => {
                                                              'name' => 'query_srq',
                                                              'offset' => '112',
                                                              'type' => '39153'
                                                            },
                                                    '15' => {
                                                              'name' => 'destroy_srq',
                                                              'offset' => '120',
                                                              'type' => '37758'
                                                            },
                                                    '16' => {
                                                              'name' => 'post_srq_recv',
                                                              'offset' => '128',
                                                              'type' => '155328'
                                                            },
                                                    '17' => {
                                                              'name' => 'create_qp',
                                                              'offset' => '136',
                                                              'type' => '36824'
                                                            },
                                                    '18' => {
                                                              'name' => 'query_qp',
                                                              'offset' => '144',
                                                              'type' => '39122'
                                                            },
                                                    '19' => {
                                                              'name' => 'modify_qp',
                                                              'offset' => '152',
                                                              'type' => '37800'
                                                            },
                                                    '2' => {
                                                             'name' => 'alloc_pd',
                                                             'offset' => '16',
                                                             'type' => '36193'
                                                           },
                                                    '20' => {
                                                              'name' => 'destroy_qp',
                                                              'offset' => '160',
                                                              'type' => '37742'
                                                            },
                                                    '21' => {
                                                              'name' => 'post_send',
                                                              'offset' => '168',
                                                              'type' => '156459'
                                                            },
                                                    '22' => {
                                                              'name' => 'post_recv',
                                                              'offset' => '176',
                                                              'type' => '157008'
                                                            },
                                                    '23' => {
                                                              'name' => 'create_ah',
                                                              'offset' => '184',
                                                              'type' => '36464'
                                                            },
                                                    '24' => {
                                                              'name' => 'destroy_ah',
                                                              'offset' => '192',
                                                              'type' => '37694'
                                                            },
                                                    '25' => {
                                                              'name' => 'attach_mcast',
                                                              'offset' => '200',
                                                              'type' => '157076'
                                                            },
                                                    '26' => {
                                                              'name' => 'detach_mcast',
                                                              'offset' => '208',
                                                              'type' => '157076'
                                                            },
                                                    '3' => {
                                                             'name' => 'dealloc_pd',
                                                             'offset' => '24',
                                                             'type' => '37624'
                                                           },
                                                    '4' => {
                                                             'name' => 'reg_mr',
                                                             'offset' => '32',
                                                             'type' => '154996'
                                                           },
                                                    '5' => {
                                                             'name' => 'dereg_mr',
                                                             'offset' => '40',
                                                             'type' => '155027'
                                                           },
                                                    '6' => {
                                                             'name' => 'create_cq',
                                                             'offset' => '48',
                                                             'type' => '36666'
                                                           },
                                                    '7' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '56',
                                                             'type' => '155074'
                                                           },
                                                    '8' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '64',
                                                             'type' => '155100'
                                                           },
                                                    '9' => {
                                                             'name' => 'cq_event',
                                                             'offset' => '72',
                                                             'type' => '36452'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_context_ops_1_0',
                                        'Size' => '216',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '154996' => {
                                        'Name' => 'struct ibv_mr*(*)(struct ibv_pd*, void*, size_t, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '8341'
                                                            },
                                                     '1' => {
                                                              'type' => '6661'
                                                            },
                                                     '2' => {
                                                              'type' => '9532'
                                                            },
                                                     '3' => {
                                                              'type' => '125'
                                                            }
                                                   },
                                        'Return' => '9426',
                                        'Type' => 'FuncPtr'
                                      },
                          '155027' => {
                                        'Name' => 'int(*)(struct ibv_mr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '9426'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155074' => {
                                        'Name' => 'int(*)(struct ibv_cq_1_0*, int, struct ibv_wc*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '150274'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            },
                                                     '2' => {
                                                              'type' => '9585'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155100' => {
                                        'Name' => 'int(*)(struct ibv_cq_1_0*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '150274'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155328' => {
                                        'Name' => 'int(*)(struct ibv_srq_1_0*, struct ibv_recv_wr_1_0*, struct ibv_recv_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '155354'
                                                            },
                                                     '1' => {
                                                              'type' => '155514'
                                                            },
                                                     '2' => {
                                                              'type' => '155576'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155354' => {
                                        'BaseType' => '155359',
                                        'Name' => 'struct ibv_srq_1_0*',
                                        'Size' => '136',
                                        'Type' => 'Pointer'
                                      },
                          '155359' => {
                                        'Line' => '61',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '150396'
                                                           },
                                                    '1' => {
                                                             'name' => 'srq_context',
                                                             'offset' => '8',
                                                             'type' => '6661'
                                                           },
                                                    '2' => {
                                                             'name' => 'pd',
                                                             'offset' => '16',
                                                             'type' => '155464'
                                                           },
                                                    '3' => {
                                                             'name' => 'handle',
                                                             'offset' => '24',
                                                             'type' => '8382'
                                                           },
                                                    '4' => {
                                                             'name' => 'mutex',
                                                             'offset' => '32',
                                                             'type' => '8789'
                                                           },
                                                    '5' => {
                                                             'name' => 'cond',
                                                             'offset' => '72',
                                                             'type' => '9021'
                                                           },
                                                    '6' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '120',
                                                             'type' => '8382'
                                                           },
                                                    '7' => {
                                                             'name' => 'real_srq',
                                                             'offset' => '128',
                                                             'type' => '9193'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_srq_1_0',
                                        'Size' => '136',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155464' => {
                                        'BaseType' => '155469',
                                        'Name' => 'struct ibv_pd_1_0*',
                                        'Size' => '24',
                                        'Type' => 'Pointer'
                                      },
                          '155469' => {
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '150396'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '8382'
                                                           },
                                                    '2' => {
                                                             'name' => 'real_pd',
                                                             'offset' => '16',
                                                             'type' => '8341'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_pd_1_0',
                                        'Size' => '24',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155514' => {
                                        'BaseType' => '155519',
                                        'Name' => 'struct ibv_recv_wr_1_0*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '155519' => {
                                        'Line' => '111',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '155514'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '8',
                                                             'type' => '9353'
                                                           },
                                                    '2' => {
                                                             'name' => 'sg_list',
                                                             'offset' => '16',
                                                             'type' => '9922'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_sge',
                                                             'offset' => '24',
                                                             'type' => '125'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_recv_wr_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155576' => {
                                        'BaseType' => '155514',
                                        'Name' => 'struct ibv_recv_wr_1_0**',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '156459' => {
                                        'Name' => 'int(*)(struct ibv_qp_1_0*, struct ibv_send_wr_1_0*, struct ibv_send_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '156485'
                                                            },
                                                     '1' => {
                                                              'type' => '156667'
                                                            },
                                                     '2' => {
                                                              'type' => '157003'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '156485' => {
                                        'BaseType' => '156490',
                                        'Name' => 'struct ibv_qp_1_0*',
                                        'Size' => '168',
                                        'Type' => 'Pointer'
                                      },
                          '156490' => {
                                        'Line' => '118',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '150396'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp_context',
                                                             'offset' => '8',
                                                             'type' => '6661'
                                                           },
                                                    '10' => {
                                                              'name' => 'mutex',
                                                              'offset' => '64',
                                                              'type' => '8789'
                                                            },
                                                    '11' => {
                                                              'name' => 'cond',
                                                              'offset' => '104',
                                                              'type' => '9021'
                                                            },
                                                    '12' => {
                                                              'name' => 'events_completed',
                                                              'offset' => '152',
                                                              'type' => '8382'
                                                            },
                                                    '13' => {
                                                              'name' => 'real_qp',
                                                              'offset' => '160',
                                                              'type' => '8419'
                                                            },
                                                    '2' => {
                                                             'name' => 'pd',
                                                             'offset' => '16',
                                                             'type' => '155464'
                                                           },
                                                    '3' => {
                                                             'name' => 'send_cq',
                                                             'offset' => '24',
                                                             'type' => '150274'
                                                           },
                                                    '4' => {
                                                             'name' => 'recv_cq',
                                                             'offset' => '32',
                                                             'type' => '150274'
                                                           },
                                                    '5' => {
                                                             'name' => 'srq',
                                                             'offset' => '40',
                                                             'type' => '155354'
                                                           },
                                                    '6' => {
                                                             'name' => 'handle',
                                                             'offset' => '48',
                                                             'type' => '8382'
                                                           },
                                                    '7' => {
                                                             'name' => 'qp_num',
                                                             'offset' => '52',
                                                             'type' => '8382'
                                                           },
                                                    '8' => {
                                                             'name' => 'state',
                                                             'offset' => '56',
                                                             'type' => '208'
                                                           },
                                                    '9' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '60',
                                                             'type' => '270'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_qp_1_0',
                                        'Size' => '168',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '156667' => {
                                        'BaseType' => '156672',
                                        'Name' => 'struct ibv_send_wr_1_0*',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '156672' => {
                                        'Line' => '84',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '156667'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '8',
                                                             'type' => '9353'
                                                           },
                                                    '2' => {
                                                             'name' => 'sg_list',
                                                             'offset' => '16',
                                                             'type' => '9922'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_sge',
                                                             'offset' => '24',
                                                             'type' => '125'
                                                           },
                                                    '4' => {
                                                             'name' => 'opcode',
                                                             'offset' => '28',
                                                             'type' => '603'
                                                           },
                                                    '5' => {
                                                             'name' => 'send_flags',
                                                             'offset' => '32',
                                                             'type' => '125'
                                                           },
                                                    '6' => {
                                                             'name' => 'imm_data',
                                                             'offset' => '36',
                                                             'type' => '6479'
                                                           },
                                                    '7' => {
                                                             'name' => 'wr',
                                                             'offset' => '40',
                                                             'type' => '156776'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_send_wr_1_0',
                                        'Size' => '72',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '156776' => {
                                        'Line' => '92',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'rdma',
                                                             'offset' => '0',
                                                             'type' => '156792'
                                                           },
                                                    '1' => {
                                                             'name' => 'atomic',
                                                             'offset' => '0',
                                                             'type' => '156833'
                                                           },
                                                    '2' => {
                                                             'name' => 'ud',
                                                             'offset' => '0',
                                                             'type' => '156898'
                                                           }
                                                  },
                                        'Name' => 'ibv_send_wr_1_0::anon-union-compat-1_0.c-92',
                                        'NameSpace' => 'ibv_send_wr_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Union'
                                      },
                          '156792' => {
                                        'Line' => '93',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'remote_addr',
                                                             'offset' => '0',
                                                             'type' => '9353'
                                                           },
                                                    '1' => {
                                                             'name' => 'rkey',
                                                             'offset' => '8',
                                                             'type' => '8382'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-93',
                                        'Size' => '16',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '156833' => {
                                        'Line' => '97',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'remote_addr',
                                                             'offset' => '0',
                                                             'type' => '9353'
                                                           },
                                                    '1' => {
                                                             'name' => 'compare_add',
                                                             'offset' => '8',
                                                             'type' => '9353'
                                                           },
                                                    '2' => {
                                                             'name' => 'swap',
                                                             'offset' => '16',
                                                             'type' => '9353'
                                                           },
                                                    '3' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '8382'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-97',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '156898' => {
                                        'Line' => '103',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ah',
                                                             'offset' => '0',
                                                             'type' => '156941'
                                                           },
                                                    '1' => {
                                                             'name' => 'remote_qpn',
                                                             'offset' => '8',
                                                             'type' => '8382'
                                                           },
                                                    '2' => {
                                                             'name' => 'remote_qkey',
                                                             'offset' => '12',
                                                             'type' => '8382'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-103',
                                        'Size' => '16',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '156941' => {
                                        'BaseType' => '156946',
                                        'Name' => 'struct ibv_ah_1_0*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '156946' => {
                                        'Line' => '151',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '150396'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '155464'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '8382'
                                                           },
                                                    '3' => {
                                                             'name' => 'real_ah',
                                                             'offset' => '24',
                                                             'type' => '10516'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_ah_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '157003' => {
                                        'BaseType' => '156667',
                                        'Name' => 'struct ibv_send_wr_1_0**',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '157008' => {
                                        'Name' => 'int(*)(struct ibv_qp_1_0*, struct ibv_recv_wr_1_0*, struct ibv_recv_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '156485'
                                                            },
                                                     '1' => {
                                                              'type' => '155514'
                                                            },
                                                     '2' => {
                                                              'type' => '155576'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '157076' => {
                                        'Name' => 'int(*)(struct ibv_qp*, union ibv_gid*, uint16_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '8419'
                                                            },
                                                     '1' => {
                                                              'type' => '157102'
                                                            },
                                                     '2' => {
                                                              'type' => '9797'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '157102' => {
                                        'BaseType' => '36374',
                                        'Name' => 'union ibv_gid*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '167079' => {
                                        'BaseType' => '150482',
                                        'Name' => 'struct ibv_device_1_0**',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '167084' => {
                                        'BaseType' => '167089',
                                        'Name' => 'char const*',
                                        'Size' => '1',
                                        'Type' => 'Pointer'
                                      },
                          '167089' => {
                                        'BaseType' => '7736',
                                        'Name' => 'char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '167094' => {
                                        'BaseType' => '167099',
                                        'Name' => 'struct ibv_mr_1_0*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '167099' => {
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '150396'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '155464'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '8382'
                                                           },
                                                    '3' => {
                                                             'name' => 'lkey',
                                                             'offset' => '20',
                                                             'type' => '8382'
                                                           },
                                                    '4' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '8382'
                                                           },
                                                    '5' => {
                                                             'name' => 'real_mr',
                                                             'offset' => '32',
                                                             'type' => '9426'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_mr_1_0',
                                        'Size' => '40',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '167185' => {
                                        'BaseType' => '7547',
                                        'Name' => 'struct ibv_device**',
                                        'Size' => '664',
                                        'Type' => 'Pointer'
                                      },
                          '167190' => {
                                        'BaseType' => '18418',
                                        'Name' => '__be16*',
                                        'Size' => '2',
                                        'Type' => 'Pointer'
                                      },
                          '167206' => {
                                        'BaseType' => '150274',
                                        'Name' => 'struct ibv_cq_1_0**',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '167216' => {
                                        'BaseType' => '167221',
                                        'Name' => 'struct ibv_qp_init_attr_1_0*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '167221' => {
                                        'Line' => '74',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp_context',
                                                             'offset' => '0',
                                                             'type' => '6661'
                                                           },
                                                    '1' => {
                                                             'name' => 'send_cq',
                                                             'offset' => '8',
                                                             'type' => '150274'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv_cq',
                                                             'offset' => '16',
                                                             'type' => '150274'
                                                           },
                                                    '3' => {
                                                             'name' => 'srq',
                                                             'offset' => '24',
                                                             'type' => '155354'
                                                           },
                                                    '4' => {
                                                             'name' => 'cap',
                                                             'offset' => '32',
                                                             'type' => '36951'
                                                           },
                                                    '5' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '52',
                                                             'type' => '270'
                                                           },
                                                    '6' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '56',
                                                             'type' => '125'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_qp_init_attr_1_0',
                                        'Size' => '64',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '167314' => {
                                        'BaseType' => '167325',
                                        'Line' => '228',
                                        'Name' => 'ibv_driver_init_func_1_1',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Typedef'
                                      },
                          '167325' => {
                                        'Name' => 'struct ibv_device*(*)(char const*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '167084'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            }
                                                   },
                                        'Return' => '7547',
                                        'Type' => 'FuncPtr'
                                      },
                          '167868' => {
                                        'Header' => 'list.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '167901'
                                                           },
                                                    '1' => {
                                                             'name' => 'prev',
                                                             'offset' => '8',
                                                             'type' => '167901'
                                                           }
                                                  },
                                        'Name' => 'struct list_node',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '167901' => {
                                        'BaseType' => '167868',
                                        'Name' => 'struct list_node*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '16885' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '512',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'grh',
                                                            'offset' => '0',
                                                            'type' => '16999'
                                                          },
                                                   '1' => {
                                                            'name' => 'dlid',
                                                            'offset' => '24',
                                                            'type' => '2685'
                                                          },
                                                   '2' => {
                                                            'name' => 'sl',
                                                            'offset' => '26',
                                                            'type' => '3549'
                                                          },
                                                   '3' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '27',
                                                            'type' => '3549'
                                                          },
                                                   '4' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '28',
                                                            'type' => '3549'
                                                          },
                                                   '5' => {
                                                            'name' => 'is_global',
                                                            'offset' => '29',
                                                            'type' => '3549'
                                                          },
                                                   '6' => {
                                                            'name' => 'port_num',
                                                            'offset' => '30',
                                                            'type' => '3549'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '31',
                                                            'type' => '3549'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ah_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '169623' => {
                                        'BaseType' => '169628',
                                        'Name' => 'struct verbs_device*',
                                        'Size' => '704',
                                        'Type' => 'Pointer'
                                      },
                          '169628' => {
                                        'Header' => 'driver.h',
                                        'Line' => '228',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'device',
                                                             'offset' => '0',
                                                             'type' => '7552'
                                                           },
                                                    '1' => {
                                                             'name' => 'ops',
                                                             'offset' => '664',
                                                             'type' => '172672'
                                                           },
                                                    '2' => {
                                                             'name' => 'refcount',
                                                             'offset' => '672',
                                                             'type' => '181883'
                                                           },
                                                    '3' => {
                                                             'name' => 'entry',
                                                             'offset' => '680',
                                                             'type' => '167868'
                                                           },
                                                    '4' => {
                                                             'name' => 'sysfs',
                                                             'offset' => '696',
                                                             'type' => '172950'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_device',
                                        'Size' => '704',
                                        'Type' => 'Struct'
                                      },
                          '16999' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '503',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '3567'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '20',
                                                            'type' => '3549'
                                                          },
                                                   '3' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '21',
                                                            'type' => '3549'
                                                          },
                                                   '4' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '22',
                                                            'type' => '3549'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '23',
                                                            'type' => '3549'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_global_route',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '17204' => {
                                       'BaseType' => '17209',
                                       'Name' => 'struct ib_uverbs_create_ah_resp*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '17209' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '878',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah_handle',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '4',
                                                            'type' => '4555'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_ah_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '172672' => {
                                        'BaseType' => '172677',
                                        'Name' => 'struct verbs_device_ops const*',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '172677' => {
                                        'BaseType' => '172682',
                                        'Name' => 'struct verbs_device_ops const',
                                        'Size' => '72',
                                        'Type' => 'Const'
                                      },
                          '172682' => {
                                        'Header' => 'driver.h',
                                        'Line' => '208',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '167084'
                                                           },
                                                    '1' => {
                                                             'name' => 'match_min_abi_version',
                                                             'offset' => '8',
                                                             'type' => '8382'
                                                           },
                                                    '2' => {
                                                             'name' => 'match_max_abi_version',
                                                             'offset' => '12',
                                                             'type' => '8382'
                                                           },
                                                    '3' => {
                                                             'name' => 'match_table',
                                                             'offset' => '16',
                                                             'type' => '172821'
                                                           },
                                                    '4' => {
                                                             'name' => 'static_providers',
                                                             'offset' => '24',
                                                             'type' => '172929'
                                                           },
                                                    '5' => {
                                                             'name' => 'match_device',
                                                             'offset' => '32',
                                                             'type' => '172934'
                                                           },
                                                    '6' => {
                                                             'name' => 'alloc_context',
                                                             'offset' => '40',
                                                             'type' => '173255'
                                                           },
                                                    '7' => {
                                                             'name' => 'free_context',
                                                             'offset' => '48',
                                                             'type' => '7712'
                                                           },
                                                    '8' => {
                                                             'name' => 'alloc_device',
                                                             'offset' => '56',
                                                             'type' => '181855'
                                                           },
                                                    '9' => {
                                                             'name' => 'uninit_device',
                                                             'offset' => '64',
                                                             'type' => '181871'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_device_ops',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '172821' => {
                                        'BaseType' => '172826',
                                        'Name' => 'struct verbs_match_ent const*',
                                        'Size' => '24',
                                        'Type' => 'Pointer'
                                      },
                          '172826' => {
                                        'BaseType' => '172831',
                                        'Name' => 'struct verbs_match_ent const',
                                        'Size' => '24',
                                        'Type' => 'Const'
                                      },
                          '172831' => {
                                        'Header' => 'driver.h',
                                        'Line' => '137',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '0',
                                                             'type' => '6661'
                                                           },
                                                    '1' => {
                                                             'name' => 'u',
                                                             'offset' => '8',
                                                             'type' => '172863'
                                                           },
                                                    '2' => {
                                                             'name' => 'vendor',
                                                             'offset' => '16',
                                                             'type' => '9797'
                                                           },
                                                    '3' => {
                                                             'name' => 'device',
                                                             'offset' => '18',
                                                             'type' => '9797'
                                                           },
                                                    '4' => {
                                                             'name' => 'kind',
                                                             'offset' => '20',
                                                             'type' => '8219'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_match_ent',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '172863' => {
                                        'Header' => 'driver.h',
                                        'Line' => '139',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'modalias',
                                                             'offset' => '0',
                                                             'type' => '167084'
                                                           },
                                                    '1' => {
                                                             'name' => 'driver_id',
                                                             'offset' => '0',
                                                             'type' => '9353'
                                                           }
                                                  },
                                        'Name' => 'verbs_match_ent::anon-union-driver.h-139',
                                        'NameSpace' => 'verbs_match_ent',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '172929' => {
                                        'BaseType' => '172672',
                                        'Name' => 'struct verbs_device_ops const**',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '172934' => {
                                        'Name' => '_Bool(*)(struct verbs_sysfs_dev*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '172950'
                                                            }
                                                   },
                                        'Return' => '63',
                                        'Type' => 'FuncPtr'
                                      },
                          '172950' => {
                                        'BaseType' => '172955',
                                        'Name' => 'struct verbs_sysfs_dev*',
                                        'Size' => '1048',
                                        'Type' => 'Pointer'
                                      },
                          '172955' => {
                                        'Header' => 'driver.h',
                                        'Line' => '188',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entry',
                                                             'offset' => '0',
                                                             'type' => '167868'
                                                           },
                                                    '1' => {
                                                             'name' => 'provider_data',
                                                             'offset' => '16',
                                                             'type' => '6661'
                                                           },
                                                    '10' => {
                                                              'name' => 'node_guid',
                                                              'offset' => '1008',
                                                              'type' => '9353'
                                                            },
                                                    '11' => {
                                                              'name' => 'driver_id',
                                                              'offset' => '1016',
                                                              'type' => '8382'
                                                            },
                                                    '12' => {
                                                              'name' => 'node_type',
                                                              'offset' => '1020',
                                                              'type' => '70'
                                                            },
                                                    '13' => {
                                                              'name' => 'ibdev_idx',
                                                              'offset' => '1024',
                                                              'type' => '125'
                                                            },
                                                    '14' => {
                                                              'name' => 'abi_ver',
                                                              'offset' => '1028',
                                                              'type' => '8382'
                                                            },
                                                    '15' => {
                                                              'name' => 'time_created',
                                                              'offset' => '1032',
                                                              'type' => '34340'
                                                            },
                                                    '2' => {
                                                             'name' => 'match',
                                                             'offset' => '24',
                                                             'type' => '172821'
                                                           },
                                                    '3' => {
                                                             'name' => 'flags',
                                                             'offset' => '32',
                                                             'type' => '201'
                                                           },
                                                    '4' => {
                                                             'name' => 'sysfs_name',
                                                             'offset' => '36',
                                                             'type' => '7724'
                                                           },
                                                    '5' => {
                                                             'name' => 'sysfs_cdev',
                                                             'offset' => '104',
                                                             'type' => '173165'
                                                           },
                                                    '6' => {
                                                             'name' => 'ibdev_name',
                                                             'offset' => '112',
                                                             'type' => '7724'
                                                           },
                                                    '7' => {
                                                             'name' => 'ibdev_path',
                                                             'offset' => '176',
                                                             'type' => '7724'
                                                           },
                                                    '8' => {
                                                             'name' => 'modalias',
                                                             'offset' => '432',
                                                             'type' => '7724'
                                                           },
                                                    '9' => {
                                                             'name' => 'fw_ver',
                                                             'offset' => '944',
                                                             'type' => '7724'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_sysfs_dev',
                                        'Size' => '1048',
                                        'Type' => 'Struct'
                                      },
                          '173165' => {
                                        'BaseType' => '173176',
                                        'Header' => 'types.h',
                                        'Line' => '60',
                                        'Name' => 'dev_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '173176' => {
                                        'BaseType' => '4870',
                                        'Header' => 'types.h',
                                        'Line' => '124',
                                        'Name' => '__dev_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '173255' => {
                                        'Name' => 'struct verbs_context*(*)(struct ibv_device*, int, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '7547'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            },
                                                     '2' => {
                                                              'type' => '6661'
                                                            }
                                                   },
                                        'Return' => '31245',
                                        'Type' => 'FuncPtr'
                                      },
                          '175' => {
                                     'BaseType' => '201',
                                     'Header' => 'verbs.h',
                                     'Line' => '637',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_MW_TYPE_1',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_MW_TYPE_2',
                                                          'value' => '2'
                                                        }
                                               },
                                     'Name' => 'enum ibv_mw_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '181855' => {
                                        'Name' => 'struct verbs_device*(*)(struct verbs_sysfs_dev*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '172950'
                                                            }
                                                   },
                                        'Return' => '169623',
                                        'Type' => 'FuncPtr'
                                      },
                          '181871' => {
                                        'Name' => 'void(*)(struct verbs_device*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '169623'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'FuncPtr'
                                      },
                          '181883' => {
                                        'BaseType' => '125',
                                        'Header' => 'stdatomic.h',
                                        'Line' => '97',
                                        'Name' => 'atomic_int',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '183981' => {
                                        'BaseType' => '183986',
                                        'Name' => 'struct verbs_context_ops const*',
                                        'Size' => '528',
                                        'Type' => 'Pointer'
                                      },
                          '183986' => {
                                        'BaseType' => '35293',
                                        'Name' => 'struct verbs_context_ops const',
                                        'Size' => '528',
                                        'Type' => 'Const'
                                      },
                          '18418' => {
                                       'BaseType' => '2685',
                                       'Header' => 'types.h',
                                       'Line' => '28',
                                       'Name' => '__be16',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '201' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '20530' => {
                                       'BaseType' => '8219',
                                       'Name' => 'uint8_t[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '208' => {
                                     'BaseType' => '201',
                                     'Header' => 'verbs.h',
                                     'Line' => '996',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_QPS_RESET',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_QPS_INIT',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_QPS_RTR',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_QPS_RTS',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_QPS_SQD',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_QPS_SQE',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_QPS_ERR',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_QPS_UNKNOWN',
                                                          'value' => '7'
                                                        }
                                               },
                                     'Name' => 'enum ibv_qp_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '21573' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1837',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '7435'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21645' => {
                                       'BaseType' => '21650',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21650' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1987',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '7435'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '22046' => {
                                       'BaseType' => '22051',
                                       'Name' => 'struct ibv_create_wq*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '22051' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3693'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '22079'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_wq',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '22079' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '22091'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '22219'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_wq::anon-union-kern-abi.h-215',
                                       'NameSpace' => 'ibv_create_wq',
                                       'Size' => '40',
                                       'Type' => 'Union'
                                     },
                          '22091' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'reserved',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-215',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '22219' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2703'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2674'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2674'
                                                          },
                                                   '7' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '32',
                                                            'type' => '2674'
                                                          },
                                                   '8' => {
                                                            'name' => 'reserved',
                                                            'offset' => '36',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_wq',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '22373' => {
                                       'BaseType' => '22378',
                                       'Name' => 'struct ib_uverbs_ex_create_wq_resp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22378' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'wqn',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_wq_resp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22492' => {
                                       'BaseType' => '22497',
                                       'Name' => 'struct ibv_modify_wq*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '22497' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '221',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3693'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '22525'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_wq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '22525' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '221',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '22537'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '22628'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_wq::anon-union-kern-abi.h-221',
                                       'NameSpace' => 'ibv_modify_wq',
                                       'Size' => '24',
                                       'Type' => 'Union'
                                     },
                          '22537' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '221',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-221',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22628' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1257',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '2674'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '4',
                                                            'type' => '2674'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '8',
                                                            'type' => '2674'
                                                          },
                                                   '3' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '12',
                                                            'type' => '2674'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '2674'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '20',
                                                            'type' => '2674'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_wq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '226764' => {
                                        'BaseType' => '16885',
                                        'Name' => 'struct ib_uverbs_ah_attr*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '227665' => {
                                        'BaseType' => '227670',
                                        'Name' => 'struct ib_uverbs_qp_attr*',
                                        'Size' => '144',
                                        'Type' => 'Pointer'
                                      },
                          '227670' => {
                                        'Header' => 'ib_user_verbs.h',
                                        'Line' => '523',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp_attr_mask',
                                                             'offset' => '0',
                                                             'type' => '2674'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '4',
                                                             'type' => '2674'
                                                           },
                                                    '10' => {
                                                              'name' => 'ah_attr',
                                                              'offset' => '40',
                                                              'type' => '16885'
                                                            },
                                                    '11' => {
                                                              'name' => 'alt_ah_attr',
                                                              'offset' => '72',
                                                              'type' => '16885'
                                                            },
                                                    '12' => {
                                                              'name' => 'max_send_wr',
                                                              'offset' => '104',
                                                              'type' => '2674'
                                                            },
                                                    '13' => {
                                                              'name' => 'max_recv_wr',
                                                              'offset' => '108',
                                                              'type' => '2674'
                                                            },
                                                    '14' => {
                                                              'name' => 'max_send_sge',
                                                              'offset' => '112',
                                                              'type' => '2674'
                                                            },
                                                    '15' => {
                                                              'name' => 'max_recv_sge',
                                                              'offset' => '116',
                                                              'type' => '2674'
                                                            },
                                                    '16' => {
                                                              'name' => 'max_inline_data',
                                                              'offset' => '120',
                                                              'type' => '2674'
                                                            },
                                                    '17' => {
                                                              'name' => 'pkey_index',
                                                              'offset' => '124',
                                                              'type' => '2685'
                                                            },
                                                    '18' => {
                                                              'name' => 'alt_pkey_index',
                                                              'offset' => '126',
                                                              'type' => '2685'
                                                            },
                                                    '19' => {
                                                              'name' => 'en_sqd_async_notify',
                                                              'offset' => '128',
                                                              'type' => '3549'
                                                            },
                                                    '2' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '8',
                                                             'type' => '2674'
                                                           },
                                                    '20' => {
                                                              'name' => 'sq_draining',
                                                              'offset' => '129',
                                                              'type' => '3549'
                                                            },
                                                    '21' => {
                                                              'name' => 'max_rd_atomic',
                                                              'offset' => '130',
                                                              'type' => '3549'
                                                            },
                                                    '22' => {
                                                              'name' => 'max_dest_rd_atomic',
                                                              'offset' => '131',
                                                              'type' => '3549'
                                                            },
                                                    '23' => {
                                                              'name' => 'min_rnr_timer',
                                                              'offset' => '132',
                                                              'type' => '3549'
                                                            },
                                                    '24' => {
                                                              'name' => 'port_num',
                                                              'offset' => '133',
                                                              'type' => '3549'
                                                            },
                                                    '25' => {
                                                              'name' => 'timeout',
                                                              'offset' => '134',
                                                              'type' => '3549'
                                                            },
                                                    '26' => {
                                                              'name' => 'retry_cnt',
                                                              'offset' => '135',
                                                              'type' => '3549'
                                                            },
                                                    '27' => {
                                                              'name' => 'rnr_retry',
                                                              'offset' => '136',
                                                              'type' => '3549'
                                                            },
                                                    '28' => {
                                                              'name' => 'alt_port_num',
                                                              'offset' => '137',
                                                              'type' => '3549'
                                                            },
                                                    '29' => {
                                                              'name' => 'alt_timeout',
                                                              'offset' => '138',
                                                              'type' => '3549'
                                                            },
                                                    '3' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '12',
                                                             'type' => '2674'
                                                           },
                                                    '30' => {
                                                              'name' => 'reserved',
                                                              'offset' => '139',
                                                              'type' => '3567'
                                                            },
                                                    '4' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '16',
                                                             'type' => '2674'
                                                           },
                                                    '5' => {
                                                             'name' => 'qkey',
                                                             'offset' => '20',
                                                             'type' => '2674'
                                                           },
                                                    '6' => {
                                                             'name' => 'rq_psn',
                                                             'offset' => '24',
                                                             'type' => '2674'
                                                           },
                                                    '7' => {
                                                             'name' => 'sq_psn',
                                                             'offset' => '28',
                                                             'type' => '2674'
                                                           },
                                                    '8' => {
                                                             'name' => 'dest_qp_num',
                                                             'offset' => '32',
                                                             'type' => '2674'
                                                           },
                                                    '9' => {
                                                             'name' => 'qp_access_flags',
                                                             'offset' => '36',
                                                             'type' => '2674'
                                                           }
                                                  },
                                        'Name' => 'struct ib_uverbs_qp_attr',
                                        'Size' => '144',
                                        'Type' => 'Struct'
                                      },
                          '228095' => {
                                        'BaseType' => '228100',
                                        'Name' => 'struct ibv_sa_path_rec*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '228100' => {
                                        'Header' => 'sa.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dgid',
                                                             'offset' => '0',
                                                             'type' => '36374'
                                                           },
                                                    '1' => {
                                                             'name' => 'sgid',
                                                             'offset' => '16',
                                                             'type' => '36374'
                                                           },
                                                    '10' => {
                                                              'name' => 'pkey',
                                                              'offset' => '54',
                                                              'type' => '18418'
                                                            },
                                                    '11' => {
                                                              'name' => 'sl',
                                                              'offset' => '56',
                                                              'type' => '8219'
                                                            },
                                                    '12' => {
                                                              'name' => 'mtu_selector',
                                                              'offset' => '57',
                                                              'type' => '8219'
                                                            },
                                                    '13' => {
                                                              'name' => 'mtu',
                                                              'offset' => '58',
                                                              'type' => '8219'
                                                            },
                                                    '14' => {
                                                              'name' => 'rate_selector',
                                                              'offset' => '59',
                                                              'type' => '8219'
                                                            },
                                                    '15' => {
                                                              'name' => 'rate',
                                                              'offset' => '60',
                                                              'type' => '8219'
                                                            },
                                                    '16' => {
                                                              'name' => 'packet_life_time_selector',
                                                              'offset' => '61',
                                                              'type' => '8219'
                                                            },
                                                    '17' => {
                                                              'name' => 'packet_life_time',
                                                              'offset' => '62',
                                                              'type' => '8219'
                                                            },
                                                    '18' => {
                                                              'name' => 'preference',
                                                              'offset' => '63',
                                                              'type' => '8219'
                                                            },
                                                    '2' => {
                                                             'name' => 'dlid',
                                                             'offset' => '32',
                                                             'type' => '18418'
                                                           },
                                                    '3' => {
                                                             'name' => 'slid',
                                                             'offset' => '34',
                                                             'type' => '18418'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_traffic',
                                                             'offset' => '36',
                                                             'type' => '125'
                                                           },
                                                    '5' => {
                                                             'name' => 'flow_label',
                                                             'offset' => '40',
                                                             'type' => '6479'
                                                           },
                                                    '6' => {
                                                             'name' => 'hop_limit',
                                                             'offset' => '44',
                                                             'type' => '8219'
                                                           },
                                                    '7' => {
                                                             'name' => 'traffic_class',
                                                             'offset' => '45',
                                                             'type' => '8219'
                                                           },
                                                    '8' => {
                                                             'name' => 'reversible',
                                                             'offset' => '48',
                                                             'type' => '125'
                                                           },
                                                    '9' => {
                                                             'name' => 'numb_path',
                                                             'offset' => '52',
                                                             'type' => '8219'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_sa_path_rec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '228366' => {
                                        'BaseType' => '228371',
                                        'Name' => 'struct ib_user_path_rec*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '228371' => {
                                        'Header' => 'ib_user_sa.h',
                                        'Line' => '55',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dgid',
                                                             'offset' => '0',
                                                             'type' => '3567'
                                                           },
                                                    '1' => {
                                                             'name' => 'sgid',
                                                             'offset' => '16',
                                                             'type' => '3567'
                                                           },
                                                    '10' => {
                                                              'name' => 'traffic_class',
                                                              'offset' => '55',
                                                              'type' => '3549'
                                                            },
                                                    '11' => {
                                                              'name' => 'numb_path',
                                                              'offset' => '56',
                                                              'type' => '3549'
                                                            },
                                                    '12' => {
