$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.7',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'Compiler' => 'clang version 5.0.2 (tags/RELEASE_502/final)',
          'Headers' => {
                         'bitmap.h' => 1,
                         'cmd_ioctl.h' => 1,
                         'driver.h' => 1,
                         'ib_user_ioctl_verbs.h' => 1,
                         'ib_user_sa.h' => 1,
                         'ib_user_verbs.h' => 1,
                         'ibverbs.h' => 1,
                         'int-ll64.h' => 1,
                         'kern-abi.h' => 1,
                         'list.h' => 1,
                         'pthreadtypes.h' => 1,
                         'rdma_user_ioctl_cmds.h' => 1,
                         'sa.h' => 1,
                         'stdatomic.h' => 1,
                         'stddef.h' => 1,
                         'stdint.h' => 1,
                         'time.h' => 1,
                         'types.h' => 1,
                         'verbs.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libibverbs.so.1.5.20.0',
          'LibraryVersion' => 'ibverbs',
          'LocalSymbols' => {},
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libnl-3.so.200' => 1,
                        'libnl-route-3.so.200' => 1,

                                                       'ibv_query_device@@IBVERBS_1.1' => 1,
                                                       'ibv_query_device@IBVERBS_1.0' => 1,
                                                       'ibv_query_gid@@IBVERBS_1.1' => 1,
                                                       'ibv_query_gid@IBVERBS_1.0' => 1,
                                                       'ibv_query_gid_type@@IBVERBS_PRIVATE_20' => 1,
                                                       'ibv_query_pkey@@IBVERBS_1.1' => 1,
                                                       'ibv_query_pkey@IBVERBS_1.0' => 1,
                                                       'ibv_query_port@@IBVERBS_1.1' => 1,
                                                       'ibv_query_port@IBVERBS_1.0' => 1,
                                                       'ibv_query_qp@@IBVERBS_1.1' => 1,
                                                       'ibv_query_qp@IBVERBS_1.0' => 1,
                                                       'ibv_query_srq@@IBVERBS_1.1' => 1,
                                                       'ibv_query_srq@IBVERBS_1.0' => 1,
                                                       'ibv_rate_to_mbps@@IBVERBS_1.1' => 1,
                                                       'ibv_rate_to_mult@@IBVERBS_1.0' => 1,
                                                       'ibv_read_sysfs_file@@IBVERBS_1.0' => 1,
                                                       'ibv_reg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_reg_mr@IBVERBS_1.0' => 1,
                                                       'ibv_register_driver@IBVERBS_1.1' => 1,
                                                       'ibv_rereg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@IBVERBS_1.0' => 1,
                                                       'ibv_resolve_eth_l2_from_gid@@IBVERBS_1.1' => 1,
                                                       'ibv_wc_status_str@@IBVERBS_1.1' => 1,
                                                       'mbps_to_ibv_rate@@IBVERBS_1.1' => 1,
                                                       'mult_to_ibv_rate@@IBVERBS_1.0' => 1,
                                                       'verbs_allow_disassociate_destroy@@IBVERBS_PRIVATE_20' => -1,
                                                       'verbs_init_cq@@IBVERBS_PRIVATE_20' => 1,
                                                       'verbs_register_driver_20@@IBVERBS_PRIVATE_20' => 1,
                                                       'verbs_set_ops@@IBVERBS_PRIVATE_20' => 1,
                                                       'verbs_uninit_context@@IBVERBS_PRIVATE_20' => 1
                                                     }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10034' => {
                                       'BaseType' => '10039',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10039' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1758',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2553'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '100449' => {
                                        'BaseType' => '100454',
                                        'Name' => 'struct ibv_cq_1_0*',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '100454' => {
                                        'Line' => '137',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '100571'
                                                           },
                                                    '1' => {
                                                             'name' => 'cq_context',
                                                             'offset' => '8',
                                                             'type' => '2433'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '3467'
                                                           },
                                                    '3' => {
                                                             'name' => 'cqe',
                                                             'offset' => '20',
                                                             'type' => '2830'
                                                           },
                                                    '4' => {
                                                             'name' => 'mutex',
                                                             'offset' => '24',
                                                             'type' => '3874'
                                                           },
                                                    '5' => {
                                                             'name' => 'cond',
                                                             'offset' => '64',
                                                             'type' => '4106'
                                                           },
                                                    '6' => {
                                                             'name' => 'comp_events_completed',
                                                             'offset' => '112',
                                                             'type' => '3467'
                                                           },
                                                    '7' => {
                                                             'name' => 'async_events_completed',
                                                             'offset' => '116',
                                                             'type' => '3467'
                                                           },
                                                    '8' => {
                                                             'name' => 'real_cq',
                                                             'offset' => '120',
                                                             'type' => '3688'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_cq_1_0',
                                        'Size' => '128',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '100571' => {
                                        'BaseType' => '100576',
                                        'Name' => 'struct ibv_context_1_0*',
                                        'Size' => '248',
                                        'Type' => 'Pointer'
                                      },
                          '100576' => {
                                        'Line' => '218',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'device',
                                                             'offset' => '0',
                                                             'type' => '100657'
                                                           },
                                                    '1' => {
                                                             'name' => 'ops',
                                                             'offset' => '8',
                                                             'type' => '103920'
                                                           },
                                                    '2' => {
                                                             'name' => 'cmd_fd',
                                                             'offset' => '224',
                                                             'type' => '2830'
                                                           },
                                                    '3' => {
                                                             'name' => 'async_fd',
                                                             'offset' => '228',
                                                             'type' => '2830'
                                                           },
                                                    '4' => {
                                                             'name' => 'num_comp_vectors',
                                                             'offset' => '232',
                                                             'type' => '2830'
                                                           },
                                                    '5' => {
                                                             'name' => 'real_context',
                                                             'offset' => '240',
                                                             'type' => '2553'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_context_1_0',
                                        'Size' => '248',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '10062' => {
                                       'BaseType' => '3467',
                                       'Name' => 'uint32_t*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '100657' => {
                                        'BaseType' => '100662',
                                        'Name' => 'struct ibv_device_1_0*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '100662' => {
                                        'Line' => '159',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'obsolete_sysfs_dev',
                                                             'offset' => '0',
                                                             'type' => '2433'
                                                           },
                                                    '1' => {
                                                             'name' => 'obsolete_sysfs_ibdev',
                                                             'offset' => '8',
                                                             'type' => '2433'
                                                           },
                                                    '2' => {
                                                             'name' => 'real_device',
                                                             'offset' => '16',
                                                             'type' => '2665'
                                                           },
                                                    '3' => {
                                                             'name' => '_ops',
                                                             'offset' => '24',
                                                             'type' => '2773'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_device_1_0',
                                        'Size' => '40',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '10067' => {
                                       'BaseType' => '4911',
                                       'Name' => 'uint8_t*',
                                       'Size' => '1',
                                       'Type' => 'Pointer'
                                     },
                          '10077' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '146',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'command',
                                                            'offset' => '0',
                                                            'type' => '2462'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_words',
                                                            'offset' => '4',
                                                            'type' => '6569'
                                                          },
                                                   '2' => {
                                                            'name' => 'out_words',
                                                            'offset' => '6',
                                                            'type' => '6569'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_cmd_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10127' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '550',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '6228'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '6228'
                                                          },
                                                   '10' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '48',
                                                             'type' => '2462'
                                                           },
                                                   '11' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '52',
                                                             'type' => '6784'
                                                           },
                                                   '12' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '53',
                                                             'type' => '6784'
                                                           },
                                                   '13' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '54',
                                                             'type' => '6784'
                                                           },
                                                   '14' => {
                                                             'name' => 'reserved',
                                                             'offset' => '55',
                                                             'type' => '6784'
                                                           },
                                                   '15' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '6580'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2462'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2462'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '24',
                                                            'type' => '2462'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '28',
                                                            'type' => '2462'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '32',
                                                            'type' => '2462'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '36',
                                                            'type' => '2462'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '40',
                                                            'type' => '2462'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '44',
                                                            'type' => '2462'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_qp',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '1019' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '955',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MIG_MIGRATED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MIG_REARM',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_MIG_ARMED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mig_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '10363' => {
                                       'Header' => 'driver.h',
                                       'Line' => '114',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'action',
                                                            'offset' => '0',
                                                            'type' => '9962'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '3467'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '12',
                                                            'type' => '2387'
                                                          }
                                                 },
                                       'Name' => 'struct verbs_flow_action',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '103920' => {
                                        'Line' => '166',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'query_device',
                                                             'offset' => '0',
                                                             'type' => '27324'
                                                           },
                                                    '1' => {
                                                             'name' => 'query_port',
                                                             'offset' => '8',
                                                             'type' => '27955'
                                                           },
                                                    '10' => {
                                                              'name' => 'resize_cq',
                                                              'offset' => '80',
                                                              'type' => '4929'
                                                            },
                                                    '11' => {
                                                              'name' => 'destroy_cq',
                                                              'offset' => '88',
                                                              'type' => '26653'
                                                            },
                                                    '12' => {
                                                              'name' => 'create_srq',
                                                              'offset' => '96',
                                                              'type' => '26280'
                                                            },
                                                    '13' => {
                                                              'name' => 'modify_srq',
                                                              'offset' => '104',
                                                              'type' => '27117'
                                                            },
                                                    '14' => {
                                                              'name' => 'query_srq',
                                                              'offset' => '112',
                                                              'type' => '28300'
                                                            },
                                                    '15' => {
                                                              'name' => 'destroy_srq',
                                                              'offset' => '120',
                                                              'type' => '26701'
                                                            },
                                                    '16' => {
                                                              'name' => 'post_srq_recv',
                                                              'offset' => '128',
                                                              'type' => '105468'
                                                            },
                                                    '17' => {
                                                              'name' => 'create_qp',
                                                              'offset' => '136',
                                                              'type' => '25785'
                                                            },
                                                    '18' => {
                                                              'name' => 'query_qp',
                                                              'offset' => '144',
                                                              'type' => '28269'
                                                            },
                                                    '19' => {
                                                              'name' => 'modify_qp',
                                                              'offset' => '152',
                                                              'type' => '26738'
                                                            },
                                                    '2' => {
                                                             'name' => 'alloc_pd',
                                                             'offset' => '16',
                                                             'type' => '25159'
                                                           },
                                                    '20' => {
                                                              'name' => 'destroy_qp',
                                                              'offset' => '160',
                                                              'type' => '26685'
                                                            },
                                                    '21' => {
                                                              'name' => 'post_send',
                                                              'offset' => '168',
                                                              'type' => '106599'
                                                            },
                                                    '22' => {
                                                              'name' => 'post_recv',
                                                              'offset' => '176',
                                                              'type' => '107148'
                                                            },
                                                    '23' => {
                                                              'name' => 'create_ah',
                                                              'offset' => '184',
                                                              'type' => '25425'
                                                            },
                                                    '24' => {
                                                              'name' => 'destroy_ah',
                                                              'offset' => '192',
                                                              'type' => '26637'
                                                            },
                                                    '25' => {
                                                              'name' => 'attach_mcast',
                                                              'offset' => '200',
                                                              'type' => '107216'
                                                            },
                                                    '26' => {
                                                              'name' => 'detach_mcast',
                                                              'offset' => '208',
                                                              'type' => '107216'
                                                            },
                                                    '3' => {
                                                             'name' => 'dealloc_pd',
                                                             'offset' => '24',
                                                             'type' => '26567'
                                                           },
                                                    '4' => {
                                                             'name' => 'reg_mr',
                                                             'offset' => '32',
                                                             'type' => '28321'
                                                           },
                                                    '5' => {
                                                             'name' => 'dereg_mr',
                                                             'offset' => '40',
                                                             'type' => '105167'
                                                           },
                                                    '6' => {
                                                             'name' => 'create_cq',
                                                             'offset' => '48',
                                                             'type' => '25627'
                                                           },
                                                    '7' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '56',
                                                             'type' => '105214'
                                                           },
                                                    '8' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '64',
                                                             'type' => '105240'
                                                           },
                                                    '9' => {
                                                             'name' => 'cq_event',
                                                             'offset' => '72',
                                                             'type' => '25413'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_context_ops_1_0',
                                        'Size' => '216',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '10418' => {
                                       'Header' => 'driver.h',
                                       'Line' => '206',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'counters',
                                                            'offset' => '0',
                                                            'type' => '10039'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct verbs_counters',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10466' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '51',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '10077'
                                                          },
                                                   '1' => {
                                                            'name' => 'ex_hdr',
                                                            'offset' => '8',
                                                            'type' => '10499'
                                                          }
                                                 },
                                       'Name' => 'struct ex_hdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1047' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '131',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '10499' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '6228'
                                                          },
                                                   '1' => {
                                                            'name' => 'provider_in_words',
                                                            'offset' => '8',
                                                            'type' => '6569'
                                                          },
                                                   '2' => {
                                                            'name' => 'provider_out_words',
                                                            'offset' => '10',
                                                            'type' => '6569'
                                                          },
                                                   '3' => {
                                                            'name' => 'cmd_hdr_reserved',
                                                            'offset' => '12',
                                                            'type' => '2462'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_cmd_hdr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '105167' => {
                                        'Name' => 'int(*)(struct ibv_mr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '4511'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '105214' => {
                                        'Name' => 'int(*)(struct ibv_cq_1_0*, int, struct ibv_wc*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '100449'
                                                            },
                                                     '1' => {
                                                              'type' => '2830'
                                                            },
                                                     '2' => {
                                                              'type' => '4670'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '105240' => {
                                        'Name' => 'int(*)(struct ibv_cq_1_0*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '100449'
                                                            },
                                                     '1' => {
                                                              'type' => '2830'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '105468' => {
                                        'Name' => 'int(*)(struct ibv_srq_1_0*, struct ibv_recv_wr_1_0*, struct ibv_recv_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '105494'
                                                            },
                                                     '1' => {
                                                              'type' => '105654'
                                                            },
                                                     '2' => {
                                                              'type' => '105716'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '105494' => {
                                        'BaseType' => '105499',
                                        'Name' => 'struct ibv_srq_1_0*',
                                        'Size' => '136',
                                        'Type' => 'Pointer'
                                      },
                          '105499' => {
                                        'Line' => '61',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '100571'
                                                           },
                                                    '1' => {
                                                             'name' => 'srq_context',
                                                             'offset' => '8',
                                                             'type' => '2433'
                                                           },
                                                    '2' => {
                                                             'name' => 'pd',
                                                             'offset' => '16',
                                                             'type' => '105604'
                                                           },
                                                    '3' => {
                                                             'name' => 'handle',
                                                             'offset' => '24',
                                                             'type' => '3467'
                                                           },
                                                    '4' => {
                                                             'name' => 'mutex',
                                                             'offset' => '32',
                                                             'type' => '3874'
                                                           },
                                                    '5' => {
                                                             'name' => 'cond',
                                                             'offset' => '72',
                                                             'type' => '4106'
                                                           },
                                                    '6' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '120',
                                                             'type' => '3467'
                                                           },
                                                    '7' => {
                                                             'name' => 'real_srq',
                                                             'offset' => '128',
                                                             'type' => '4278'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_srq_1_0',
                                        'Size' => '136',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '105604' => {
                                        'BaseType' => '105609',
                                        'Name' => 'struct ibv_pd_1_0*',
                                        'Size' => '24',
                                        'Type' => 'Pointer'
                                      },
                          '105609' => {
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '100571'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '3467'
                                                           },
                                                    '2' => {
                                                             'name' => 'real_pd',
                                                             'offset' => '16',
                                                             'type' => '3426'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_pd_1_0',
                                        'Size' => '24',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '105654' => {
                                        'BaseType' => '105659',
                                        'Name' => 'struct ibv_recv_wr_1_0*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '105659' => {
                                        'Line' => '111',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '105654'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '8',
                                                             'type' => '4438'
                                                           },
                                                    '2' => {
                                                             'name' => 'sg_list',
                                                             'offset' => '16',
                                                             'type' => '5043'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_sge',
                                                             'offset' => '24',
                                                             'type' => '2830'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_recv_wr_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '105716' => {
                                        'BaseType' => '105654',
                                        'Name' => 'struct ibv_recv_wr_1_0**',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '106599' => {
                                        'Name' => 'int(*)(struct ibv_qp_1_0*, struct ibv_send_wr_1_0*, struct ibv_send_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '106625'
                                                            },
                                                     '1' => {
                                                              'type' => '106807'
                                                            },
                                                     '2' => {
                                                              'type' => '107143'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '106625' => {
                                        'BaseType' => '106630',
                                        'Name' => 'struct ibv_qp_1_0*',
                                        'Size' => '168',
                                        'Type' => 'Pointer'
                                      },
                          '106630' => {
                                        'Line' => '118',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '100571'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp_context',
                                                             'offset' => '8',
                                                             'type' => '2433'
                                                           },
                                                    '10' => {
                                                              'name' => 'mutex',
                                                              'offset' => '64',
                                                              'type' => '3874'
                                                            },
                                                    '11' => {
                                                              'name' => 'cond',
                                                              'offset' => '104',
                                                              'type' => '4106'
                                                            },
                                                    '12' => {
                                                              'name' => 'events_completed',
                                                              'offset' => '152',
                                                              'type' => '3467'
                                                            },
                                                    '13' => {
                                                              'name' => 'real_qp',
                                                              'offset' => '160',
                                                              'type' => '3504'
                                                            },
                                                    '2' => {
                                                             'name' => 'pd',
                                                             'offset' => '16',
                                                             'type' => '105604'
                                                           },
                                                    '3' => {
                                                             'name' => 'send_cq',
                                                             'offset' => '24',
                                                             'type' => '100449'
                                                           },
                                                    '4' => {
                                                             'name' => 'recv_cq',
                                                             'offset' => '32',
                                                             'type' => '100449'
                                                           },
                                                    '5' => {
                                                             'name' => 'srq',
                                                             'offset' => '40',
                                                             'type' => '105494'
                                                           },
                                                    '6' => {
                                                             'name' => 'handle',
                                                             'offset' => '48',
                                                             'type' => '3467'
                                                           },
                                                    '7' => {
                                                             'name' => 'qp_num',
                                                             'offset' => '52',
                                                             'type' => '3467'
                                                           },
                                                    '8' => {
                                                             'name' => 'state',
                                                             'offset' => '56',
                                                             'type' => '182'
                                                           },
                                                    '9' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '60',
                                                             'type' => '240'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_qp_1_0',
                                        'Size' => '168',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '106807' => {
                                        'BaseType' => '106812',
                                        'Name' => 'struct ibv_send_wr_1_0*',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '106812' => {
                                        'Line' => '84',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '106807'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '8',
                                                             'type' => '4438'
                                                           },
                                                    '2' => {
                                                             'name' => 'sg_list',
                                                             'offset' => '16',
                                                             'type' => '5043'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_sge',
                                                             'offset' => '24',
                                                             'type' => '2830'
                                                           },
                                                    '4' => {
                                                             'name' => 'opcode',
                                                             'offset' => '28',
                                                             'type' => '554'
                                                           },
                                                    '5' => {
                                                             'name' => 'send_flags',
                                                             'offset' => '32',
                                                             'type' => '2830'
                                                           },
                                                    '6' => {
                                                             'name' => 'imm_data',
                                                             'offset' => '36',
                                                             'type' => '4882'
                                                           },
                                                    '7' => {
                                                             'name' => 'wr',
                                                             'offset' => '40',
                                                             'type' => '106916'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_send_wr_1_0',
                                        'Size' => '72',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '106916' => {
                                        'Line' => '92',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'rdma',
                                                             'offset' => '0',
                                                             'type' => '106932'
                                                           },
                                                    '1' => {
                                                             'name' => 'atomic',
                                                             'offset' => '0',
                                                             'type' => '106973'
                                                           },
                                                    '2' => {
                                                             'name' => 'ud',
                                                             'offset' => '0',
                                                             'type' => '107038'
                                                           }
                                                  },
                                        'Name' => 'ibv_send_wr_1_0::anon-union-compat-1_0.c-92',
                                        'NameSpace' => 'ibv_send_wr_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Union'
                                      },
                          '106932' => {
                                        'Line' => '93',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'remote_addr',
                                                             'offset' => '0',
                                                             'type' => '4438'
                                                           },
                                                    '1' => {
                                                             'name' => 'rkey',
                                                             'offset' => '8',
                                                             'type' => '3467'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-93',
                                        'Size' => '16',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '106973' => {
                                        'Line' => '97',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'remote_addr',
                                                             'offset' => '0',
                                                             'type' => '4438'
                                                           },
                                                    '1' => {
                                                             'name' => 'compare_add',
                                                             'offset' => '8',
                                                             'type' => '4438'
                                                           },
                                                    '2' => {
                                                             'name' => 'swap',
                                                             'offset' => '16',
                                                             'type' => '4438'
                                                           },
                                                    '3' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '3467'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-97',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '107038' => {
                                        'Line' => '103',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ah',
                                                             'offset' => '0',
                                                             'type' => '107081'
                                                           },
                                                    '1' => {
                                                             'name' => 'remote_qpn',
                                                             'offset' => '8',
                                                             'type' => '3467'
                                                           },
                                                    '2' => {
                                                             'name' => 'remote_qkey',
                                                             'offset' => '12',
                                                             'type' => '3467'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-103',
                                        'Size' => '16',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '107081' => {
                                        'BaseType' => '107086',
                                        'Name' => 'struct ibv_ah_1_0*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '107086' => {
                                        'Line' => '151',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '100571'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '105604'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '3467'
                                                           },
                                                    '3' => {
                                                             'name' => 'real_ah',
                                                             'offset' => '24',
                                                             'type' => '5637'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_ah_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '107143' => {
                                        'BaseType' => '106807',
                                        'Name' => 'struct ibv_send_wr_1_0**',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '107148' => {
                                        'Name' => 'int(*)(struct ibv_qp_1_0*, struct ibv_recv_wr_1_0*, struct ibv_recv_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '106625'
                                                            },
                                                     '1' => {
                                                              'type' => '105654'
                                                            },
                                                     '2' => {
                                                              'type' => '105716'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '107216' => {
                                        'Name' => 'int(*)(struct ibv_qp*, union ibv_gid*, uint16_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3504'
                                                            },
                                                     '1' => {
                                                              'type' => '107242'
                                                            },
                                                     '2' => {
                                                              'type' => '4893'
                                                            }
                                                   },
                                        'Return' => '2830',
                                        'Type' => 'FuncPtr'
                                      },
                          '107242' => {
                                        'BaseType' => '25335',
                                        'Name' => 'union ibv_gid*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '1074' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '321',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_PORT_NOP',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_PORT_DOWN',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_PORT_INIT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_PORT_ARMED',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_PORT_ACTIVE',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_PORT_ACTIVE_DEFER',
                                                           'value' => '5'
                                                         }
                                                },
                                      'Name' => 'enum ibv_port_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '10743' => {
                                       'BaseType' => '10748',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '232',
                                       'Type' => 'Pointer'
                                     },
                          '10748' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fw_ver',
                                                            'offset' => '0',
                                                            'type' => '2849'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_guid',
                                                            'offset' => '64',
                                                            'type' => '11237'
                                                          },
                                                   '10' => {
                                                             'name' => 'device_cap_flags',
                                                             'offset' => '116',
                                                             'type' => '2473'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_sge',
                                                             'offset' => '120',
                                                             'type' => '2830'
                                                           },
                                                   '12' => {
                                                             'name' => 'max_sge_rd',
                                                             'offset' => '124',
                                                             'type' => '2830'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_cq',
                                                             'offset' => '128',
                                                             'type' => '2830'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_cqe',
                                                             'offset' => '132',
                                                             'type' => '2830'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_mr',
                                                             'offset' => '136',
                                                             'type' => '2830'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_pd',
                                                             'offset' => '140',
                                                             'type' => '2830'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_qp_rd_atom',
                                                             'offset' => '144',
                                                             'type' => '2830'
                                                           },
                                                   '18' => {
                                                             'name' => 'max_ee_rd_atom',
                                                             'offset' => '148',
                                                             'type' => '2830'
                                                           },
                                                   '19' => {
                                                             'name' => 'max_res_rd_atom',
                                                             'offset' => '152',
                                                             'type' => '2830'
                                                           },
                                                   '2' => {
                                                            'name' => 'sys_image_guid',
                                                            'offset' => '72',
                                                            'type' => '11237'
                                                          },
                                                   '20' => {
                                                             'name' => 'max_qp_init_rd_atom',
                                                             'offset' => '156',
                                                             'type' => '2830'
                                                           },
                                                   '21' => {
                                                             'name' => 'max_ee_init_rd_atom',
                                                             'offset' => '160',
                                                             'type' => '2830'
                                                           },
                                                   '22' => {
                                                             'name' => 'atomic_cap',
                                                             'offset' => '164',
                                                             'type' => '1047'
                                                           },
                                                   '23' => {
                                                             'name' => 'max_ee',
                                                             'offset' => '168',
                                                             'type' => '2830'
                                                           },
                                                   '24' => {
                                                             'name' => 'max_rdd',
                                                             'offset' => '172',
                                                             'type' => '2830'
                                                           },
                                                   '25' => {
                                                             'name' => 'max_mw',
                                                             'offset' => '176',
                                                             'type' => '2830'
                                                           },
                                                   '26' => {
                                                             'name' => 'max_raw_ipv6_qp',
                                                             'offset' => '180',
                                                             'type' => '2830'
                                                           },
                                                   '27' => {
                                                             'name' => 'max_raw_ethy_qp',
                                                             'offset' => '184',
                                                             'type' => '2830'
                                                           },
                                                   '28' => {
                                                             'name' => 'max_mcast_grp',
                                                             'offset' => '188',
                                                             'type' => '2830'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_mcast_qp_attach',
                                                             'offset' => '192',
                                                             'type' => '2830'
                                                           },
                                                   '3' => {
                                                            'name' => 'max_mr_size',
                                                            'offset' => '80',
                                                            'type' => '4438'
                                                          },
                                                   '30' => {
                                                             'name' => 'max_total_mcast_qp_attach',
                                                             'offset' => '196',
                                                             'type' => '2830'
                                                           },
                                                   '31' => {
                                                             'name' => 'max_ah',
                                                             'offset' => '200',
                                                             'type' => '2830'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_fmr',
                                                             'offset' => '204',
                                                             'type' => '2830'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_map_per_fmr',
                                                             'offset' => '208',
                                                             'type' => '2830'
                                                           },
                                                   '34' => {
                                                             'name' => 'max_srq',
                                                             'offset' => '212',
                                                             'type' => '2830'
                                                           },
                                                   '35' => {
                                                             'name' => 'max_srq_wr',
                                                             'offset' => '216',
                                                             'type' => '2830'
                                                           },
                                                   '36' => {
                                                             'name' => 'max_srq_sge',
                                                             'offset' => '220',
                                                             'type' => '2830'
                                                           },
                                                   '37' => {
                                                             'name' => 'max_pkeys',
                                                             'offset' => '224',
                                                             'type' => '4893'
                                                           },
                                                   '38' => {
                                                             'name' => 'local_ca_ack_delay',
                                                             'offset' => '226',
                                                             'type' => '4911'
                                                           },
                                                   '39' => {
                                                             'name' => 'phys_port_cnt',
                                                             'offset' => '227',
                                                             'type' => '4911'
                                                           },
                                                   '4' => {
                                                            'name' => 'page_size_cap',
                                                            'offset' => '88',
                                                            'type' => '4438'
                                                          },
                                                   '5' => {
                                                            'name' => 'vendor_id',
                                                            'offset' => '96',
                                                            'type' => '3467'
                                                          },
                                                   '6' => {
                                                            'name' => 'vendor_part_id',
                                                            'offset' => '100',
                                                            'type' => '3467'
                                                          },
                                                   '7' => {
                                                            'name' => 'hw_ver',
                                                            'offset' => '104',
                                                            'type' => '3467'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_qp',
                                                            'offset' => '108',
                                                            'type' => '2830'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_qp_wr',
                                                            'offset' => '112',
                                                            'type' => '2830'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device_attr',
                                       'Size' => '232',
                                       'Type' => 'Struct'
                                     },
                          '110487' => {
                                        'BaseType' => '100657',
                                        'Name' => 'struct ibv_device_1_0**',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '110492' => {
                                        'BaseType' => '110497',
                                        'Name' => 'char const*',
                                        'Size' => '1',
                                        'Type' => 'Pointer'
                                      },
                          '110497' => {
                                        'BaseType' => '2861',
                                        'Name' => 'char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '110502' => {
                                        'BaseType' => '110507',
                                        'Name' => 'struct ibv_mr_1_0*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '110507' => {
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '100571'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '105604'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '3467'
                                                           },
                                                    '3' => {
                                                             'name' => 'lkey',
                                                             'offset' => '20',
                                                             'type' => '3467'
                                                           },
                                                    '4' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '3467'
                                                           },
                                                    '5' => {
                                                             'name' => 'real_mr',
                                                             'offset' => '32',
                                                             'type' => '4511'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_mr_1_0',
                                        'Size' => '40',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '110593' => {
                                        'BaseType' => '2665',
                                        'Name' => 'struct ibv_device**',
                                        'Size' => '664',
                                        'Type' => 'Pointer'
                                      },
                          '110920' => {
                                        'BaseType' => '6795',
                                        'Name' => '__be16*',
                                        'Size' => '2',
                                        'Type' => 'Pointer'
                                      },
                          '110947' => {
                                        'BaseType' => '100449',
                                        'Name' => 'struct ibv_cq_1_0**',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '110957' => {
                                        'BaseType' => '110962',
                                        'Name' => 'struct ibv_qp_init_attr_1_0*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '110962' => {
                                        'Line' => '74',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp_context',
                                                             'offset' => '0',
                                                             'type' => '2433'
                                                           },
                                                    '1' => {
                                                             'name' => 'send_cq',
                                                             'offset' => '8',
                                                             'type' => '100449'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv_cq',
                                                             'offset' => '16',
                                                             'type' => '100449'
                                                           },
                                                    '3' => {
                                                             'name' => 'srq',
                                                             'offset' => '24',
                                                             'type' => '105494'
                                                           },
                                                    '4' => {
                                                             'name' => 'cap',
                                                             'offset' => '32',
                                                             'type' => '25912'
                                                           },
                                                    '5' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '52',
                                                             'type' => '240'
                                                           },
                                                    '6' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '56',
                                                             'type' => '2830'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_qp_init_attr_1_0',
                                        'Size' => '64',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '111055' => {
                                        'BaseType' => '111066',
                                        'Line' => '228',
                                        'Name' => 'ibv_driver_init_func_1_1',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Typedef'
                                      },
                          '111066' => {
                                        'Name' => 'struct ibv_device*(*)(char const*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '110492'
                                                            },
                                                     '1' => {
                                                              'type' => '2830'
                                                            }
                                                   },
                                        'Return' => '2665',
                                        'Type' => 'FuncPtr'
                                      },
                          '111474' => {
                                        'Header' => 'list.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '111507'
                                                           },
                                                    '1' => {
                                                             'name' => 'prev',
                                                             'offset' => '8',
                                                             'type' => '111507'
                                                           }
                                                  },
                                        'Name' => 'struct list_node',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '111507' => {
                                        'BaseType' => '111474',
                                        'Name' => 'struct list_node*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '11237' => {
                                       'BaseType' => '6228',
                                       'Header' => 'types.h',
                                       'Line' => '32',
                                       'Name' => '__be64',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11253' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '174',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fw_ver',
                                                            'offset' => '0',
                                                            'type' => '6228'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_guid',
                                                            'offset' => '8',
                                                            'type' => '11237'
                                                          },
                                                   '10' => {
                                                             'name' => 'device_cap_flags',
                                                             'offset' => '60',
                                                             'type' => '2462'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_sge',
                                                             'offset' => '64',
                                                             'type' => '2462'
                                                           },
                                                   '12' => {
                                                             'name' => 'max_sge_rd',
                                                             'offset' => '68',
                                                             'type' => '2462'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_cq',
                                                             'offset' => '72',
                                                             'type' => '2462'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_cqe',
                                                             'offset' => '76',
                                                             'type' => '2462'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_mr',
                                                             'offset' => '80',
                                                             'type' => '2462'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_pd',
                                                             'offset' => '84',
                                                             'type' => '2462'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_qp_rd_atom',
                                                             'offset' => '88',
                                                             'type' => '2462'
                                                           },
                                                   '18' => {
                                                             'name' => 'max_ee_rd_atom',
                                                             'offset' => '92',
                                                             'type' => '2462'
                                                           },
                                                   '19' => {
                                                             'name' => 'max_res_rd_atom',
                                                             'offset' => '96',
                                                             'type' => '2462'
                                                           },
                                                   '2' => {
                                                            'name' => 'sys_image_guid',
                                                            'offset' => '16',
                                                            'type' => '11237'
                                                          },
                                                   '20' => {
                                                             'name' => 'max_qp_init_rd_atom',
                                                             'offset' => '100',
                                                             'type' => '2462'
                                                           },
                                                   '21' => {
                                                             'name' => 'max_ee_init_rd_atom',
                                                             'offset' => '104',
                                                             'type' => '2462'
                                                           },
                                                   '22' => {
                                                             'name' => 'atomic_cap',
                                                             'offset' => '108',
                                                             'type' => '2462'
                                                           },
                                                   '23' => {
                                                             'name' => 'max_ee',
                                                             'offset' => '112',
                                                             'type' => '2462'
                                                           },
                                                   '24' => {
                                                             'name' => 'max_rdd',
                                                             'offset' => '116',
                                                             'type' => '2462'
                                                           },
                                                   '25' => {
                                                             'name' => 'max_mw',
                                                             'offset' => '120',
                                                             'type' => '2462'
                                                           },
                                                   '26' => {
                                                             'name' => 'max_raw_ipv6_qp',
                                                             'offset' => '124',
                                                             'type' => '2462'
                                                           },
                                                   '27' => {
                                                             'name' => 'max_raw_ethy_qp',
                                                             'offset' => '128',
                                                             'type' => '2462'
                                                           },
                                                   '28' => {
                                                             'name' => 'max_mcast_grp',
                                                             'offset' => '132',
                                                             'type' => '2462'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_mcast_qp_attach',
                                                             'offset' => '136',
                                                             'type' => '2462'
                                                           },
                                                   '3' => {
                                                            'name' => 'max_mr_size',
                                                            'offset' => '24',
                                                            'type' => '6228'
                                                          },
                                                   '30' => {
                                                             'name' => 'max_total_mcast_qp_attach',
                                                             'offset' => '140',
                                                             'type' => '2462'
                                                           },
                                                   '31' => {
                                                             'name' => 'max_ah',
                                                             'offset' => '144',
                                                             'type' => '2462'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_fmr',
                                                             'offset' => '148',
                                                             'type' => '2462'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_map_per_fmr',
                                                             'offset' => '152',
                                                             'type' => '2462'
                                                           },
                                                   '34' => {
                                                             'name' => 'max_srq',
                                                             'offset' => '156',
                                                             'type' => '2462'
                                                           },
                                                   '35' => {
                                                             'name' => 'max_srq_wr',
                                                             'offset' => '160',
                                                             'type' => '2462'
                                                           },
                                                   '36' => {
                                                             'name' => 'max_srq_sge',
                                                             'offset' => '164',
                                                             'type' => '2462'
                                                           },
                                                   '37' => {
                                                             'name' => 'max_pkeys',
                                                             'offset' => '168',
                                                             'type' => '6569'
                                                           },
                                                   '38' => {
                                                             'name' => 'local_ca_ack_delay',
                                                             'offset' => '170',
                                                             'type' => '6784'
                                                           },
                                                   '39' => {
                                                             'name' => 'phys_port_cnt',
                                                             'offset' => '171',
                                                             'type' => '6784'
                                                           },
                                                   '4' => {
                                                            'name' => 'page_size_cap',
                                                            'offset' => '32',
                                                            'type' => '6228'
                                                          },
                                                   '40' => {
                                                             'name' => 'reserved',
                                                             'offset' => '172',
                                                             'type' => '6772'
                                                           },
                                                   '5' => {
                                                            'name' => 'vendor_id',
                                                            'offset' => '40',
                                                            'type' => '2462'
                                                          },
                                                   '6' => {
                                                            'name' => 'vendor_part_id',
                                                            'offset' => '44',
                                                            'type' => '2462'
                                                          },
                                                   '7' => {
                                                            'name' => 'hw_ver',
                                                            'offset' => '48',
                                                            'type' => '2462'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_qp',
                                                            'offset' => '52',
                                                            'type' => '2462'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_qp_wr',
                                                            'offset' => '56',
                                                            'type' => '2462'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_query_device_resp',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '112605' => {
                                        'BaseType' => '112610',
                                        'Name' => 'struct verbs_device*',
                                        'Size' => '704',
                                        'Type' => 'Pointer'
                                      },
                          '112610' => {
                                        'Header' => 'driver.h',
                                        'Line' => '198',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'device',
                                                             'offset' => '0',
                                                             'type' => '2670'
                                                           },
                                                    '1' => {
                                                             'name' => 'ops',
                                                             'offset' => '664',
                                                             'type' => '115618'
                                                           },
                                                    '2' => {
                                                             'name' => 'refcount',
                                                             'offset' => '672',
                                                             'type' => '124433'
                                                           },
                                                    '3' => {
                                                             'name' => 'entry',
                                                             'offset' => '680',
                                                             'type' => '111474'
                                                           },
                                                    '4' => {
                                                             'name' => 'sysfs',
                                                             'offset' => '696',
                                                             'type' => '115857'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_device',
                                        'Size' => '704',
                                        'Type' => 'Struct'
                                      },
                          '115618' => {
                                        'BaseType' => '115623',
                                        'Name' => 'struct verbs_device_ops const*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '115623' => {
                                        'BaseType' => '115628',
                                        'Name' => 'struct verbs_device_ops const',
                                        'Size' => '64',
                                        'Type' => 'Const'
                                      },
                          '115628' => {
                                        'Header' => 'driver.h',
                                        'Line' => '180',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '110492'
                                                           },
                                                    '1' => {
                                                             'name' => 'match_min_abi_version',
                                                             'offset' => '8',
                                                             'type' => '2830'
                                                           },
                                                    '2' => {
                                                             'name' => 'match_max_abi_version',
                                                             'offset' => '12',
                                                             'type' => '2830'
                                                           },
                                                    '3' => {
                                                             'name' => 'match_table',
                                                             'offset' => '16',
                                                             'type' => '115755'
                                                           },
                                                    '4' => {
                                                             'name' => 'match_device',
                                                             'offset' => '24',
                                                             'type' => '115834'
                                                           },
                                                    '5' => {
                                                             'name' => 'alloc_context',
                                                             'offset' => '32',
                                                             'type' => '116064'
                                                           },
                                                    '6' => {
                                                             'name' => 'free_context',
                                                             'offset' => '40',
                                                             'type' => '2837'
                                                           },
                                                    '7' => {
                                                             'name' => 'alloc_device',
                                                             'offset' => '48',
                                                             'type' => '124405'
                                                           },
                                                    '8' => {
                                                             'name' => 'uninit_device',
                                                             'offset' => '56',
                                                             'type' => '124421'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_device_ops',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '115755' => {
                                        'BaseType' => '115760',
                                        'Name' => 'struct verbs_match_ent const*',
                                        'Size' => '24',
                                        'Type' => 'Pointer'
                                      },
                          '115760' => {
                                        'BaseType' => '115765',
                                        'Name' => 'struct verbs_match_ent const',
                                        'Size' => '24',
                                        'Type' => 'Const'
                                      },
                          '115765' => {
                                        'Header' => 'driver.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '0',
                                                             'type' => '2433'
                                                           },
                                                    '1' => {
                                                             'name' => 'modalias',
                                                             'offset' => '8',
                                                             'type' => '110492'
                                                           },
                                                    '2' => {
                                                             'name' => 'vendor',
                                                             'offset' => '16',
                                                             'type' => '4893'
                                                           },
                                                    '3' => {
                                                             'name' => 'device',
                                                             'offset' => '18',
                                                             'type' => '4893'
                                                           },
                                                    '4' => {
                                                             'name' => 'kind',
                                                             'offset' => '20',
                                                             'type' => '4911'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_match_ent',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '115834' => {
                                        'Name' => '_Bool(*)(struct verbs_sysfs_dev*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '115857'
                                                            }
                                                   },
                                        'Return' => '63',
                                        'Type' => 'FuncPtr'
                                      },
                          '115857' => {
                                        'BaseType' => '115862',
                                        'Name' => 'struct verbs_sysfs_dev*',
                                        'Size' => '1208',
                                        'Type' => 'Pointer'
                                      },
                          '115862' => {
                                        'Header' => 'driver.h',
                                        'Line' => '166',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entry',
                                                             'offset' => '0',
                                                             'type' => '111474'
                                                           },
                                                    '1' => {
                                                             'name' => 'provider_data',
                                                             'offset' => '16',
                                                             'type' => '2433'
                                                           },
                                                    '2' => {
                                                             'name' => 'match',
                                                             'offset' => '24',
                                                             'type' => '115755'
                                                           },
                                                    '3' => {
                                                             'name' => 'sysfs_name',
                                                             'offset' => '32',
                                                             'type' => '2849'
                                                           },
                                                    '4' => {
                                                             'name' => 'ibdev_name',
                                                             'offset' => '96',
                                                             'type' => '2849'
                                                           },
                                                    '5' => {
                                                             'name' => 'sysfs_path',
                                                             'offset' => '160',
                                                             'type' => '2849'
                                                           },
                                                    '6' => {
                                                             'name' => 'ibdev_path',
                                                             'offset' => '416',
                                                             'type' => '2849'
                                                           },
                                                    '7' => {
                                                             'name' => 'modalias',
                                                             'offset' => '672',
                                                             'type' => '2849'
                                                           },
                                                    '8' => {
                                                             'name' => 'abi_ver',
                                                             'offset' => '1184',
                                                             'type' => '2830'
                                                           },
                                                    '9' => {
                                                             'name' => 'time_created',
                                                             'offset' => '1192',
                                                             'type' => '23350'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_sysfs_dev',
                                        'Size' => '1208',
                                        'Type' => 'Struct'
                                      },
                          '116064' => {
                                        'Name' => 'struct verbs_context*(*)(struct ibv_device*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2665'
                                                            },
                                                     '1' => {
                                                              'type' => '2830'
                                                            }
                                                   },
                                        'Return' => '20651',
                                        'Type' => 'FuncPtr'
                                      },
                          '11769' => {
                                       'BaseType' => '4438',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '121' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '89',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                          'value' => '18446744073709551615'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_TRANSPORT_IB',
                                                          'value' => '0'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_TRANSPORT_IWARP',
                                                          'value' => '1'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC',
                                                          'value' => '2'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum ibv_transport_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '124405' => {
                                        'Name' => 'struct verbs_device*(*)(struct verbs_sysfs_dev*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '115857'
                                                            }
                                                   },
                                        'Return' => '112605',
                                        'Type' => 'FuncPtr'
                                      },
                          '124421' => {
                                        'Name' => 'void(*)(struct verbs_device*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '112605'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'FuncPtr'
                                      },
                          '124433' => {
                                        'BaseType' => '2830',
                                        'Header' => 'stdatomic.h',
                                        'Line' => '97',
                                        'Name' => 'atomic_int',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '125413' => {
                                        'BaseType' => '125418',
                                        'Name' => 'struct verbs_context_ops const*',
                                        'Size' => '520',
                                        'Type' => 'Pointer'
                                      },
                          '125418' => {
                                        'BaseType' => '24291',
                                        'Name' => 'struct verbs_context_ops const',
                                        'Size' => '520',
                                        'Type' => 'Const'
                                      },
                          '12655' => {
                                       'BaseType' => '2830',
                                       'Name' => 'int*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '160' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '605',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_MW_TYPE_1',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_MW_TYPE_2',
                                                          'value' => '2'
                                                        }
                                               },
                                     'Name' => 'enum ibv_mw_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '162879' => {
                                        'BaseType' => '37731',
                                        'Name' => 'struct ib_uverbs_ah_attr*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '163762' => {
                                        'BaseType' => '163767',
                                        'Name' => 'struct ib_uverbs_qp_attr*',
                                        'Size' => '144',
                                        'Type' => 'Pointer'
                                      },
                          '163767' => {
                                        'Header' => 'ib_user_verbs.h',
                                        'Line' => '512',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp_attr_mask',
                                                             'offset' => '0',
                                                             'type' => '2462'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '4',
                                                             'type' => '2462'
                                                           },
                                                    '10' => {
                                                              'name' => 'ah_attr',
                                                              'offset' => '40',
                                                              'type' => '37731'
                                                            },
                                                    '11' => {
                                                              'name' => 'alt_ah_attr',
                                                              'offset' => '72',
                                                              'type' => '37731'
                                                            },
                                                    '12' => {
                                                              'name' => 'max_send_wr',
                                                              'offset' => '104',
                                                              'type' => '2462'
                                                            },
                                                    '13' => {
                                                              'name' => 'max_recv_wr',
                                                              'offset' => '108',
                                                              'type' => '2462'
                                                            },
                                                    '14' => {
                                                              'name' => 'max_send_sge',
                                                              'offset' => '112',
                                                              'type' => '2462'
                                                            },
                                                    '15' => {
                                                              'name' => 'max_recv_sge',
                                                              'offset' => '116',
                                                              'type' => '2462'
                                                            },
                                                    '16' => {
                                                              'name' => 'max_inline_data',
                                                              'offset' => '120',
                                                              'type' => '2462'
                                                            },
                                                    '17' => {
                                                              'name' => 'pkey_index',
                                                              'offset' => '124',
                                                              'type' => '6569'
                                                            },
                                                    '18' => {
                                                              'name' => 'alt_pkey_index',
                                                              'offset' => '126',
                                                              'type' => '6569'
                                                            },
                                                    '19' => {
                                                              'name' => 'en_sqd_async_notify',
                                                              'offset' => '128',
                                                              'type' => '6784'
                                                            },
                                                    '2' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '8',
                                                             'type' => '2462'
                                                           },
                                                    '20' => {
                                                              'name' => 'sq_draining',
                                                              'offset' => '129',
                                                              'type' => '6784'
                                                            },
                                                    '21' => {
                                                              'name' => 'max_rd_atomic',
                                                              'offset' => '130',
                                                              'type' => '6784'
                                                            },
                                                    '22' => {
                                                              'name' => 'max_dest_rd_atomic',
                                                              'offset' => '131',
                                                              'type' => '6784'
                                                            },
                                                    '23' => {
                                                              'name' => 'min_rnr_timer',
                                                              'offset' => '132',
                                                              'type' => '6784'
                                                            },
                                                    '24' => {
                                                              'name' => 'port_num',
                                                              'offset' => '133',
                                                              'type' => '6784'
                                                            },
                                                    '25' => {
                                                              'name' => 'timeout',
                                                              'offset' => '134',
                                                              'type' => '6784'
                                                            },
                                                    '26' => {
                                                              'name' => 'retry_cnt',
                                                              'offset' => '135',
                                                              'type' => '6784'
                                                            },
                                                    '27' => {
                                                              'name' => 'rnr_retry',
                                                              'offset' => '136',
                                                              'type' => '6784'
                                                            },
                                                    '28' => {
                                                              'name' => 'alt_port_num',
                                                              'offset' => '137',
                                                              'type' => '6784'
                                                            },
                                                    '29' => {
                                                              'name' => 'alt_timeout',
                                                              'offset' => '138',
                                                              'type' => '6784'
                                                            },
                                                    '3' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '12',
                                                             'type' => '2462'
                                                           },
                                                    '30' => {
                                                              'name' => 'reserved',
                                                              'offset' => '139',
                                                              'type' => '6772'
                                                            },
                                                    '4' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '16',
                                                             'type' => '2462'
                                                           },
                                                    '5' => {
                                                             'name' => 'qkey',
                                                             'offset' => '20',
                                                             'type' => '2462'
                                                           },
                                                    '6' => {
                                                             'name' => 'rq_psn',
                                                             'offset' => '24',
                                                             'type' => '2462'
                                                           },
                                                    '7' => {
                                                             'name' => 'sq_psn',
                                                             'offset' => '28',
                                                             'type' => '2462'
                                                           },
                                                    '8' => {
                                                             'name' => 'dest_qp_num',
                                                             'offset' => '32',
                                                             'type' => '2462'
                                                           },
                                                    '9' => {
                                                             'name' => 'qp_access_flags',
                                                             'offset' => '36',
                                                             'type' => '2462'
                                                           }
                                                  },
                                        'Name' => 'struct ib_uverbs_qp_attr',
                                        'Size' => '144',
                                        'Type' => 'Struct'
                                      },
                          '164192' => {
                                        'BaseType' => '164197',
                                        'Name' => 'struct ibv_sa_path_rec*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '164197' => {
                                        'Header' => 'sa.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dgid',
                                                             'offset' => '0',
                                                             'type' => '25335'
                                                           },
                                                    '1' => {
                                                             'name' => 'sgid',
                                                             'offset' => '16',
                                                             'type' => '25335'
                                                           },
                                                    '10' => {
                                                              'name' => 'pkey',
                                                              'offset' => '54',
                                                              'type' => '6795'
                                                            },
                                                    '11' => {
                                                              'name' => 'sl',
                                                              'offset' => '56',
                                                              'type' => '4911'
                                                            },
                                                    '12' => {
                                                              'name' => 'mtu_selector',
                                                              'offset' => '57',
                                                              'type' => '4911'
                                                            },
                                                    '13' => {
                                                              'name' => 'mtu',
                                                              'offset' => '58',
                                                              'type' => '4911'
                                                            },
                                                    '14' => {
                                                              'name' => 'rate_selector',
                                                              'offset' => '59',
                                                              'type' => '4911'
                                                            },
                                                    '15' => {
                                                              'name' => 'rate',
                                                              'offset' => '60',
                                                              'type' => '4911'
                                                            },
                                                    '16' => {
                                                              'name' => 'packet_life_time_selector',
                                                              'offset' => '61',
                                                              'type' => '4911'
                                                            },
                                                    '17' => {
                                                              'name' => 'packet_life_time',
                                                              'offset' => '62',
                                                              'type' => '4911'
                                                            },
                                                    '18' => {
                                                              'name' => 'preference',
                                                              'offset' => '63',
                                                              'type' => '4911'
                                                            },
                                                    '2' => {
                                                             'name' => 'dlid',
                                                             'offset' => '32',
                                                             'type' => '6795'
                                                           },
                                                    '3' => {
                                                             'name' => 'slid',
                                                             'offset' => '34',
                                                             'type' => '6795'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_traffic',
                                                             'offset' => '36',
                                                             'type' => '2830'
                                                           },
                                                    '5' => {
                                                             'name' => 'flow_label',
                                                             'offset' => '40',
                                                             'type' => '4882'
                                                           },
                                                    '6' => {
                                                             'name' => 'hop_limit',
                                                             'offset' => '44',
                                                             'type' => '4911'
                                                           },
                                                    '7' => {
                                                             'name' => 'traffic_class',
                                                             'offset' => '45',
                                                             'type' => '4911'
                                                           },
                                                    '8' => {
                                                             'name' => 'reversible',
                                                             'offset' => '48',
                                                             'type' => '2830'
                                                           },
                                                    '9' => {
                                                             'name' => 'numb_path',
                                                             'offset' => '52',
                                                             'type' => '4911'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_sa_path_rec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '164463' => {
                                        'BaseType' => '164468',
                                        'Name' => 'struct ib_user_path_rec*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '164468' => {
                                        'Header' => 'ib_user_sa.h',
                                        'Line' => '55',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dgid',
                                                             'offset' => '0',
                                                             'type' => '6772'
                                                           },
                                                    '1' => {
                                                             'name' => 'sgid',
                                                             'offset' => '16',
                                                             'type' => '6772'
                                                           },
                                                    '10' => {
                                                              'name' => 'traffic_class',
                                                              'offset' => '55',
                                                              'type' => '6784'
                                                            },
                                                    '11' => {
                                                              'name' => 'numb_path',
                                                              'offset' => '56',
                                                              'type' => '6784'
                                                            },
                                                    '12' => {
                                                              'name' => 'sl',
                                                              'offset' => '57',
                                                              'type' => '6784'
                                                            },
                                                    '13' => {
                                                              'name' => 'mtu_selector',
                                                              'offset' => '58',
                                                              'type' => '6784'
                                                            },
                                                    '14' => {
                                                              'name' => 'rate_selector',
                                                              'offset' => '59',
                                                              'type' => '6784'
                                                            },
                                                    '15' => {
                                                              'name' => 'rate',
                                                              'offset' => '60',
                                                              'type' => '6784'
                                                            },
                                                    '16' => {
                                                              'name' => 'packet_life_time_selector',
                                                              'offset' => '61',
                                                              'type' => '6784'
                                                            },
                                                    '17' => {
                                                              'name' => 'packet_life_time',
                                                              'offset' => '62',
                                                              'type' => '6784'
                                                            },
                                                    '18' => {
                                                              'name' => 'preference',
                                                              'offset' => '63',
                                                              'type' => '6784'
                                                            },
                                                    '2' => {
                                                             'name' => 'dlid',
                                                             'offset' => '32',
                                                             'type' => '6795'
                                                           },
                                                    '3' => {
                                                             'name' => 'slid',
                                                             'offset' => '34',
                                                             'type' => '6795'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_traffic',
                                                             'offset' => '36',
                                                             'type' => '2462'
                                                           },
                                                    '5' => {
                                                             'name' => 'flow_label',
                                                             'offset' => '40',
                                                             'type' => '4882'
                                                           },
                                                    '6' => {
                                                             'name' => 'reversible',
                                                             'offset' => '44',
                                                             'type' => '2462'
                                                           },
                                                    '7' => {
                                                             'name' => 'mtu',
                                                             'offset' => '48',
                                                             'type' => '2462'
                                                           },
                                                    '8' => {
                                                             'name' => 'pkey',
                                                             'offset' => '52',
                                                             'type' => '6795'
                                                           },
                                                    '9' => {
                                                             'name' => 'hop_limit',
                                                             'offset' => '54',
                                                             'type' => '6784'
                                                           }
                                                  },
                                        'Name' => 'struct ib_user_path_rec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '175658' => {
                                        'Header' => 'verbs.h',
                                        'Line' => '635',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'IBV_RATE_MAX',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'IBV_RATE_2_5_GBPS',
                                                             'value' => '2'
                                                           },
                                                    '10' => {
                                                              'name' => 'IBV_RATE_14_GBPS',
                                                              'value' => '11'
                                                            },
                                                    '11' => {
                                                              'name' => 'IBV_RATE_56_GBPS',
                                                              'value' => '12'
                                                            },
                                                    '12' => {
                                                              'name' => 'IBV_RATE_112_GBPS',
                                                              'value' => '13'
                                                            },
                                                    '13' => {
                                                              'name' => 'IBV_RATE_168_GBPS',
                                                              'value' => '14'
                                                            },
                                                    '14' => {
                                                              'name' => 'IBV_RATE_25_GBPS',
                                                              'value' => '15'
                                                            },
                                                    '15' => {
                                                              'name' => 'IBV_RATE_100_GBPS',
                                                              'value' => '16'
                                                            },
                                                    '16' => {
                                                              'name' => 'IBV_RATE_200_GBPS',
                                                              'value' => '17'
                                                            },
                                                    '17' => {
                                                              'name' => 'IBV_RATE_300_GBPS',
                                                              'value' => '18'
                                                            },
                                                    '2' => {
                                                             'name' => 'IBV_RATE_5_GBPS',
                                                             'value' => '5'
                                                           },
                                                    '3' => {
                                                             'name' => 'IBV_RATE_10_GBPS',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'IBV_RATE_20_GBPS',
                                                             'value' => '6'
                                                           },
                                                    '5' => {
                                                             'name' => 'IBV_RATE_30_GBPS',
                                                             'value' => '4'
                                                           },
                                                    '6' => {
                                                             'name' => 'IBV_RATE_40_GBPS',
                                                             'value' => '7'
                                                           },
                                                    '7' => {
                                                             'name' => 'IBV_RATE_60_GBPS',
                                                             'value' => '8'
                                                           },
                                                    '8' => {
                                                             'name' => 'IBV_RATE_80_GBPS',
                                                             'value' => '9'
                                                           },
                                                    '9' => {
                                                             'name' => 'IBV_RATE_120_GBPS',
                                                             'value' => '10'
                                                           }
                                                  },
                                        'Name' => 'enum ibv_rate',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '177163' => {
                                        'Header' => 'driver.h',
                                        'Line' => '83',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'IBV_GID_TYPE_IB_ROCE_V1',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'IBV_GID_TYPE_ROCE_V2',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum ibv_gid_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '182' => {
                                     'Header' => 'verbs.h',
                                     'Line' => '944',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_QPS_RESET',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_QPS_INIT',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_QPS_RTR',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_QPS_RTS',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_QPS_SQD',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_QPS_SQE',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_QPS_ERR',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_QPS_UNKNOWN',
                                                          'value' => '7'
                                                        }
                                               },
                                     'Name' => 'enum ibv_qp_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '189624' => {
                                        'BaseType' => '4893',
                                        'Name' => 'uint16_t*',
                                        'Size' => '2',
                                        'Type' => 'Pointer'
                                      },
                          '193630' => {
                                        'BaseType' => '193635',
                                        'Name' => 'struct ibv_grh*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '193635' => {
                                        'Header' => 'verbs.h',
                                        'Line' => '626',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'version_tclass_flow',
                                                             'offset' => '0',
                                                             'type' => '4882'
                                                           },
                                                    '1' => {
                                                             'name' => 'paylen',
                                                             'offset' => '4',
                                                             'type' => '6795'
                                                           },
                                                    '2' => {
                                                             'name' => 'next_hdr',
                                                             'offset' => '6',
                                                             'type' => '4911'
                                                           },
                                                    '3' => {
                                                             'name' => 'hop_limit',
                                                             'offset' => '7',
                                                             'type' => '4911'
                                                           },
                                                    '4' => {
                                                             'name' => 'sgid',
                                                             'offset' => '8',
                                                             'type' => '25335'
                                                           },
                                                    '5' => {
                                                             'name' => 'dgid',
                                                             'offset' => '24',
                                                             'type' => '25335'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_grh',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '196207' => {
                                        'BaseType' => '3688',
                                        'Name' => 'struct ibv_cq**',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '196263' => {
                                        'BaseType' => '177163',
                                        'Name' => 'enum ibv_gid_type*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '20651' => {
                                       'BaseType' => '20656',
                                       'Name' => 'struct verbs_context*',
                                       'Size' => '632',
                                       'Type' => 'Pointer'
                                     },
                          '20656' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1787',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'alloc_null_mr',
                                                            'offset' => '0',
                                                            'type' => '21181'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_counters',
                                                            'offset' => '8',
                                                            'type' => '21197'
                                                          },
                                                   '10' => {
                                                             'name' => 'create_flow_action_esp',
                                                             'offset' => '80',
                                                             'type' => '22056'
                                                           },
                                                   '11' => {
                                                             'name' => 'modify_qp_rate_limit',
                                                             'offset' => '88',
                                                             'type' => '22077'
                                                           },
                                                   '12' => {
                                                             'name' => 'alloc_parent_domain',
                                                             'offset' => '96',
                                                             'type' => '22165'
                                                           },
                                                   '13' => {
                                                             'name' => 'dealloc_td',
                                                             'offset' => '104',
                                                             'type' => '22268'
                                                           },
                                                   '14' => {
                                                             'name' => 'alloc_td',
                                                             'offset' => '112',
                                                             'type' => '22284'
                                                           },
                                                   '15' => {
                                                             'name' => 'modify_cq',
                                                             'offset' => '120',
                                                             'type' => '22333'
                                                           },
                                                   '16' => {
                                                             'name' => 'post_srq_ops',
                                                             'offset' => '128',
                                                             'type' => '22431'
                                                           },
                                                   '17' => {
                                                             'name' => 'destroy_rwq_ind_table',
                                                             'offset' => '136',
                                                             'type' => '22658'
                                                           },
                                                   '18' => {
                                                             'name' => 'create_rwq_ind_table',
                                                             'offset' => '144',
                                                             'type' => '22741'
                                                           },
                                                   '19' => {
                                                             'name' => 'destroy_wq',
                                                             'offset' => '152',
                                                             'type' => '23031'
                                                           },
                                                   '2' => {
                                                            'name' => 'attach_counters_point_flow',
                                                            'offset' => '16',
                                                            'type' => '21228'
                                                          },
                                                   '20' => {
                                                             'name' => 'modify_wq',
                                                             'offset' => '160',
                                                             'type' => '23047'
                                                           },
                                                   '21' => {
                                                             'name' => 'create_wq',
                                                             'offset' => '168',
                                                             'type' => '23148'
                                                           },
                                                   '22' => {
                                                             'name' => 'query_rt_values',
                                                             'offset' => '176',
                                                             'type' => '23288'
                                                           },
                                                   '23' => {
                                                             'name' => 'create_cq_ex',
                                                             'offset' => '184',
                                                             'type' => '23405'
                                                           },
                                                   '24' => {
                                                             'name' => 'priv',
                                                             'offset' => '192',
                                                             'type' => '24189'
                                                           },
                                                   '25' => {
                                                             'name' => 'query_device_ex',
                                                             'offset' => '200',
                                                             'type' => '27345'
                                                           },
                                                   '26' => {
                                                             'name' => 'ibv_destroy_flow',
                                                             'offset' => '208',
                                                             'type' => '26669'
                                                           },
                                                   '27' => {
                                                             'name' => 'ABI_placeholder2',
                                                             'offset' => '216',
                                                             'type' => '28393'
                                                           },
                                                   '28' => {
                                                             'name' => 'ibv_create_flow',
                                                             'offset' => '224',
                                                             'type' => '25658'
                                                           },
                                                   '29' => {
                                                             'name' => 'ABI_placeholder1',
                                                             'offset' => '232',
                                                             'type' => '28393'
                                                           },
                                                   '3' => {
                                                            'name' => 'create_counters',
                                                            'offset' => '24',
                                                            'type' => '21362'
                                                          },
                                                   '30' => {
                                                             'name' => 'open_qp',
                                                             'offset' => '240',
                                                             'type' => '27148'
                                                           },
                                                   '31' => {
                                                             'name' => 'create_qp_ex',
                                                             'offset' => '248',
                                                             'type' => '25987'
                                                           },
                                                   '32' => {
                                                             'name' => 'get_srq_num',
                                                             'offset' => '256',
                                                             'type' => '26717'
                                                           },
                                                   '33' => {
                                                             'name' => 'create_srq_ex',
                                                             'offset' => '264',
                                                             'type' => '26391'
                                                           },
                                                   '34' => {
                                                             'name' => 'open_xrcd',
                                                             'offset' => '272',
                                                             'type' => '27249'
                                                           },
                                                   '35' => {
                                                             'name' => 'close_xrcd',
                                                             'offset' => '280',
                                                             'type' => '25397'
                                                           },
                                                   '36' => {
                                                             'name' => '_ABI_placeholder3',
                                                             'offset' => '288',
                                                             'type' => '4438'
                                                           },
                                                   '37' => {
                                                             'name' => 'sz',
                                                             'offset' => '296',
                                                             'type' => '4617'
                                                           },
                                                   '38' => {
                                                             'name' => 'context',
                                                             'offset' => '304',
                                                             'type' => '2558'
                                                           },
                                                   '4' => {
                                                            'name' => 'destroy_counters',
                                                            'offset' => '32',
                                                            'type' => '21411'
                                                          },
                                                   '5' => {
                                                            'name' => 'reg_dm_mr',
                                                            'offset' => '40',
                                                            'type' => '21427'
                                                          },
                                                   '6' => {
                                                            'name' => 'alloc_dm',
                                                            'offset' => '48',
                                                            'type' => '21593'
                                                          },
                                                   '7' => {
                                                            'name' => 'free_dm',
                                                            'offset' => '56',
                                                            'type' => '21664'
                                                          },
                                                   '8' => {
                                                            'name' => 'modify_flow_action_esp',
                                                            'offset' => '64',
                                                            'type' => '21680'
                                                          },
                                                   '9' => {
                                                            'name' => 'destroy_flow_action',
                                                            'offset' => '72',
                                                            'type' => '22040'
                                                          }
                                                 },
                                       'Name' => 'struct verbs_context',
                                       'Size' => '632',
                                       'Type' => 'Struct'
                                     },
                          '21181' => {
                                       'Name' => 'struct ibv_mr*(*)(struct ibv_pd*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3426'
                                                           }
                                                  },
                                       'Return' => '4511',
                                       'Type' => 'FuncPtr'
                                     },
                          '21197' => {
                                       'Name' => 'int(*)(struct ibv_counters*, uint64_t*, uint32_t, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10034'
                                                           },
                                                    '1' => {
                                                             'type' => '11769'
                                                           },
                                                    '2' => {
                                                             'type' => '3467'
                                                           },
                                                    '3' => {
                                                             'type' => '3467'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21228' => {
                                       'Name' => 'int(*)(struct ibv_counters*, struct ibv_counter_attach_attr*, struct ibv_flow*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10034'
                                                           },
                                                    '1' => {
                                                             'type' => '21254'
                                                           },
                                                    '2' => {
                                                             'type' => '21308'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21254' => {
                                       'BaseType' => '21259',
                                       'Name' => 'struct ibv_counter_attach_attr*',
                                       'Size' => '12',
                                       'Type' => 'Pointer'
                                     },
                          '21259' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1767',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'counter_desc',
                                                            'offset' => '0',
                                                            'type' => '630'
                                                          },
                                                   '1' => {
                                                            'name' => 'index',
                                                            'offset' => '4',
                                                            'type' => '3467'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counter_attach_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '21308' => {
                                       'BaseType' => '21313',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '21313' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1605',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2553'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21362' => {
                                       'Name' => 'struct ibv_counters*(*)(struct ibv_context*, struct ibv_counters_init_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '21383'
                                                           }
                                                  },
                                       'Return' => '10034',
                                       'Type' => 'FuncPtr'
                                     },
                          '21383' => {
                                       'BaseType' => '21388',
                                       'Name' => 'struct ibv_counters_init_attr*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '21388' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1754',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters_init_attr',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21411' => {
                                       'Name' => 'int(*)(struct ibv_counters*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10034'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21427' => {
                                       'Name' => 'struct ibv_mr*(*)(struct ibv_pd*, struct ibv_dm*, uint64_t, size_t, unsigned int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3426'
                                                           },
                                                    '1' => {
                                                             'type' => '21463'
                                                           },
                                                    '2' => {
                                                             'type' => '4438'
                                                           },
                                                    '3' => {
                                                             'type' => '4617'
                                                           },
                                                    '4' => {
                                                             'type' => '2473'
                                                           }
                                                  },
                                       'Return' => '4511',
                                       'Type' => 'FuncPtr'
                                     },
                          '21463' => {
                                       'BaseType' => '21468',
                                       'Name' => 'struct ibv_dm*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '21468' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2553'
                                                          },
                                                   '1' => {
                                                            'name' => 'memcpy_to_dm',
                                                            'offset' => '8',
                                                            'type' => '21525'
                                                          },
                                                   '2' => {
                                                            'name' => 'memcpy_from_dm',
                                                            'offset' => '16',
                                                            'type' => '21562'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_dm',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '21525' => {
                                       'Name' => 'int(*)(struct ibv_dm*, uint64_t, void const*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '21463'
                                                           },
                                                    '1' => {
                                                             'type' => '4438'
                                                           },
                                                    '2' => {
                                                             'type' => '21556'
                                                           },
                                                    '3' => {
                                                             'type' => '4617'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21556' => {
                                       'BaseType' => '21561',
                                       'Name' => 'void const*',
                                       'Type' => 'Pointer'
                                     },
                          '21561' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '21562' => {
                                       'Name' => 'int(*)(void*, struct ibv_dm*, uint64_t, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2433'
                                                           },
                                                    '1' => {
                                                             'type' => '21463'
                                                           },
                                                    '2' => {
                                                             'type' => '4438'
                                                           },
                                                    '3' => {
                                                             'type' => '4617'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21593' => {
                                       'Name' => 'struct ibv_dm*(*)(struct ibv_context*, struct ibv_alloc_dm_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '21614'
                                                           }
                                                  },
                                       'Return' => '21463',
                                       'Type' => 'FuncPtr'
                                     },
                          '21614' => {
                                       'BaseType' => '21619',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '21619' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '137',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '4617'
                                                          },
                                                   '1' => {
                                                            'name' => 'log_align_req',
                                                            'offset' => '8',
                                                            'type' => '3467'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '12',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_dm_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21664' => {
                                       'Name' => 'int(*)(struct ibv_dm*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '21463'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21680' => {
                                       'Name' => 'int(*)(struct ibv_flow_action*, struct ibv_flow_action_esp_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '21701'
                                                           },
                                                    '1' => {
                                                             'type' => '21706'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '21701' => {
                                       'BaseType' => '9962',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21706' => {
                                       'BaseType' => '21711',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '21711' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1619',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '21851'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '652'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '12',
                                                            'type' => '4893'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '16',
                                                            'type' => '2433'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '24',
                                                            'type' => '667'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '28',
                                                            'type' => '4893'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '32',
                                                            'type' => '2433'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '40',
                                                            'type' => '21926'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '3467'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '52',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '21851' => {
                                       'BaseType' => '21856',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '21856' => {
                                       'Header' => 'ib_user_ioctl_verbs.h',
                                       'Line' => '147',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'spi',
                                                            'offset' => '0',
                                                            'type' => '2462'
                                                          },
                                                   '1' => {
                                                            'name' => 'seq',
                                                            'offset' => '4',
                                                            'type' => '2462'
                                                          },
                                                   '2' => {
                                                            'name' => 'tfc_pad',
                                                            'offset' => '8',
                                                            'type' => '2462'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '2462'
                                                          },
                                                   '4' => {
                                                            'name' => 'hard_limit_pkts',
                                                            'offset' => '16',
                                                            'type' => '6228'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_flow_action_esp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21926' => {
                                       'BaseType' => '21931',
                                       'Name' => 'struct ib_uverbs_flow_action_esp_encap*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '21931' => {
                                       'Header' => 'ib_user_ioctl_verbs.h',
                                       'Line' => '137',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '21947'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '8',
                                                            'type' => '21985'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '6569'
                                                          },
                                                   '3' => {
                                                            'name' => 'type',
                                                            'offset' => '18',
                                                            'type' => '6569'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_flow_action_esp_encap',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21947' => {
                                       'Header' => 'ib_user_ioctl_verbs.h',
                                       'Line' => '141',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'val_ptr',
                                                            'offset' => '0',
                                                            'type' => '2433'
                                                          },
                                                   '1' => {
                                                            'name' => 'val_ptr_data_u64',
                                                            'offset' => '0',
                                                            'type' => '6228'
                                                          }
                                                 },
                                       'Name' => 'ib_uverbs_flow_action_esp_encap::anon-union-ib_user_ioctl_verbs.h-141',
                                       'NameSpace' => 'ib_uverbs_flow_action_esp_encap',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '21985' => {
                                       'Header' => 'ib_user_ioctl_verbs.h',
                                       'Line' => '142',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_ptr',
                                                            'offset' => '0',
                                                            'type' => '21926'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_ptr_data_u64',
                                                            'offset' => '0',
                                                            'type' => '6228'
                                                          }
                                                 },
                                       'Name' => 'ib_uverbs_flow_action_esp_encap::anon-union-ib_user_ioctl_verbs.h-142',
                                       'NameSpace' => 'ib_uverbs_flow_action_esp_encap',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '22040' => {
                                       'Name' => 'int(*)(struct ibv_flow_action*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '21701'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '22056' => {
                                       'Name' => 'struct ibv_flow_action*(*)(struct ibv_context*, struct ibv_flow_action_esp_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '21706'
                                                           }
                                                  },
                                       'Return' => '21701',
                                       'Type' => 'FuncPtr'
                                     },
                          '22077' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_qp_rate_limit_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3504'
                                                           },
                                                    '1' => {
                                                             'type' => '22098'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '22098' => {
                                       'BaseType' => '22103',
                                       'Name' => 'struct ibv_qp_rate_limit_attr*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '22103' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '990',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_burst_sz',
                                                            'offset' => '4',
                                                            'type' => '3467'
                                                          },
                                                   '2' => {
                                                            'name' => 'typical_pkt_sz',
                                                            'offset' => '8',
                                                            'type' => '4893'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '12',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_rate_limit_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '22165' => {
                                       'Name' => 'struct ibv_pd*(*)(struct ibv_context*, struct ibv_parent_domain_init_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '22186'
                                                           }
                                                  },
                                       'Return' => '3426',
                                       'Type' => 'FuncPtr'
                                     },
                          '22186' => {
                                       'BaseType' => '22191',
                                       'Name' => 'struct ibv_parent_domain_init_attr*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22191' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1748',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pd',
                                                            'offset' => '0',
                                                            'type' => '3426'
                                                          },
                                                   '1' => {
                                                            'name' => 'td',
                                                            'offset' => '8',
                                                            'type' => '22240'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_parent_domain_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22240' => {
                                       'BaseType' => '22245',
                                       'Name' => 'struct ibv_td*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22245' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '567',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2553'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_td',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '22268' => {
                                       'Name' => 'int(*)(struct ibv_td*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22240'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '22284' => {
                                       'Name' => 'struct ibv_td*(*)(struct ibv_context*, struct ibv_td_init_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '22305'
                                                           }
                                                  },
                                       'Return' => '22240',
                                       'Type' => 'FuncPtr'
                                     },
                          '22305' => {
                                       'BaseType' => '22310',
                                       'Name' => 'struct ibv_td_init_attr*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '22310' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '563',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_td_init_attr',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '22333' => {
                                       'Name' => 'int(*)(struct ibv_cq*, struct ibv_modify_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3688'
                                                           },
                                                    '1' => {
                                                             'type' => '22354'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '22354' => {
                                       'BaseType' => '22359',
                                       'Name' => 'struct ibv_modify_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22359' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1254',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'moderate',
                                                            'offset' => '4',
                                                            'type' => '22395'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_cq_attr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '22395' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1249',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cq_count',
                                                            'offset' => '0',
                                                            'type' => '4893'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_period',
                                                            'offset' => '2',
                                                            'type' => '4893'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_moderate_cq',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '22431' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_ops_wr*, struct ibv_ops_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4278'
                                                           },
                                                    '1' => {
                                                             'type' => '22457'
                                                           },
                                                    '2' => {
                                                             'type' => '22653'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '22457' => {
                                       'BaseType' => '22462',
                                       'Name' => 'struct ibv_ops_wr*',
                                       'Size' => '72',
                                       'Type' => 'Pointer'
                                     },
                          '22462' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1093',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '4438'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '22457'
                                                          },
                                                   '2' => {
                                                            'name' => 'opcode',
                                                            'offset' => '16',
                                                            'type' => '688'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '20',
                                                            'type' => '2830'
                                                          },
                                                   '4' => {
                                                            'name' => 'tm',
                                                            'offset' => '24',
                                                            'type' => '22536'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ops_wr',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '22536' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1098',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unexpected_cnt',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '4',
                                                            'type' => '3467'
                                                          },
                                                   '2' => {
                                                            'name' => 'add',
                                                            'offset' => '8',
                                                            'type' => '22580'
                                                          }
                                                 },
                                       'Name' => 'ibv_ops_wr::anon-struct-verbs.h-1098',
                                       'NameSpace' => 'ibv_ops_wr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '22580' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1101',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'recv_wr_id',
                                                            'offset' => '0',
                                                            'type' => '4438'
                                                          },
                                                   '1' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '8',
                                                            'type' => '5043'
                                                          },
                                                   '2' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '16',
                                                            'type' => '2830'
                                                          },
                                                   '3' => {
                                                            'name' => 'tag',
                                                            'offset' => '24',
                                                            'type' => '4438'
                                                          },
                                                   '4' => {
                                                            'name' => 'mask',
                                                            'offset' => '32',
                                                            'type' => '4438'
                                                          }
                                                 },
                                       'Name' => 'ibv_ops_wr::anon-struct-verbs.h-1098::anon-struct-verbs.h-1101',
                                       'NameSpace' => 'ibv_ops_wr::anon-struct-verbs.h-1098',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '22653' => {
                                       'BaseType' => '22457',
                                       'Name' => 'struct ibv_ops_wr**',
                                       'Size' => '72',
                                       'Type' => 'Pointer'
                                     },
                          '22658' => {
                                       'Name' => 'int(*)(struct ibv_rwq_ind_table*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22674'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '22674' => {
                                       'BaseType' => '22679',
                                       'Name' => 'struct ibv_rwq_ind_table*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22679' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '801',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2553'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '2830'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '2830'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22741' => {
                                       'Name' => 'struct ibv_rwq_ind_table*(*)(struct ibv_context*, struct ibv_rwq_ind_table_init_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '22762'
                                                           }
                                                  },
                                       'Return' => '22674',
                                       'Type' => 'FuncPtr'
                                     },
                          '22762' => {
                                       'BaseType' => '22767',
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22767' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '815',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_ind_tbl_size',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl',
                                                            'offset' => '8',
                                                            'type' => '22816'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22816' => {
                                       'BaseType' => '22821',
                                       'Name' => 'struct ibv_wq**',
                                       'Size' => '152',
                                       'Type' => 'Pointer'
                                     },
                          '22821' => {
                                       'BaseType' => '22826',
                                       'Name' => 'struct ibv_wq*',
                                       'Size' => '152',
                                       'Type' => 'Pointer'
                                     },
                          '22826' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1139',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2553'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_context',
                                                            'offset' => '8',
                                                            'type' => '2433'
                                                          },
                                                   '10' => {
                                                             'name' => 'cond',
                                                             'offset' => '96',
                                                             'type' => '4106'
                                                           },
                                                   '11' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '144',
                                                             'type' => '3467'
                                                           },
                                                   '12' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '148',
                                                             'type' => '3467'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '3426'
                                                          },
                                                   '3' => {
                                                            'name' => 'cq',
                                                            'offset' => '24',
                                                            'type' => '3688'
                                                          },
                                                   '4' => {
                                                            'name' => 'wq_num',
                                                            'offset' => '32',
                                                            'type' => '3467'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle',
                                                            'offset' => '36',
                                                            'type' => '3467'
                                                          },
                                                   '6' => {
                                                            'name' => 'state',
                                                            'offset' => '40',
                                                            'type' => '716'
                                                          },
                                                   '7' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '44',
                                                            'type' => '750'
                                                          },
                                                   '8' => {
                                                            'name' => 'post_recv',
                                                            'offset' => '48',
                                                            'type' => '23005'
                                                          },
                                                   '9' => {
                                                            'name' => 'mutex',
                                                            'offset' => '56',
                                                            'type' => '3874'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '23005' => {
                                       'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22821'
                                                           },
                                                    '1' => {
                                                             'type' => '4976'
                                                           },
                                                    '2' => {
                                                             'type' => '5097'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '23031' => {
                                       'Name' => 'int(*)(struct ibv_wq*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22821'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '23047' => {
                                       'Name' => 'int(*)(struct ibv_wq*, struct ibv_wq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22821'
                                                           },
                                                    '1' => {
                                                             'type' => '23068'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '23068' => {
                                       'BaseType' => '23073',
                                       'Name' => 'struct ibv_wq_attr*',
                                       'Size' => '20',
                                       'Type' => 'Pointer'
                                     },
                          '23073' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '783',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '4',
                                                            'type' => '716'
                                                          },
                                                   '2' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '8',
                                                            'type' => '716'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '3467'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '16',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq_attr',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '23148' => {
                                       'Name' => 'struct ibv_wq*(*)(struct ibv_context*, struct ibv_wq_init_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '23169'
                                                           }
                                                  },
                                       'Return' => '22821',
                                       'Type' => 'FuncPtr'
                                     },
                          '23169' => {
                                       'BaseType' => '23174',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '23174' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '758',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wq_context',
                                                            'offset' => '0',
                                                            'type' => '2433'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '8',
                                                            'type' => '750'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '12',
                                                            'type' => '3467'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '16',
                                                            'type' => '3467'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd',
                                                            'offset' => '24',
                                                            'type' => '3426'
                                                          },
                                                   '5' => {
                                                            'name' => 'cq',
                                                            'offset' => '32',
                                                            'type' => '3688'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '3467'
                                                          },
                                                   '7' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '44',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq_init_attr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '23288' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_values_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '23309'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '23309' => {
                                       'BaseType' => '23314',
                                       'Name' => 'struct ibv_values_ex*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '23314' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1782',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          },
                                                   '1' => {
                                                            'name' => 'raw_clock',
                                                            'offset' => '8',
                                                            'type' => '23350'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_values_ex',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '23350' => {
                                       'Header' => 'time.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '23383'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '8',
                                                            'type' => '23394'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23383' => {
                                       'BaseType' => '4099',
                                       'Header' => 'types.h',
                                       'Line' => '139',
                                       'Name' => '__time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '23394' => {
                                       'BaseType' => '4099',
                                       'Header' => 'types.h',
                                       'Line' => '175',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '23405' => {
                                       'Name' => 'struct ibv_cq_ex*(*)(struct ibv_context*, struct ibv_cq_init_attr_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2553'
                                                           },
                                                    '1' => {
                                                             'type' => '24083'
                                                           }
                                                  },
                                       'Return' => '23426',
                                       'Type' => 'FuncPtr'
                                     },
                          '23426' => {
                                       'BaseType' => '23431',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '288',
                                       'Type' => 'Pointer'
                                     },
                          '23431' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1202',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2553'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '3820'
                                                          },
                                                   '10' => {
                                                             'name' => 'status',
                                                             'offset' => '132',
                                                             'type' => '293'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '136',
                                                             'type' => '4438'
                                                           },
                                                   '12' => {
                                                             'name' => 'start_poll',
                                                             'offset' => '144',
                                                             'type' => '23836'
                                                           },
                                                   '13' => {
                                                             'name' => 'next_poll',
                                                             'offset' => '152',
                                                             'type' => '23885'
                                                           },
                                                   '14' => {
                                                             'name' => 'end_poll',
                                                             'offset' => '160',
                                                             'type' => '23901'
                                                           },
                                                   '15' => {
                                                             'name' => 'read_opcode',
                                                             'offset' => '168',
                                                             'type' => '23913'
                                                           },
                                                   '16' => {
                                                             'name' => 'read_vendor_err',
                                                             'offset' => '176',
                                                             'type' => '23929'
                                                           },
                                                   '17' => {
                                                             'name' => 'read_byte_len',
                                                             'offset' => '184',
                                                             'type' => '23929'
                                                           },
                                                   '18' => {
                                                             'name' => 'read_imm_data',
                                                             'offset' => '192',
                                                             'type' => '23945'
                                                           },
                                                   '19' => {
                                                             'name' => 'read_qp_num',
                                                             'offset' => '200',
                                                             'type' => '23929'
                                                           },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '16',
                                                            'type' => '2433'
                                                          },
                                                   '20' => {
                                                             'name' => 'read_src_qp',
                                                             'offset' => '208',
                                                             'type' => '23929'
                                                           },
                                                   '21' => {
                                                             'name' => 'read_wc_flags',
                                                             'offset' => '216',
                                                             'type' => '23961'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_slid',
                                                             'offset' => '224',
                                                             'type' => '23929'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_sl',
                                                             'offset' => '232',
                                                             'type' => '23977'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_dlid_path_bits',
                                                             'offset' => '240',
                                                             'type' => '23977'
                                                           },
                                                   '25' => {
                                                             'name' => 'read_completion_ts',
                                                             'offset' => '248',
                                                             'type' => '23993'
                                                           },
                                                   '26' => {
                                                             'name' => 'read_cvlan',
                                                             'offset' => '256',
                                                             'type' => '24009'
                                                           },
                                                   '27' => {
                                                             'name' => 'read_flow_tag',
                                                             'offset' => '264',
                                                             'type' => '23929'
                                                           },
                                                   '28' => {
                                                             'name' => 'read_tm_info',
                                                             'offset' => '272',
                                                             'type' => '24025'
                                                           },
                                                   '29' => {
                                                             'name' => 'read_completion_wallclock_ns',
                                                             'offset' => '280',
                                                             'type' => '23993'
                                                           },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '3467'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '28',
                                                            'type' => '2830'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '3874'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '4106'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '120',
                                                            'type' => '3467'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '124',
                                                            'type' => '3467'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '128',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_ex',
                                       'Size' => '288',
                                       'Type' => 'Struct'
                                     },
                          '23836' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           },
                                                    '1' => {
                                                             'type' => '23857'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '23857' => {
                                       'BaseType' => '23862',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23862' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1193',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '3467'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_poll_cq_attr',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '2387' => {
                                      'Header' => 'driver.h',
                                      'Line' => '109',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_FLOW_ACTION_UNSPECIFIED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_FLOW_ACTION_ESP',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum ibv_flow_action_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '23885' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '2830',
                                       'Type' => 'FuncPtr'
                                     },
                          '23901' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Type' => 'FuncPtr'
                                     },
                          '23913' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '447',
                                       'Type' => 'FuncPtr'
                                     },
                          '23929' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '3467',
                                       'Type' => 'FuncPtr'
                                     },
                          '23945' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '4882',
                                       'Type' => 'FuncPtr'
                                     },
                          '23961' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '2473',
                                       'Type' => 'FuncPtr'
                                     },
                          '23977' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '23426'
                                                           }
                                                  },
                                       'Return' => '4911',
