$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.12',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'Compiler' => 'clang version 7.0.0 (tags/RELEASE_700/final)',
          'Headers' => {
                         'bitmap.h' => 1,
                         'cmd_ioctl.h' => 1,
                         'driver.h' => 1,
                         'ib_user_ioctl_verbs.h' => 1,
                         'ib_user_sa.h' => 1,
                         'ib_user_verbs.h' => 1,
                         'ibverbs.h' => 1,
                         'int-ll64.h' => 1,
                         'kern-abi.h' => 1,
                         'list.h' => 1,
                         'pthreadtypes.h' => 1,
                         'rdma_user_ioctl_cmds.h' => 1,
                         'sa.h' => 1,
                         'stdatomic.h' => 1,
                         'stddef.h' => 1,
                         'stdint.h' => 1,
                         'time.h' => 1,
                         'types.h' => 1,
                         'verbs.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libibverbs.so.1.5.23.0',
          'LibraryVersion' => 'ibverbs',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libnl-3.so.200' => 1,
                        'libnl-route-3.so.200' => 1,
                        'libpthread.so.0' => 1

                                                       'ibv_query_device@IBVERBS_1.0' => 1,
                                                       'ibv_query_gid@@IBVERBS_1.1' => 1,
                                                       'ibv_query_gid@IBVERBS_1.0' => 1,
                                                       'ibv_query_gid_type@@IBVERBS_PRIVATE_22' => 1,
                                                       'ibv_query_pkey@@IBVERBS_1.1' => 1,
                                                       'ibv_query_pkey@IBVERBS_1.0' => 1,
                                                       'ibv_query_port@@IBVERBS_1.1' => 1,
                                                       'ibv_query_port@IBVERBS_1.0' => 1,
                                                       'ibv_query_qp@@IBVERBS_1.1' => 1,
                                                       'ibv_query_qp@IBVERBS_1.0' => 1,
                                                       'ibv_query_srq@@IBVERBS_1.1' => 1,
                                                       'ibv_query_srq@IBVERBS_1.0' => 1,
                                                       'ibv_rate_to_mbps@@IBVERBS_1.1' => 1,
                                                       'ibv_rate_to_mult@@IBVERBS_1.0' => 1,
                                                       'ibv_read_sysfs_file@@IBVERBS_1.0' => 1,
                                                       'ibv_reg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_reg_mr@IBVERBS_1.0' => 1,
                                                       'ibv_register_driver@IBVERBS_1.1' => 1,
                                                       'ibv_rereg_mr@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@@IBVERBS_1.1' => 1,
                                                       'ibv_resize_cq@IBVERBS_1.0' => 1,
                                                       'ibv_resolve_eth_l2_from_gid@@IBVERBS_1.1' => 1,
                                                       'ibv_wc_status_str@@IBVERBS_1.1' => 1,
                                                       'mbps_to_ibv_rate@@IBVERBS_1.1' => 1,
                                                       'mult_to_ibv_rate@@IBVERBS_1.0' => 1,
                                                       'verbs_allow_disassociate_destroy@@IBVERBS_PRIVATE_22' => -1,
                                                       'verbs_init_cq@@IBVERBS_PRIVATE_22' => 1,
                                                       'verbs_open_device@@IBVERBS_PRIVATE_22' => 1,
                                                       'verbs_register_driver_22@@IBVERBS_PRIVATE_22' => 1,
                                                       'verbs_set_ops@@IBVERBS_PRIVATE_22' => 1,
                                                       'verbs_uninit_context@@IBVERBS_PRIVATE_22' => 1
                                                     }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10095' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1070',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '6466'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '8369'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1070',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10140' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1074',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '10158'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '10203'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '10274'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1074',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '10158' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1075',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '9340'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '8369'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1075',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10203' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1079',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '9340'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '9340'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '16',
                                                            'type' => '9340'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '24',
                                                            'type' => '8369'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1079',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10274' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1085',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '10503'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '8369'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '12',
                                                            'type' => '8369'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1085',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10333' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1091',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '10351'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1091',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10351' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1092',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '8369'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1092',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10380' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1096',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '10398'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '10456'
                                                          }
                                                 },
                                       'Name' => 'ibv_send_wr::anon-union-verbs.h-1096',
                                       'NameSpace' => 'ibv_send_wr',
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10398' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1097',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '8248'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '8369'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '9351'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1097',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10456' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1102',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '6648'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '9784'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '10',
                                                            'type' => '9784'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-verbs.h-1102',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '104566' => {
                                        'BaseType' => '23662',
                                        'Name' => 'struct verbs_flow_action*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '10503' => {
                                       'BaseType' => '10508',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '10508' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1402',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '7422'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '8328'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '8369'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10557' => {
                                       'BaseType' => '9994',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '128',
                                       'Type' => 'Pointer'
                                     },
                          '10562' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '8406'
                                                           },
                                                    '1' => {
                                                             'type' => '9842'
                                                           },
                                                    '2' => {
                                                             'type' => '9963'
                                                           }
                                                  },
                                       'Return' => '125',
                                       'Type' => 'FuncPtr'
                                     },
                          '10588' => {
                                       'BaseType' => '7723',
                                       'Name' => 'char*',
                                       'Size' => '1',
                                       'Type' => 'Pointer'
                                     },
                          '10593' => {
                                       'BaseType' => '7399',
                                       'Name' => 'struct ibv_xrcd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10603' => {
                                       'BaseType' => '10608',
                                       'Name' => 'struct ibv_create_xsrq*',
                                       'Size' => '56',
                                       'Type' => 'Pointer'
                                     },
                          '10608' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '10636'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_xsrq',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10636' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '10648'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '10802'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_xsrq::anon-union-kern-abi.h-184',
                                       'NameSpace' => 'ibv_create_xsrq',
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10648' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '10' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '48',
                                                             'type' => '2708'
                                                           },
                                                   '2' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_num_tags',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'xrcd_handle',
                                                            'offset' => '40',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '44',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-184',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10802' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1170',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '10' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '48',
                                                             'type' => '2708'
                                                           },
                                                   '2' => {
                                                            'name' => 'srq_type',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_num_tags',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'xrcd_handle',
                                                            'offset' => '40',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '44',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_xsrq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1089' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '1414',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum ibv_flow_attr_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '11005' => {
                                       'BaseType' => '11010',
                                       'Name' => 'struct ibv_modify_srq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '11010' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '11038'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11038' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '11050'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '11130'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_srq::anon-union-kern-abi.h-195',
                                       'NameSpace' => 'ibv_modify_srq',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '11050' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-195',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11130' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1192',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_modify_srq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11232' => {
                                       'BaseType' => '11237',
                                       'Name' => 'struct ibv_query_srq*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '11237' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '11265'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11265' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '11277'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '11346'
                                                          }
                                                 },
                                       'Name' => 'ibv_query_srq::anon-union-kern-abi.h-205',
                                       'NameSpace' => 'ibv_query_srq',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '1127' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '744',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_SRQT_BASIC',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_SRQT_XRC',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_SRQT_TM',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_srq_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '11277' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-205',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11346' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1200',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_query_srq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1159' => {
                                      'BaseType' => '201',
                                      'Header' => 'driver.h',
                                      'Line' => '88',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MR_TYPE_MR',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MR_TYPE_NULL_MR',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mr_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '11760' => {
                                       'BaseType' => '11765',
                                       'Name' => 'struct ibv_create_qp_ex*',
                                       'Size' => '88',
                                       'Type' => 'Pointer'
                                     },
                          '11765' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '213',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3680'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '11793'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp_ex',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11793' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '213',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '11805'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '12041'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_qp_ex::anon-union-kern-abi.h-213',
                                       'NameSpace' => 'ibv_create_qp_ex',
                                       'Size' => '64',
                                       'Type' => 'Union'
                                     },
                          '11805' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '213',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '10' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '44',
                                                             'type' => '3536'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '45',
                                                             'type' => '3536'
                                                           },
                                                   '12' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '46',
                                                             'type' => '3536'
                                                           },
                                                   '13' => {
                                                             'name' => 'reserved',
                                                             'offset' => '47',
                                                             'type' => '3536'
                                                           },
                                                   '14' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '48',
                                                             'type' => '2661'
                                                           },
                                                   '15' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '52',
                                                             'type' => '2661'
                                                           },
                                                   '16' => {
                                                             'name' => 'rwq_ind_tbl_handle',
                                                             'offset' => '56',
                                                             'type' => '2661'
                                                           },
                                                   '17' => {
                                                             'name' => 'source_qpn',
                                                             'offset' => '60',
                                                             'type' => '2661'
                                                           },
                                                   '2' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '40',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-213',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1184' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '990',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MIG_MIGRATED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MIG_REARM',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_MIG_ARMED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mig_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '12041' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '602',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '10' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '44',
                                                             'type' => '3536'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '45',
                                                             'type' => '3536'
                                                           },
                                                   '12' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '46',
                                                             'type' => '3536'
                                                           },
                                                   '13' => {
                                                             'name' => 'reserved',
                                                             'offset' => '47',
                                                             'type' => '3536'
                                                           },
                                                   '14' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '48',
                                                             'type' => '2661'
                                                           },
                                                   '15' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '52',
                                                             'type' => '2661'
                                                           },
                                                   '16' => {
                                                             'name' => 'rwq_ind_tbl_handle',
                                                             'offset' => '56',
                                                             'type' => '2661'
                                                           },
                                                   '17' => {
                                                             'name' => 'source_qpn',
                                                             'offset' => '60',
                                                             'type' => '2661'
                                                           },
                                                   '2' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '40',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_qp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1216' => {
                                      'BaseType' => '201',
                                      'Header' => 'verbs.h',
                                      'Line' => '131',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '12312' => {
                                       'BaseType' => '12317',
                                       'Name' => 'struct ib_uverbs_ex_create_qp_resp*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '12317' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '12366'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'response_length',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_qp_resp',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '12366' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '634',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'qpn',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '4542'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_qp_resp',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '125' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12519' => {
                                       'BaseType' => '12524',
                                       'Name' => 'struct ibv_create_qp*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '12524' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '12552'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_qp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12552' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '12564'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '12778'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_qp::anon-union-kern-abi.h-182',
                                       'NameSpace' => 'ibv_create_qp',
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '12564' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '182',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '10' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '48',
                                                             'type' => '2661'
                                                           },
                                                   '11' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '52',
                                                             'type' => '3536'
                                                           },
                                                   '12' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '53',
                                                             'type' => '3536'
                                                           },
                                                   '13' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '54',
                                                             'type' => '3536'
                                                           },
                                                   '14' => {
                                                             'name' => 'reserved',
                                                             'offset' => '55',
                                                             'type' => '3536'
                                                           },
                                                   '15' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '2708'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '40',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '44',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-182',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '12778' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '561',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '10' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '48',
                                                             'type' => '2661'
                                                           },
                                                   '11' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '52',
                                                             'type' => '3536'
                                                           },
                                                   '12' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '53',
                                                             'type' => '3536'
                                                           },
                                                   '13' => {
                                                             'name' => 'is_srq',
                                                             'offset' => '54',
                                                             'type' => '3536'
                                                           },
                                                   '14' => {
                                                             'name' => 'reserved',
                                                             'offset' => '55',
                                                             'type' => '3536'
                                                           },
                                                   '15' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '56',
                                                             'type' => '2708'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq_handle',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '40',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '44',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_qp',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '13025' => {
                                       'BaseType' => '12366',
                                       'Name' => 'struct ib_uverbs_create_qp_resp*',
                                       'Size' => '32',
                                       'Type' => 'Pointer'
                                     },
                          '132' => {
                                     'BaseType' => '125',
                                     'Header' => 'verbs.h',
                                     'Line' => '89',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                          'value' => '-1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_TRANSPORT_IB',
                                                          'value' => '0'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_TRANSPORT_IWARP',
                                                          'value' => '1'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC',
                                                          'value' => '2'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum ibv_transport_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '13203' => {
                                       'BaseType' => '13208',
                                       'Name' => 'struct ibv_open_qp*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '13208' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '13236'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_qp',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '13236' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '13248'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '13366'
                                                          }
                                                 },
                                       'Name' => 'ibv_open_qp::anon-union-kern-abi.h-196',
                                       'NameSpace' => 'ibv_open_qp',
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '13248' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'qpn',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '3536'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '25',
                                                            'type' => '3554'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-196',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '13366' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '623',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'qpn',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '3536'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '25',
                                                            'type' => '3554'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_open_qp',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '13517' => {
                                       'BaseType' => '13522',
                                       'Name' => 'struct ibv_query_qp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '13522' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '13550'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_qp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13550' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '13562'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '13631'
                                                          }
                                                 },
                                       'Name' => 'ibv_query_qp::anon-union-kern-abi.h-204',
                                       'NameSpace' => 'ibv_query_qp',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '13562' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-204',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13631' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '671',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '2690'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '2708'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_query_qp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14140' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '656',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '3554'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '10' => {
                                                             'name' => 'is_global',
                                                             'offset' => '30',
                                                             'type' => '3536'
                                                           },
                                                   '11' => {
                                                             'name' => 'port_num',
                                                             'offset' => '31',
                                                             'type' => '3536'
                                                           },
                                                   '2' => {
                                                            'name' => 'dlid',
                                                            'offset' => '20',
                                                            'type' => '2672'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '22',
                                                            'type' => '2672'
                                                          },
                                                   '4' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '24',
                                                            'type' => '3536'
                                                          },
                                                   '5' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '25',
                                                            'type' => '3536'
                                                          },
                                                   '6' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '26',
                                                            'type' => '3536'
                                                          },
                                                   '7' => {
                                                            'name' => 'sl',
                                                            'offset' => '27',
                                                            'type' => '3536'
                                                          },
                                                   '8' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '28',
                                                            'type' => '3536'
                                                          },
                                                   '9' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '29',
                                                            'type' => '3536'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_qp_dest',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '14356' => {
                                       'BaseType' => '14361',
                                       'Name' => 'struct ibv_modify_qp*',
                                       'Size' => '120',
                                       'Type' => 'Pointer'
                                     },
                          '14361' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '2616'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '14389'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '14389' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '14401'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '14757'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_qp::anon-union-kern-abi.h-194',
                                       'NameSpace' => 'ibv_modify_qp',
                                       'Size' => '112',
                                       'Type' => 'Union'
                                     },
                          '14401' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dest',
                                                            'offset' => '0',
                                                            'type' => '14140'
                                                          },
                                                   '1' => {
                                                            'name' => 'alt_dest',
                                                            'offset' => '32',
                                                            'type' => '14140'
                                                          },
                                                   '10' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '94',
                                                             'type' => '2672'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '96',
                                                             'type' => '3536'
                                                           },
                                                   '12' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '97',
                                                             'type' => '3536'
                                                           },
                                                   '13' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '98',
                                                             'type' => '3536'
                                                           },
                                                   '14' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '99',
                                                             'type' => '3536'
                                                           },
                                                   '15' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '100',
                                                             'type' => '3536'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '101',
                                                             'type' => '3536'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '102',
                                                             'type' => '3536'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '103',
                                                             'type' => '3536'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '104',
                                                             'type' => '3536'
                                                           },
                                                   '2' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '64',
                                                            'type' => '2661'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '105',
                                                             'type' => '3536'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '106',
                                                             'type' => '3536'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '107',
                                                             'type' => '3536'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '108',
                                                             'type' => '3536'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '109',
                                                             'type' => '3536'
                                                           },
                                                   '25' => {
                                                             'name' => 'reserved',
                                                             'offset' => '110',
                                                             'type' => '3554'
                                                           },
                                                   '26' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '112',
                                                             'type' => '2708'
                                                           },
                                                   '3' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '68',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '72',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '76',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '80',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '84',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '88',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '92',
                                                            'type' => '2672'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-194',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '14757' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '712',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dest',
                                                            'offset' => '0',
                                                            'type' => '14140'
                                                          },
                                                   '1' => {
                                                            'name' => 'alt_dest',
                                                            'offset' => '32',
                                                            'type' => '14140'
                                                          },
                                                   '10' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '94',
                                                             'type' => '2672'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '96',
                                                             'type' => '3536'
                                                           },
                                                   '12' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '97',
                                                             'type' => '3536'
                                                           },
                                                   '13' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '98',
                                                             'type' => '3536'
                                                           },
                                                   '14' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '99',
                                                             'type' => '3536'
                                                           },
                                                   '15' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '100',
                                                             'type' => '3536'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '101',
                                                             'type' => '3536'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '102',
                                                             'type' => '3536'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '103',
                                                             'type' => '3536'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '104',
                                                             'type' => '3536'
                                                           },
                                                   '2' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '64',
                                                            'type' => '2661'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '105',
                                                             'type' => '3536'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '106',
                                                             'type' => '3536'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '107',
                                                             'type' => '3536'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '108',
                                                             'type' => '3536'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '109',
                                                             'type' => '3536'
                                                           },
                                                   '25' => {
                                                             'name' => 'reserved',
                                                             'offset' => '110',
                                                             'type' => '3554'
                                                           },
                                                   '26' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '112',
                                                             'type' => '2708'
                                                           },
                                                   '3' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '68',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '72',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '76',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '80',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '84',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '88',
                                                            'type' => '2661'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '92',
                                                            'type' => '2672'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_modify_qp',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '149082' => {
                                        'BaseType' => '149087',
                                        'Name' => 'struct ibv_cq_1_0*',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '149087' => {
                                        'Line' => '137',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '149204'
                                                           },
                                                    '1' => {
                                                             'name' => 'cq_context',
                                                             'offset' => '8',
                                                             'type' => '6648'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '8369'
                                                           },
                                                    '3' => {
                                                             'name' => 'cqe',
                                                             'offset' => '20',
                                                             'type' => '125'
                                                           },
                                                    '4' => {
                                                             'name' => 'mutex',
                                                             'offset' => '24',
                                                             'type' => '8776'
                                                           },
                                                    '5' => {
                                                             'name' => 'cond',
                                                             'offset' => '64',
                                                             'type' => '9008'
                                                           },
                                                    '6' => {
                                                             'name' => 'comp_events_completed',
                                                             'offset' => '112',
                                                             'type' => '8369'
                                                           },
                                                    '7' => {
                                                             'name' => 'async_events_completed',
                                                             'offset' => '116',
                                                             'type' => '8369'
                                                           },
                                                    '8' => {
                                                             'name' => 'real_cq',
                                                             'offset' => '120',
                                                             'type' => '8590'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_cq_1_0',
                                        'Size' => '128',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '149204' => {
                                        'BaseType' => '149209',
                                        'Name' => 'struct ibv_context_1_0*',
                                        'Size' => '248',
                                        'Type' => 'Pointer'
                                      },
                          '149209' => {
                                        'Line' => '218',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'device',
                                                             'offset' => '0',
                                                             'type' => '149290'
                                                           },
                                                    '1' => {
                                                             'name' => 'ops',
                                                             'offset' => '8',
                                                             'type' => '152575'
                                                           },
                                                    '2' => {
                                                             'name' => 'cmd_fd',
                                                             'offset' => '224',
                                                             'type' => '125'
                                                           },
                                                    '3' => {
                                                             'name' => 'async_fd',
                                                             'offset' => '228',
                                                             'type' => '125'
                                                           },
                                                    '4' => {
                                                             'name' => 'num_comp_vectors',
                                                             'offset' => '232',
                                                             'type' => '125'
                                                           },
                                                    '5' => {
                                                             'name' => 'real_context',
                                                             'offset' => '240',
                                                             'type' => '7422'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_context_1_0',
                                        'Size' => '248',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '149290' => {
                                        'BaseType' => '149295',
                                        'Name' => 'struct ibv_device_1_0*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '149295' => {
                                        'Line' => '159',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'obsolete_sysfs_dev',
                                                             'offset' => '0',
                                                             'type' => '6648'
                                                           },
                                                    '1' => {
                                                             'name' => 'obsolete_sysfs_ibdev',
                                                             'offset' => '8',
                                                             'type' => '6648'
                                                           },
                                                    '2' => {
                                                             'name' => 'real_device',
                                                             'offset' => '16',
                                                             'type' => '7534'
                                                           },
                                                    '3' => {
                                                             'name' => '_ops',
                                                             'offset' => '24',
                                                             'type' => '7642'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_device_1_0',
                                        'Size' => '40',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '15145' => {
                                       'BaseType' => '15150',
                                       'Name' => 'struct ibv_modify_qp_ex*',
                                       'Size' => '144',
                                       'Type' => 'Pointer'
                                     },
                          '15150' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3680'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '15178'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp_ex',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '15178' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '15190'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '15245'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_qp_ex::anon-union-kern-abi.h-220',
                                       'NameSpace' => 'ibv_modify_qp_ex',
                                       'Size' => '120',
                                       'Type' => 'Union'
                                     },
                          '15190' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '14757'
                                                          },
                                                   '1' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '112',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '116',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-220',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '15245' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '742',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'base',
                                                            'offset' => '0',
                                                            'type' => '14757'
                                                          },
                                                   '1' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '112',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '116',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_qp',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '152575' => {
                                        'Line' => '166',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'query_device',
                                                             'offset' => '0',
                                                             'type' => '38248'
                                                           },
                                                    '1' => {
                                                             'name' => 'query_port',
                                                             'offset' => '8',
                                                             'type' => '38958'
                                                           },
                                                    '10' => {
                                                              'name' => 'resize_cq',
                                                              'offset' => '80',
                                                              'type' => '9795'
                                                            },
                                                    '11' => {
                                                              'name' => 'destroy_cq',
                                                              'offset' => '88',
                                                              'type' => '37572'
                                                            },
                                                    '12' => {
                                                              'name' => 'create_srq',
                                                              'offset' => '96',
                                                              'type' => '37199'
                                                            },
                                                    '13' => {
                                                              'name' => 'modify_srq',
                                                              'offset' => '104',
                                                              'type' => '38041'
                                                            },
                                                    '14' => {
                                                              'name' => 'query_srq',
                                                              'offset' => '112',
                                                              'type' => '39015'
                                                            },
                                                    '15' => {
                                                              'name' => 'destroy_srq',
                                                              'offset' => '120',
                                                              'type' => '37620'
                                                            },
                                                    '16' => {
                                                              'name' => 'post_srq_recv',
                                                              'offset' => '128',
                                                              'type' => '154136'
                                                            },
                                                    '17' => {
                                                              'name' => 'create_qp',
                                                              'offset' => '136',
                                                              'type' => '36699'
                                                            },
                                                    '18' => {
                                                              'name' => 'query_qp',
                                                              'offset' => '144',
                                                              'type' => '38984'
                                                            },
                                                    '19' => {
                                                              'name' => 'modify_qp',
                                                              'offset' => '152',
                                                              'type' => '37662'
                                                            },
                                                    '2' => {
                                                             'name' => 'alloc_pd',
                                                             'offset' => '16',
                                                             'type' => '36073'
                                                           },
                                                    '20' => {
                                                              'name' => 'destroy_qp',
                                                              'offset' => '160',
                                                              'type' => '37604'
                                                            },
                                                    '21' => {
                                                              'name' => 'post_send',
                                                              'offset' => '168',
                                                              'type' => '155267'
                                                            },
                                                    '22' => {
                                                              'name' => 'post_recv',
                                                              'offset' => '176',
                                                              'type' => '155816'
                                                            },
                                                    '23' => {
                                                              'name' => 'create_ah',
                                                              'offset' => '184',
                                                              'type' => '36339'
                                                            },
                                                    '24' => {
                                                              'name' => 'destroy_ah',
                                                              'offset' => '192',
                                                              'type' => '37556'
                                                            },
                                                    '25' => {
                                                              'name' => 'attach_mcast',
                                                              'offset' => '200',
                                                              'type' => '155884'
                                                            },
                                                    '26' => {
                                                              'name' => 'detach_mcast',
                                                              'offset' => '208',
                                                              'type' => '155884'
                                                            },
                                                    '3' => {
                                                             'name' => 'dealloc_pd',
                                                             'offset' => '24',
                                                             'type' => '37486'
                                                           },
                                                    '4' => {
                                                             'name' => 'reg_mr',
                                                             'offset' => '32',
                                                             'type' => '39036'
                                                           },
                                                    '5' => {
                                                             'name' => 'dereg_mr',
                                                             'offset' => '40',
                                                             'type' => '153835'
                                                           },
                                                    '6' => {
                                                             'name' => 'create_cq',
                                                             'offset' => '48',
                                                             'type' => '36541'
                                                           },
                                                    '7' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '56',
                                                             'type' => '153882'
                                                           },
                                                    '8' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '64',
                                                             'type' => '153908'
                                                           },
                                                    '9' => {
                                                             'name' => 'cq_event',
                                                             'offset' => '72',
                                                             'type' => '36327'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_context_ops_1_0',
                                        'Size' => '216',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '15320' => {
                                       'BaseType' => '15325',
                                       'Name' => 'struct ib_uverbs_ex_modify_qp_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15325' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '748',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_qp_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '153835' => {
                                        'Name' => 'int(*)(struct ibv_mr*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '9413'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '153882' => {
                                        'Name' => 'int(*)(struct ibv_cq_1_0*, int, struct ibv_wc*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '149082'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            },
                                                     '2' => {
                                                              'type' => '9572'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '153908' => {
                                        'Name' => 'int(*)(struct ibv_cq_1_0*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '149082'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '154136' => {
                                        'Name' => 'int(*)(struct ibv_srq_1_0*, struct ibv_recv_wr_1_0*, struct ibv_recv_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '154162'
                                                            },
                                                     '1' => {
                                                              'type' => '154322'
                                                            },
                                                     '2' => {
                                                              'type' => '154384'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '154162' => {
                                        'BaseType' => '154167',
                                        'Name' => 'struct ibv_srq_1_0*',
                                        'Size' => '136',
                                        'Type' => 'Pointer'
                                      },
                          '154167' => {
                                        'Line' => '61',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '149204'
                                                           },
                                                    '1' => {
                                                             'name' => 'srq_context',
                                                             'offset' => '8',
                                                             'type' => '6648'
                                                           },
                                                    '2' => {
                                                             'name' => 'pd',
                                                             'offset' => '16',
                                                             'type' => '154272'
                                                           },
                                                    '3' => {
                                                             'name' => 'handle',
                                                             'offset' => '24',
                                                             'type' => '8369'
                                                           },
                                                    '4' => {
                                                             'name' => 'mutex',
                                                             'offset' => '32',
                                                             'type' => '8776'
                                                           },
                                                    '5' => {
                                                             'name' => 'cond',
                                                             'offset' => '72',
                                                             'type' => '9008'
                                                           },
                                                    '6' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '120',
                                                             'type' => '8369'
                                                           },
                                                    '7' => {
                                                             'name' => 'real_srq',
                                                             'offset' => '128',
                                                             'type' => '9180'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_srq_1_0',
                                        'Size' => '136',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '154272' => {
                                        'BaseType' => '154277',
                                        'Name' => 'struct ibv_pd_1_0*',
                                        'Size' => '24',
                                        'Type' => 'Pointer'
                                      },
                          '154277' => {
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '149204'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '8369'
                                                           },
                                                    '2' => {
                                                             'name' => 'real_pd',
                                                             'offset' => '16',
                                                             'type' => '8328'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_pd_1_0',
                                        'Size' => '24',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '154322' => {
                                        'BaseType' => '154327',
                                        'Name' => 'struct ibv_recv_wr_1_0*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '154327' => {
                                        'Line' => '111',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '154322'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '8',
                                                             'type' => '9340'
                                                           },
                                                    '2' => {
                                                             'name' => 'sg_list',
                                                             'offset' => '16',
                                                             'type' => '9909'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_sge',
                                                             'offset' => '24',
                                                             'type' => '125'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_recv_wr_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '154384' => {
                                        'BaseType' => '154322',
                                        'Name' => 'struct ibv_recv_wr_1_0**',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '155267' => {
                                        'Name' => 'int(*)(struct ibv_qp_1_0*, struct ibv_send_wr_1_0*, struct ibv_send_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '155293'
                                                            },
                                                     '1' => {
                                                              'type' => '155475'
                                                            },
                                                     '2' => {
                                                              'type' => '155811'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155293' => {
                                        'BaseType' => '155298',
                                        'Name' => 'struct ibv_qp_1_0*',
                                        'Size' => '168',
                                        'Type' => 'Pointer'
                                      },
                          '155298' => {
                                        'Line' => '118',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '149204'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp_context',
                                                             'offset' => '8',
                                                             'type' => '6648'
                                                           },
                                                    '10' => {
                                                              'name' => 'mutex',
                                                              'offset' => '64',
                                                              'type' => '8776'
                                                            },
                                                    '11' => {
                                                              'name' => 'cond',
                                                              'offset' => '104',
                                                              'type' => '9008'
                                                            },
                                                    '12' => {
                                                              'name' => 'events_completed',
                                                              'offset' => '152',
                                                              'type' => '8369'
                                                            },
                                                    '13' => {
                                                              'name' => 'real_qp',
                                                              'offset' => '160',
                                                              'type' => '8406'
                                                            },
                                                    '2' => {
                                                             'name' => 'pd',
                                                             'offset' => '16',
                                                             'type' => '154272'
                                                           },
                                                    '3' => {
                                                             'name' => 'send_cq',
                                                             'offset' => '24',
                                                             'type' => '149082'
                                                           },
                                                    '4' => {
                                                             'name' => 'recv_cq',
                                                             'offset' => '32',
                                                             'type' => '149082'
                                                           },
                                                    '5' => {
                                                             'name' => 'srq',
                                                             'offset' => '40',
                                                             'type' => '154162'
                                                           },
                                                    '6' => {
                                                             'name' => 'handle',
                                                             'offset' => '48',
                                                             'type' => '8369'
                                                           },
                                                    '7' => {
                                                             'name' => 'qp_num',
                                                             'offset' => '52',
                                                             'type' => '8369'
                                                           },
                                                    '8' => {
                                                             'name' => 'state',
                                                             'offset' => '56',
                                                             'type' => '208'
                                                           },
                                                    '9' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '60',
                                                             'type' => '270'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_qp_1_0',
                                        'Size' => '168',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155475' => {
                                        'BaseType' => '155480',
                                        'Name' => 'struct ibv_send_wr_1_0*',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '155480' => {
                                        'Line' => '84',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '155475'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '8',
                                                             'type' => '9340'
                                                           },
                                                    '2' => {
                                                             'name' => 'sg_list',
                                                             'offset' => '16',
                                                             'type' => '9909'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_sge',
                                                             'offset' => '24',
                                                             'type' => '125'
                                                           },
                                                    '4' => {
                                                             'name' => 'opcode',
                                                             'offset' => '28',
                                                             'type' => '596'
                                                           },
                                                    '5' => {
                                                             'name' => 'send_flags',
                                                             'offset' => '32',
                                                             'type' => '125'
                                                           },
                                                    '6' => {
                                                             'name' => 'imm_data',
                                                             'offset' => '36',
                                                             'type' => '6466'
                                                           },
                                                    '7' => {
                                                             'name' => 'wr',
                                                             'offset' => '40',
                                                             'type' => '155584'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_send_wr_1_0',
                                        'Size' => '72',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155584' => {
                                        'Line' => '92',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'rdma',
                                                             'offset' => '0',
                                                             'type' => '155600'
                                                           },
                                                    '1' => {
                                                             'name' => 'atomic',
                                                             'offset' => '0',
                                                             'type' => '155641'
                                                           },
                                                    '2' => {
                                                             'name' => 'ud',
                                                             'offset' => '0',
                                                             'type' => '155706'
                                                           }
                                                  },
                                        'Name' => 'ibv_send_wr_1_0::anon-union-compat-1_0.c-92',
                                        'NameSpace' => 'ibv_send_wr_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Union'
                                      },
                          '155600' => {
                                        'Line' => '93',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'remote_addr',
                                                             'offset' => '0',
                                                             'type' => '9340'
                                                           },
                                                    '1' => {
                                                             'name' => 'rkey',
                                                             'offset' => '8',
                                                             'type' => '8369'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-93',
                                        'Size' => '16',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155641' => {
                                        'Line' => '97',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'remote_addr',
                                                             'offset' => '0',
                                                             'type' => '9340'
                                                           },
                                                    '1' => {
                                                             'name' => 'compare_add',
                                                             'offset' => '8',
                                                             'type' => '9340'
                                                           },
                                                    '2' => {
                                                             'name' => 'swap',
                                                             'offset' => '16',
                                                             'type' => '9340'
                                                           },
                                                    '3' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '8369'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-97',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155706' => {
                                        'Line' => '103',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ah',
                                                             'offset' => '0',
                                                             'type' => '155749'
                                                           },
                                                    '1' => {
                                                             'name' => 'remote_qpn',
                                                             'offset' => '8',
                                                             'type' => '8369'
                                                           },
                                                    '2' => {
                                                             'name' => 'remote_qkey',
                                                             'offset' => '12',
                                                             'type' => '8369'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-compat-1_0.c-103',
                                        'Size' => '16',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155749' => {
                                        'BaseType' => '155754',
                                        'Name' => 'struct ibv_ah_1_0*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '155754' => {
                                        'Line' => '151',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '149204'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '154272'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '8369'
                                                           },
                                                    '3' => {
                                                             'name' => 'real_ah',
                                                             'offset' => '24',
                                                             'type' => '10503'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_ah_1_0',
                                        'Size' => '32',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '155811' => {
                                        'BaseType' => '155475',
                                        'Name' => 'struct ibv_send_wr_1_0**',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '155816' => {
                                        'Name' => 'int(*)(struct ibv_qp_1_0*, struct ibv_recv_wr_1_0*, struct ibv_recv_wr_1_0**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '155293'
                                                            },
                                                     '1' => {
                                                              'type' => '154322'
                                                            },
                                                     '2' => {
                                                              'type' => '154384'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155884' => {
                                        'Name' => 'int(*)(struct ibv_qp*, union ibv_gid*, uint16_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '8406'
                                                            },
                                                     '1' => {
                                                              'type' => '155910'
                                                            },
                                                     '2' => {
                                                              'type' => '9784'
                                                            }
                                                   },
                                        'Return' => '125',
                                        'Type' => 'FuncPtr'
                                      },
                          '155910' => {
                                        'BaseType' => '36249',
                                        'Name' => 'union ibv_gid*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '165818' => {
                                        'BaseType' => '149290',
                                        'Name' => 'struct ibv_device_1_0**',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '165823' => {
                                        'BaseType' => '165828',
                                        'Name' => 'char const*',
                                        'Size' => '1',
                                        'Type' => 'Pointer'
                                      },
                          '165828' => {
                                        'BaseType' => '7723',
                                        'Name' => 'char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '165833' => {
                                        'BaseType' => '165838',
                                        'Name' => 'struct ibv_mr_1_0*',
                                        'Size' => '40',
                                        'Type' => 'Pointer'
                                      },
                          '165838' => {
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '149204'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '154272'
                                                           },
                                                    '2' => {
                                                             'name' => 'handle',
                                                             'offset' => '16',
                                                             'type' => '8369'
                                                           },
                                                    '3' => {
                                                             'name' => 'lkey',
                                                             'offset' => '20',
                                                             'type' => '8369'
                                                           },
                                                    '4' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '8369'
                                                           },
                                                    '5' => {
                                                             'name' => 'real_mr',
                                                             'offset' => '32',
                                                             'type' => '9413'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_mr_1_0',
                                        'Size' => '40',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '165924' => {
                                        'BaseType' => '7534',
                                        'Name' => 'struct ibv_device**',
                                        'Size' => '664',
                                        'Type' => 'Pointer'
                                      },
                          '165929' => {
                                        'BaseType' => '18405',
                                        'Name' => '__be16*',
                                        'Size' => '2',
                                        'Type' => 'Pointer'
                                      },
                          '165945' => {
                                        'BaseType' => '149082',
                                        'Name' => 'struct ibv_cq_1_0**',
                                        'Size' => '128',
                                        'Type' => 'Pointer'
                                      },
                          '165955' => {
                                        'BaseType' => '165960',
                                        'Name' => 'struct ibv_qp_init_attr_1_0*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '165960' => {
                                        'Line' => '74',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp_context',
                                                             'offset' => '0',
                                                             'type' => '6648'
                                                           },
                                                    '1' => {
                                                             'name' => 'send_cq',
                                                             'offset' => '8',
                                                             'type' => '149082'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv_cq',
                                                             'offset' => '16',
                                                             'type' => '149082'
                                                           },
                                                    '3' => {
                                                             'name' => 'srq',
                                                             'offset' => '24',
                                                             'type' => '154162'
                                                           },
                                                    '4' => {
                                                             'name' => 'cap',
                                                             'offset' => '32',
                                                             'type' => '36826'
                                                           },
                                                    '5' => {
                                                             'name' => 'qp_type',
                                                             'offset' => '52',
                                                             'type' => '270'
                                                           },
                                                    '6' => {
                                                             'name' => 'sq_sig_all',
                                                             'offset' => '56',
                                                             'type' => '125'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_qp_init_attr_1_0',
                                        'Size' => '64',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Struct'
                                      },
                          '166053' => {
                                        'BaseType' => '166064',
                                        'Line' => '228',
                                        'Name' => 'ibv_driver_init_func_1_1',
                                        'Source' => 'compat-1_0.c',
                                        'Type' => 'Typedef'
                                      },
                          '166064' => {
                                        'Name' => 'struct ibv_device*(*)(char const*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '165823'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            }
                                                   },
                                        'Return' => '7534',
                                        'Type' => 'FuncPtr'
                                      },
                          '166472' => {
                                        'Header' => 'list.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '166505'
                                                           },
                                                    '1' => {
                                                             'name' => 'prev',
                                                             'offset' => '8',
                                                             'type' => '166505'
                                                           }
                                                  },
                                        'Name' => 'struct list_node',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '166505' => {
                                        'BaseType' => '166472',
                                        'Name' => 'struct list_node*',
                                        'Size' => '16',
                                        'Type' => 'Pointer'
                                      },
                          '168187' => {
                                        'BaseType' => '168192',
                                        'Name' => 'struct verbs_device*',
                                        'Size' => '704',
                                        'Type' => 'Pointer'
                                      },
                          '168192' => {
                                        'Header' => 'driver.h',
                                        'Line' => '200',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'device',
                                                             'offset' => '0',
                                                             'type' => '7539'
                                                           },
                                                    '1' => {
                                                             'name' => 'ops',
                                                             'offset' => '664',
                                                             'type' => '171236'
                                                           },
                                                    '2' => {
                                                             'name' => 'refcount',
                                                             'offset' => '672',
                                                             'type' => '180289'
                                                           },
                                                    '3' => {
                                                             'name' => 'entry',
                                                             'offset' => '680',
                                                             'type' => '166472'
                                                           },
                                                    '4' => {
                                                             'name' => 'sysfs',
                                                             'offset' => '696',
                                                             'type' => '171492'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_device',
                                        'Size' => '704',
                                        'Type' => 'Struct'
                                      },
                          '16872' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '512',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'grh',
                                                            'offset' => '0',
                                                            'type' => '16986'
                                                          },
                                                   '1' => {
                                                            'name' => 'dlid',
                                                            'offset' => '24',
                                                            'type' => '2672'
                                                          },
                                                   '2' => {
                                                            'name' => 'sl',
                                                            'offset' => '26',
                                                            'type' => '3536'
                                                          },
                                                   '3' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '27',
                                                            'type' => '3536'
                                                          },
                                                   '4' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '28',
                                                            'type' => '3536'
                                                          },
                                                   '5' => {
                                                            'name' => 'is_global',
                                                            'offset' => '29',
                                                            'type' => '3536'
                                                          },
                                                   '6' => {
                                                            'name' => 'port_num',
                                                            'offset' => '30',
                                                            'type' => '3536'
                                                          },
                                                   '7' => {
                                                            'name' => 'reserved',
                                                            'offset' => '31',
                                                            'type' => '3536'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ah_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '16986' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '503',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '3554'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '20',
                                                            'type' => '3536'
                                                          },
                                                   '3' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '21',
                                                            'type' => '3536'
                                                          },
                                                   '4' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '22',
                                                            'type' => '3536'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '23',
                                                            'type' => '3536'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_global_route',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '171236' => {
                                        'BaseType' => '171241',
                                        'Name' => 'struct verbs_device_ops const*',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '171241' => {
                                        'BaseType' => '171246',
                                        'Name' => 'struct verbs_device_ops const',
                                        'Size' => '72',
                                        'Type' => 'Const'
                                      },
                          '171246' => {
                                        'Header' => 'driver.h',
                                        'Line' => '180',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '165823'
                                                           },
                                                    '1' => {
                                                             'name' => 'match_min_abi_version',
                                                             'offset' => '8',
                                                             'type' => '125'
                                                           },
                                                    '2' => {
                                                             'name' => 'match_max_abi_version',
                                                             'offset' => '12',
                                                             'type' => '125'
                                                           },
                                                    '3' => {
                                                             'name' => 'match_table',
                                                             'offset' => '16',
                                                             'type' => '171385'
                                                           },
                                                    '4' => {
                                                             'name' => 'static_providers',
                                                             'offset' => '24',
                                                             'type' => '171464'
                                                           },
                                                    '5' => {
                                                             'name' => 'match_device',
                                                             'offset' => '32',
                                                             'type' => '171469'
                                                           },
                                                    '6' => {
                                                             'name' => 'alloc_context',
                                                             'offset' => '40',
                                                             'type' => '171699'
                                                           },
                                                    '7' => {
                                                             'name' => 'free_context',
                                                             'offset' => '48',
                                                             'type' => '7699'
                                                           },
                                                    '8' => {
                                                             'name' => 'alloc_device',
                                                             'offset' => '56',
                                                             'type' => '180261'
                                                           },
                                                    '9' => {
                                                             'name' => 'uninit_device',
                                                             'offset' => '64',
                                                             'type' => '180277'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_device_ops',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '171385' => {
                                        'BaseType' => '171390',
                                        'Name' => 'struct verbs_match_ent const*',
                                        'Size' => '24',
                                        'Type' => 'Pointer'
                                      },
                          '171390' => {
                                        'BaseType' => '171395',
                                        'Name' => 'struct verbs_match_ent const',
                                        'Size' => '24',
                                        'Type' => 'Const'
                                      },
                          '171395' => {
                                        'Header' => 'driver.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '0',
                                                             'type' => '6648'
                                                           },
                                                    '1' => {
                                                             'name' => 'modalias',
                                                             'offset' => '8',
                                                             'type' => '165823'
                                                           },
                                                    '2' => {
                                                             'name' => 'vendor',
                                                             'offset' => '16',
                                                             'type' => '9784'
                                                           },
                                                    '3' => {
                                                             'name' => 'device',
                                                             'offset' => '18',
                                                             'type' => '9784'
                                                           },
                                                    '4' => {
                                                             'name' => 'kind',
                                                             'offset' => '20',
                                                             'type' => '8206'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_match_ent',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '171464' => {
                                        'BaseType' => '171236',
                                        'Name' => 'struct verbs_device_ops const**',
                                        'Size' => '72',
                                        'Type' => 'Pointer'
                                      },
                          '171469' => {
                                        'Name' => '_Bool(*)(struct verbs_sysfs_dev*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '171492'
                                                            }
                                                   },
                                        'Return' => '63',
                                        'Type' => 'FuncPtr'
                                      },
                          '171492' => {
                                        'BaseType' => '171497',
                                        'Name' => 'struct verbs_sysfs_dev*',
                                        'Size' => '1208',
                                        'Type' => 'Pointer'
                                      },
                          '171497' => {
                                        'Header' => 'driver.h',
                                        'Line' => '166',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entry',
                                                             'offset' => '0',
                                                             'type' => '166472'
                                                           },
                                                    '1' => {
                                                             'name' => 'provider_data',
                                                             'offset' => '16',
                                                             'type' => '6648'
                                                           },
                                                    '2' => {
                                                             'name' => 'match',
                                                             'offset' => '24',
                                                             'type' => '171385'
                                                           },
                                                    '3' => {
                                                             'name' => 'sysfs_name',
                                                             'offset' => '32',
                                                             'type' => '7711'
                                                           },
                                                    '4' => {
                                                             'name' => 'ibdev_name',
                                                             'offset' => '96',
                                                             'type' => '7711'
                                                           },
                                                    '5' => {
                                                             'name' => 'sysfs_path',
                                                             'offset' => '160',
                                                             'type' => '7711'
                                                           },
                                                    '6' => {
                                                             'name' => 'ibdev_path',
                                                             'offset' => '416',
                                                             'type' => '7711'
                                                           },
                                                    '7' => {
                                                             'name' => 'modalias',
                                                             'offset' => '672',
                                                             'type' => '7711'
                                                           },
                                                    '8' => {
                                                             'name' => 'abi_ver',
                                                             'offset' => '1184',
                                                             'type' => '125'
                                                           },
                                                    '9' => {
                                                             'name' => 'time_created',
                                                             'offset' => '1192',
                                                             'type' => '34235'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_sysfs_dev',
                                        'Size' => '1208',
                                        'Type' => 'Struct'
                                      },
                          '171699' => {
                                        'Name' => 'struct verbs_context*(*)(struct ibv_device*, int, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '7534'
                                                            },
                                                     '1' => {
                                                              'type' => '125'
                                                            },
                                                     '2' => {
                                                              'type' => '6648'
                                                            }
                                                   },
                                        'Return' => '31140',
                                        'Type' => 'FuncPtr'
                                      },
                          '17191' => {
                                       'BaseType' => '17196',
                                       'Name' => 'struct ib_uverbs_create_ah_resp*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '17196' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '878',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah_handle',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '4',
                                                            'type' => '4542'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_create_ah_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '175' => {
                                     'BaseType' => '201',
                                     'Header' => 'verbs.h',
                                     'Line' => '636',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_MW_TYPE_1',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_MW_TYPE_2',
                                                          'value' => '2'
                                                        }
                                               },
                                     'Name' => 'enum ibv_mw_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '180261' => {
                                        'Name' => 'struct verbs_device*(*)(struct verbs_sysfs_dev*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '171492'
                                                            }
                                                   },
                                        'Return' => '168187',
                                        'Type' => 'FuncPtr'
                                      },
                          '180277' => {
                                        'Name' => 'void(*)(struct verbs_device*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '168187'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'FuncPtr'
                                      },
                          '180289' => {
                                        'BaseType' => '125',
                                        'Header' => 'stdatomic.h',
                                        'Line' => '97',
                                        'Name' => 'atomic_int',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '182413' => {
                                        'BaseType' => '182418',
                                        'Name' => 'struct verbs_context_ops const*',
                                        'Size' => '528',
                                        'Type' => 'Pointer'
                                      },
                          '182418' => {
                                        'BaseType' => '35188',
                                        'Name' => 'struct verbs_context_ops const',
                                        'Size' => '528',
                                        'Type' => 'Const'
                                      },
                          '18405' => {
                                       'BaseType' => '2672',
                                       'Header' => 'types.h',
                                       'Line' => '28',
                                       'Name' => '__be16',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '201' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '20517' => {
                                       'BaseType' => '8206',
                                       'Name' => 'uint8_t[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '208' => {
                                     'BaseType' => '201',
                                     'Header' => 'verbs.h',
                                     'Line' => '979',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_QPS_RESET',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_QPS_INIT',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_QPS_RTR',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_QPS_RTS',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_QPS_SQD',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_QPS_SQE',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_QPS_ERR',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_QPS_UNKNOWN',
                                                          'value' => '7'
                                                        }
                                               },
                                     'Name' => 'enum ibv_qp_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '21560' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '7422'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21632' => {
                                       'BaseType' => '21637',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21637' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '1796',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '7422'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '22033' => {
                                       'BaseType' => '22038',
                                       'Name' => 'struct ibv_create_wq*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '22038' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3680'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '22066'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_create_wq',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '22066' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '22078'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '22206'
                                                          }
                                                 },
                                       'Name' => 'ibv_create_wq::anon-union-kern-abi.h-215',
                                       'NameSpace' => 'ibv_create_wq',
                                       'Size' => '40',
                                       'Type' => 'Union'
                                     },
                          '22078' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'reserved',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-215',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '221646' => {
                                        'BaseType' => '16872',
                                        'Name' => 'struct ib_uverbs_ah_attr*',
                                        'Size' => '32',
                                        'Type' => 'Pointer'
                                      },
                          '22206' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '2690'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_handle',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '24',
                                                            'type' => '2661'
                                                          },
                                                   '6' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '28',
                                                            'type' => '2661'
                                                          },
                                                   '7' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '32',
                                                            'type' => '2661'
                                                          },
                                                   '8' => {
                                                            'name' => 'reserved',
                                                            'offset' => '36',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_wq',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '222547' => {
                                        'BaseType' => '222552',
                                        'Name' => 'struct ib_uverbs_qp_attr*',
                                        'Size' => '144',
                                        'Type' => 'Pointer'
                                      },
                          '222552' => {
                                        'Header' => 'ib_user_verbs.h',
                                        'Line' => '523',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp_attr_mask',
                                                             'offset' => '0',
                                                             'type' => '2661'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '4',
                                                             'type' => '2661'
                                                           },
                                                    '10' => {
                                                              'name' => 'ah_attr',
                                                              'offset' => '40',
                                                              'type' => '16872'
                                                            },
                                                    '11' => {
                                                              'name' => 'alt_ah_attr',
                                                              'offset' => '72',
                                                              'type' => '16872'
                                                            },
                                                    '12' => {
                                                              'name' => 'max_send_wr',
                                                              'offset' => '104',
                                                              'type' => '2661'
                                                            },
                                                    '13' => {
                                                              'name' => 'max_recv_wr',
                                                              'offset' => '108',
                                                              'type' => '2661'
                                                            },
                                                    '14' => {
                                                              'name' => 'max_send_sge',
                                                              'offset' => '112',
                                                              'type' => '2661'
                                                            },
                                                    '15' => {
                                                              'name' => 'max_recv_sge',
                                                              'offset' => '116',
                                                              'type' => '2661'
                                                            },
                                                    '16' => {
                                                              'name' => 'max_inline_data',
                                                              'offset' => '120',
                                                              'type' => '2661'
                                                            },
                                                    '17' => {
                                                              'name' => 'pkey_index',
                                                              'offset' => '124',
                                                              'type' => '2672'
                                                            },
                                                    '18' => {
                                                              'name' => 'alt_pkey_index',
                                                              'offset' => '126',
                                                              'type' => '2672'
                                                            },
                                                    '19' => {
                                                              'name' => 'en_sqd_async_notify',
                                                              'offset' => '128',
                                                              'type' => '3536'
                                                            },
                                                    '2' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '8',
                                                             'type' => '2661'
                                                           },
                                                    '20' => {
                                                              'name' => 'sq_draining',
                                                              'offset' => '129',
                                                              'type' => '3536'
                                                            },
                                                    '21' => {
                                                              'name' => 'max_rd_atomic',
                                                              'offset' => '130',
                                                              'type' => '3536'
                                                            },
                                                    '22' => {
                                                              'name' => 'max_dest_rd_atomic',
                                                              'offset' => '131',
                                                              'type' => '3536'
                                                            },
                                                    '23' => {
                                                              'name' => 'min_rnr_timer',
                                                              'offset' => '132',
                                                              'type' => '3536'
                                                            },
                                                    '24' => {
                                                              'name' => 'port_num',
                                                              'offset' => '133',
                                                              'type' => '3536'
                                                            },
                                                    '25' => {
                                                              'name' => 'timeout',
                                                              'offset' => '134',
                                                              'type' => '3536'
                                                            },
                                                    '26' => {
                                                              'name' => 'retry_cnt',
                                                              'offset' => '135',
                                                              'type' => '3536'
                                                            },
                                                    '27' => {
                                                              'name' => 'rnr_retry',
                                                              'offset' => '136',
                                                              'type' => '3536'
                                                            },
                                                    '28' => {
                                                              'name' => 'alt_port_num',
                                                              'offset' => '137',
                                                              'type' => '3536'
                                                            },
                                                    '29' => {
                                                              'name' => 'alt_timeout',
                                                              'offset' => '138',
                                                              'type' => '3536'
                                                            },
                                                    '3' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '12',
                                                             'type' => '2661'
                                                           },
                                                    '30' => {
                                                              'name' => 'reserved',
                                                              'offset' => '139',
                                                              'type' => '3554'
                                                            },
                                                    '4' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '16',
                                                             'type' => '2661'
                                                           },
                                                    '5' => {
                                                             'name' => 'qkey',
                                                             'offset' => '20',
                                                             'type' => '2661'
                                                           },
                                                    '6' => {
                                                             'name' => 'rq_psn',
                                                             'offset' => '24',
                                                             'type' => '2661'
                                                           },
                                                    '7' => {
                                                             'name' => 'sq_psn',
                                                             'offset' => '28',
                                                             'type' => '2661'
                                                           },
                                                    '8' => {
                                                             'name' => 'dest_qp_num',
                                                             'offset' => '32',
                                                             'type' => '2661'
                                                           },
                                                    '9' => {
                                                             'name' => 'qp_access_flags',
                                                             'offset' => '36',
                                                             'type' => '2661'
                                                           }
                                                  },
                                        'Name' => 'struct ib_uverbs_qp_attr',
                                        'Size' => '144',
                                        'Type' => 'Struct'
                                      },
                          '222977' => {
                                        'BaseType' => '222982',
                                        'Name' => 'struct ibv_sa_path_rec*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '222982' => {
                                        'Header' => 'sa.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dgid',
                                                             'offset' => '0',
                                                             'type' => '36249'
                                                           },
                                                    '1' => {
                                                             'name' => 'sgid',
                                                             'offset' => '16',
                                                             'type' => '36249'
                                                           },
                                                    '10' => {
                                                              'name' => 'pkey',
                                                              'offset' => '54',
                                                              'type' => '18405'
                                                            },
                                                    '11' => {
                                                              'name' => 'sl',
                                                              'offset' => '56',
                                                              'type' => '8206'
                                                            },
                                                    '12' => {
                                                              'name' => 'mtu_selector',
                                                              'offset' => '57',
                                                              'type' => '8206'
                                                            },
                                                    '13' => {
                                                              'name' => 'mtu',
                                                              'offset' => '58',
                                                              'type' => '8206'
                                                            },
                                                    '14' => {
                                                              'name' => 'rate_selector',
                                                              'offset' => '59',
                                                              'type' => '8206'
                                                            },
                                                    '15' => {
                                                              'name' => 'rate',
                                                              'offset' => '60',
                                                              'type' => '8206'
                                                            },
                                                    '16' => {
                                                              'name' => 'packet_life_time_selector',
                                                              'offset' => '61',
                                                              'type' => '8206'
                                                            },
                                                    '17' => {
                                                              'name' => 'packet_life_time',
                                                              'offset' => '62',
                                                              'type' => '8206'
                                                            },
                                                    '18' => {
                                                              'name' => 'preference',
                                                              'offset' => '63',
                                                              'type' => '8206'
                                                            },
                                                    '2' => {
                                                             'name' => 'dlid',
                                                             'offset' => '32',
                                                             'type' => '18405'
                                                           },
                                                    '3' => {
                                                             'name' => 'slid',
                                                             'offset' => '34',
                                                             'type' => '18405'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_traffic',
                                                             'offset' => '36',
                                                             'type' => '125'
                                                           },
                                                    '5' => {
                                                             'name' => 'flow_label',
                                                             'offset' => '40',
                                                             'type' => '6466'
                                                           },
                                                    '6' => {
                                                             'name' => 'hop_limit',
                                                             'offset' => '44',
                                                             'type' => '8206'
                                                           },
                                                    '7' => {
                                                             'name' => 'traffic_class',
                                                             'offset' => '45',
                                                             'type' => '8206'
                                                           },
                                                    '8' => {
                                                             'name' => 'reversible',
                                                             'offset' => '48',
                                                             'type' => '125'
                                                           },
                                                    '9' => {
                                                             'name' => 'numb_path',
                                                             'offset' => '52',
                                                             'type' => '8206'
                                                           }
                                                  },
                                        'Name' => 'struct ibv_sa_path_rec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '223248' => {
                                        'BaseType' => '223253',
                                        'Name' => 'struct ib_user_path_rec*',
                                        'Size' => '64',
                                        'Type' => 'Pointer'
                                      },
                          '223253' => {
                                        'Header' => 'ib_user_sa.h',
                                        'Line' => '55',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dgid',
                                                             'offset' => '0',
                                                             'type' => '3554'
                                                           },
                                                    '1' => {
                                                             'name' => 'sgid',
                                                             'offset' => '16',
                                                             'type' => '3554'
                                                           },
                                                    '10' => {
                                                              'name' => 'traffic_class',
                                                              'offset' => '55',
                                                              'type' => '3536'
                                                            },
                                                    '11' => {
                                                              'name' => 'numb_path',
                                                              'offset' => '56',
                                                              'type' => '3536'
                                                            },
                                                    '12' => {
                                                              'name' => 'sl',
                                                              'offset' => '57',
                                                              'type' => '3536'
                                                            },
                                                    '13' => {
                                                              'name' => 'mtu_selector',
                                                              'offset' => '58',
                                                              'type' => '3536'
                                                            },
                                                    '14' => {
                                                              'name' => 'rate_selector',
                                                              'offset' => '59',
                                                              'type' => '3536'
                                                            },
                                                    '15' => {
                                                              'name' => 'rate',
                                                              'offset' => '60',
                                                              'type' => '3536'
                                                            },
                                                    '16' => {
                                                              'name' => 'packet_life_time_selector',
                                                              'offset' => '61',
                                                              'type' => '3536'
                                                            },
                                                    '17' => {
                                                              'name' => 'packet_life_time',
                                                              'offset' => '62',
                                                              'type' => '3536'
                                                            },
                                                    '18' => {
                                                              'name' => 'preference',
                                                              'offset' => '63',
                                                              'type' => '3536'
                                                            },
                                                    '2' => {
                                                             'name' => 'dlid',
                                                             'offset' => '32',
                                                             'type' => '18405'
                                                           },
                                                    '3' => {
                                                             'name' => 'slid',
                                                             'offset' => '34',
                                                             'type' => '18405'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_traffic',
                                                             'offset' => '36',
                                                             'type' => '2661'
                                                           },
                                                    '5' => {
                                                             'name' => 'flow_label',
                                                             'offset' => '40',
                                                             'type' => '6466'
                                                           },
                                                    '6' => {
                                                             'name' => 'reversible',
                                                             'offset' => '44',
                                                             'type' => '2661'
                                                           },
                                                    '7' => {
                                                             'name' => 'mtu',
                                                             'offset' => '48',
                                                             'type' => '2661'
                                                           },
                                                    '8' => {
                                                             'name' => 'pkey',
                                                             'offset' => '52',
                                                             'type' => '18405'
                                                           },
                                                    '9' => {
                                                             'name' => 'hop_limit',
                                                             'offset' => '54',
                                                             'type' => '3536'
                                                           }
                                                  },
                                        'Name' => 'struct ib_user_path_rec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '22360' => {
                                       'BaseType' => '22365',
                                       'Name' => 'struct ib_uverbs_ex_create_wq_resp*',
                                       'Size' => '24',
                                       'Type' => 'Pointer'
                                     },
                          '22365' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'wqn',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_wq_resp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22479' => {
                                       'BaseType' => '22484',
                                       'Name' => 'struct ibv_modify_wq*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '22484' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '221',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3680'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '22512'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_wq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '22512' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '221',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '22524'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '22615'
                                                          }
                                                 },
                                       'Name' => 'ibv_modify_wq::anon-union-kern-abi.h-221',
                                       'NameSpace' => 'ibv_modify_wq',
                                       'Size' => '24',
                                       'Type' => 'Union'
                                     },
                          '22524' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '221',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-kern-abi.h-221',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '22615' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1257',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_handle',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '2661'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '20',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_modify_wq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '23147' => {
                                       'BaseType' => '23152',
                                       'Name' => 'struct ib_uverbs_ex_create_rwq_ind_table_resp*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '23152' => {
                                       'Header' => 'ib_user_verbs.h',
                                       'Line' => '1278',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2661'
                                                          },
                                                   '1' => {
                                                            'name' => 'response_length',
                                                            'offset' => '4',
                                                            'type' => '2661'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '2661'
                                                          },
                                                   '3' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '2661'
                                                          }
                                                 },
                                       'Name' => 'struct ib_uverbs_ex_create_rwq_ind_table_resp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23240' => {
                                       'BaseType' => '23245',
                                       'Name' => 'struct ibv_modify_cq*',
                                       'Size' => '40',
                                       'Type' => 'Pointer'
                                     },
                          '23245' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '219',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '3680'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '23273'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_cq',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '23273' => {
                                       'Header' => 'kern-abi.h',
                                       'Line' => '219',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '23285'
                                                          },
                                                   '1' => {
