$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.2.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libibverbs.so.1.13.35.0',
          'LibraryVersion' => 'ibverbs',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libnl-3.so.200' => 1,
                        'libnl-route-3.so.200' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '100557' => {
                                          'Header' => undef,
                                          'Line' => '174',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'context_ex',
                                                                'type' => '92485'
                                                              },
                                                       '1' => {
                                                                'name' => 'cmd',
                                                                'type' => '101899'

                                                        'ibv_query_qp@IBVERBS_1.0' => 1,
                                                        'ibv_query_srq@@IBVERBS_1.1' => 1,
                                                        'ibv_query_srq@IBVERBS_1.0' => 1,
                                                        'ibv_rate_to_mbps@@IBVERBS_1.1' => 1,
                                                        'ibv_rate_to_mult@@IBVERBS_1.0' => 1,
                                                        'ibv_read_ibdev_sysfs_file@@IBVERBS_PRIVATE_34' => 1,
                                                        'ibv_read_sysfs_file@@IBVERBS_1.0' => 1,
                                                        'ibv_reg_dmabuf_mr@@IBVERBS_1.12' => 1,
                                                        'ibv_reg_mr@@IBVERBS_1.1' => 1,
                                                        'ibv_reg_mr@IBVERBS_1.0' => 1,
                                                        'ibv_reg_mr_iova2@@IBVERBS_1.8' => 1,
                                                        'ibv_reg_mr_iova@@IBVERBS_1.7' => 1,
                                                        'ibv_register_driver@IBVERBS_1.1' => 1,
                                                        'ibv_rereg_mr@@IBVERBS_1.1' => 1,
                                                        'ibv_resize_cq@@IBVERBS_1.1' => 1,
                                                        'ibv_resize_cq@IBVERBS_1.0' => 1,
                                                        'ibv_resolve_eth_l2_from_gid@@IBVERBS_1.1' => 1,
                                                        'ibv_set_ece@@IBVERBS_1.10' => 1,
                                                        'ibv_unimport_dm@@IBVERBS_1.13' => 1,
                                                        'ibv_unimport_mr@@IBVERBS_1.10' => 1,
                                                        'ibv_unimport_pd@@IBVERBS_1.10' => 1,
                                                        'ibv_wc_status_str@@IBVERBS_1.1' => 1,
                                                        'mbps_to_ibv_rate@@IBVERBS_1.1' => 1,
                                                        'mult_to_ibv_rate@@IBVERBS_1.0' => 1,
                                                        'verbs_allow_disassociate_destroy@@IBVERBS_PRIVATE_34' => -1,
                                                        'verbs_init_cq@@IBVERBS_PRIVATE_34' => 1,
                                                        'verbs_open_device@@IBVERBS_PRIVATE_34' => 1,
                                                        'verbs_register_driver_34@@IBVERBS_PRIVATE_34' => 1,
                                                        'verbs_set_ops@@IBVERBS_PRIVATE_34' => 1,
                                                        'verbs_uninit_context@@IBVERBS_PRIVATE_34' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10055' => {
                                       'BaseType' => '186',
                                       'Name' => 'char[64]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '10071' => {
                                       'Header' => undef,
                                       'Line' => '364',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_MTU_256',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_MTU_512',
                                                            'value' => '2'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_MTU_1024',
                                                            'value' => '3'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_MTU_2048',
                                                            'value' => '4'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_MTU_4096',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_mtu',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10121' => {
                                       'Header' => undef,
                                       'Line' => '1453',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '15657'
                                                          },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '16',
                                                            'type' => '71'
                                                          },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '28',
                                                            'type' => '130'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '704'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '778'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '120',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '124',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '101899' => {
                                        'BaseType' => '91273',
                                        'Name' => 'struct ibv_get_context*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101905' => {
                                        'BaseType' => '77613',
                                        'Name' => 'struct ib_uverbs_get_context_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '10262' => {
                                       'BaseType' => '10121',
                                       'Name' => 'struct ibv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10268' => {
                                       'Header' => undef,
                                       'Line' => '1247',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '8',
                                                            'type' => '71'
                                                          },
                                                   '10' => {
                                                             'name' => 'mutex',
                                                             'offset' => '64',
                                                             'type' => '704'
                                                           },
                                                   '11' => {
                                                             'name' => 'cond',
                                                             'offset' => '104',
                                                             'type' => '778'
                                                           },
                                                   '12' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '152',
                                                             'type' => '826'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '11914'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_cq',
                                                            'offset' => '24',
                                                            'type' => '10262'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_cq',
                                                            'offset' => '32',
                                                            'type' => '10262'
                                                          },
                                                   '5' => {
                                                            'name' => 'srq',
                                                            'offset' => '40',
                                                            'type' => '10582'
                                                          },
                                                   '6' => {
                                                            'name' => 'handle',
                                                            'offset' => '48',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '52',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'state',
                                                            'offset' => '56',
                                                            'type' => '13284'
                                                          },
                                                   '9' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '60',
                                                            'type' => '12705'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp',
                                       'Size' => '160',
                                       'Type' => 'Struct'
                                     },
                          '103743' => {
                                        'BaseType' => '91604',
                                        'Name' => 'struct ibv_query_port*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '10464' => {
                                       'BaseType' => '10268',
                                       'Name' => 'struct ibv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10470' => {
                                       'Header' => undef,
                                       'Line' => '1207',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_context',
                                                            'offset' => '8',
                                                            'type' => '71'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '11914'
                                                          },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '704'
                                                          },
                                                   '5' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '778'
                                                          },
                                                   '6' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '120',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_srq',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '10582' => {
                                       'BaseType' => '10470',
                                       'Name' => 'struct ibv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10588' => {
                                       'Header' => undef,
                                       'Line' => '1229',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_context',
                                                            'offset' => '8',
                                                            'type' => '71'
                                                          },
                                                   '10' => {
                                                             'name' => 'cond',
                                                             'offset' => '96',
                                                             'type' => '778'
                                                           },
                                                   '11' => {
                                                             'name' => 'events_completed',
                                                             'offset' => '144',
                                                             'type' => '826'
                                                           },
                                                   '12' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '148',
                                                             'type' => '826'
                                                           },
                                                   '2' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '11914'
                                                          },
                                                   '3' => {
                                                            'name' => 'cq',
                                                            'offset' => '24',
                                                            'type' => '10262'
                                                          },
                                                   '4' => {
                                                            'name' => 'wq_num',
                                                            'offset' => '32',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle',
                                                            'offset' => '36',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'state',
                                                            'offset' => '40',
                                                            'type' => '12372'
                                                          },
                                                   '7' => {
                                                            'name' => 'wq_type',
                                                            'offset' => '44',
                                                            'type' => '12296'
                                                          },
                                                   '8' => {
                                                            'name' => 'post_recv',
                                                            'offset' => '48',
                                                            'type' => '14789'
                                                          },
                                                   '9' => {
                                                            'name' => 'mutex',
                                                            'offset' => '56',
                                                            'type' => '704'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '106433' => {
                                        'BaseType' => '54485',
                                        'Name' => 'struct ibv_alloc_dm_attr const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '10783' => {
                                       'BaseType' => '10588',
                                       'Name' => 'struct ibv_wq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10789' => {
                                       'Header' => undef,
                                       'Line' => '482',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WC_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WC_LOC_LEN_ERR',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WC_REM_OP_ERR',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'IBV_WC_REM_ABORT_ERR',
                                                             'value' => '16'
                                                           },
                                                   '17' => {
                                                             'name' => 'IBV_WC_INV_EECN_ERR',
                                                             'value' => '17'
                                                           },
                                                   '18' => {
                                                             'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                             'value' => '18'
                                                           },
                                                   '19' => {
                                                             'name' => 'IBV_WC_FATAL_ERR',
                                                             'value' => '19'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                            'value' => '2'
                                                          },
                                                   '20' => {
                                                             'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                             'value' => '20'
                                                           },
                                                   '21' => {
                                                             'name' => 'IBV_WC_GENERAL_ERR',
                                                             'value' => '21'
                                                           },
                                                   '22' => {
                                                             'name' => 'IBV_WC_TM_ERR',
                                                             'value' => '22'
                                                           },
                                                   '23' => {
                                                             'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                             'value' => '23'
                                                           },
                                                   '3' => {
                                                            'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WC_LOC_PROT_ERR',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WC_MW_BIND_ERR',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WC_BAD_RESP_ERR',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wc_status',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10953' => {
                                       'Header' => undef,
                                       'Line' => '510',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WC_SEND',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WC_RDMA_WRITE',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WC_TM_ADD',
                                                             'value' => '130'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WC_TM_DEL',
                                                             'value' => '131'
                                                           },
                                                   '12' => {
                                                             'name' => 'IBV_WC_TM_SYNC',
                                                             'value' => '132'
                                                           },
                                                   '13' => {
                                                             'name' => 'IBV_WC_TM_RECV',
                                                             'value' => '133'
                                                           },
                                                   '14' => {
                                                             'name' => 'IBV_WC_TM_NO_TAG',
                                                             'value' => '134'
                                                           },
                                                   '15' => {
                                                             'name' => 'IBV_WC_DRIVER1',
                                                             'value' => '135'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WC_RDMA_READ',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WC_COMP_SWAP',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WC_FETCH_ADD',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WC_BIND_MW',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WC_LOCAL_INV',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WC_TSO',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WC_RECV',
                                                            'value' => '128'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                            'value' => '129'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wc_opcode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '111165' => {
                                        'Header' => undef,
                                        'Line' => '137',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dm',
                                                             'offset' => '0',
                                                             'type' => '54538'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '32',
                                                             'type' => '826'
                                                           }
                                                  },
                                        'Name' => 'struct verbs_dm',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '11209' => {
                                       'Header' => undef,
                                       'Line' => '591',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '922'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidated_rkey',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '11246' => {
                                       'Header' => undef,
                                       'Line' => '582',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '10789'
                                                          },
                                                   '10' => {
                                                             'name' => 'slid',
                                                             'offset' => '42',
                                                             'type' => '814'
                                                           },
                                                   '11' => {
                                                             'name' => 'sl',
                                                             'offset' => '44',
                                                             'type' => '802'
                                                           },
                                                   '12' => {
                                                             'name' => 'dlid_path_bits',
                                                             'offset' => '45',
                                                             'type' => '802'
                                                           },
                                                   '2' => {
                                                            'name' => 'opcode',
                                                            'offset' => '12',
                                                            'type' => '10953'
                                                          },
                                                   '3' => {
                                                            'name' => 'vendor_err',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'byte_len',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '11209'
                                                          },
                                                   '6' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '28',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'src_qp',
                                                            'offset' => '32',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '36',
                                                            'type' => '64'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '40',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wc',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '113570' => {
                                        'BaseType' => '111165',
                                        'Name' => 'struct verbs_dm*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115045' => {
                                        'BaseType' => '106433',
                                        'Name' => 'struct ibv_alloc_dm_attr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11511' => {
                                       'Header' => undef,
                                       'Line' => '616',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mr',
                                                            'offset' => '0',
                                                            'type' => '11698'
                                                          },
                                                   '1' => {
                                                            'name' => 'addr',
                                                            'offset' => '8',
                                                            'type' => '838'
                                                          },
                                                   '2' => {
                                                            'name' => 'length',
                                                            'offset' => '16',
                                                            'type' => '838'
                                                          },
                                                   '3' => {
                                                            'name' => 'mw_access_flags',
                                                            'offset' => '24',
                                                            'type' => '64'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '11581' => {
                                       'BaseType' => '11511',
                                       'Name' => 'struct ibv_mw_bind_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '11586' => {
                                       'Header' => undef,
                                       'Line' => '659',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '11914'
                                                          },
                                                   '2' => {
                                                            'name' => 'addr',
                                                            'offset' => '16',
                                                            'type' => '71'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '52'
                                                          },
                                                   '4' => {
                                                            'name' => 'handle',
                                                            'offset' => '32',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'lkey',
                                                            'offset' => '36',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'rkey',
                                                            'offset' => '40',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11698' => {
                                       'BaseType' => '11586',
                                       'Name' => 'struct ibv_mr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11704' => {
                                       'Header' => undef,
                                       'Line' => '623',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11785' => {
                                       'Header' => undef,
                                       'Line' => '642',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '4',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'oflags',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_xrcd_init_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '118' => {
                                     'BaseType' => '85',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '11841' => {
                                       'Header' => undef,
                                       'Line' => '648',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_xrcd',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '11914' => {
                                       'BaseType' => '11704',
                                       'Name' => 'struct ibv_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11920' => {
                                       'Header' => undef,
                                       'Line' => '669',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_MW_TYPE_1',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_MW_TYPE_2',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_mw_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11952' => {
                                       'Header' => undef,
                                       'Line' => '674',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '11914'
                                                          },
                                                   '2' => {
                                                            'name' => 'rkey',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'type',
                                                            'offset' => '24',
                                                            'type' => '11920'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '12036' => {
                                       'Header' => undef,
                                       'Line' => '682',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dgid',
                                                            'offset' => '0',
                                                            'type' => '9178'
                                                          },
                                                   '1' => {
                                                            'name' => 'flow_label',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'sgid_index',
                                                            'offset' => '20',
                                                            'type' => '802'
                                                          },
                                                   '3' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '21',
                                                            'type' => '802'
                                                          },
                                                   '4' => {
                                                            'name' => 'traffic_class',
                                                            'offset' => '22',
                                                            'type' => '802'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_global_route',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12121' => {
                                       'Header' => undef,
                                       'Line' => '751',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'grh',
                                                            'offset' => '0',
                                                            'type' => '12036'
                                                          },
                                                   '1' => {
                                                            'name' => 'dlid',
                                                            'offset' => '24',
                                                            'type' => '814'
                                                          },
                                                   '2' => {
                                                            'name' => 'sl',
                                                            'offset' => '26',
                                                            'type' => '802'
                                                          },
                                                   '3' => {
                                                            'name' => 'src_path_bits',
                                                            'offset' => '27',
                                                            'type' => '802'
                                                          },
                                                   '4' => {
                                                            'name' => 'static_rate',
                                                            'offset' => '28',
                                                            'type' => '802'
                                                          },
                                                   '5' => {
                                                            'name' => 'is_global',
                                                            'offset' => '29',
                                                            'type' => '802'
                                                          },
                                                   '6' => {
                                                            'name' => 'port_num',
                                                            'offset' => '30',
                                                            'type' => '802'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '12233' => {
                                       'Header' => undef,
                                       'Line' => '766',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_srq_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '12290' => {
                                       'BaseType' => '11841',
                                       'Name' => 'struct ibv_xrcd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12296' => {
                                       'Header' => undef,
                                       'Line' => '809',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WQT_RQ',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wq_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12372' => {
                                       'Header' => undef,
                                       'Line' => '837',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WQS_RESET',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WQS_RDY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_WQS_ERR',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WQS_UNKNOWN',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wq_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12460' => {
                                       'Header' => undef,
                                       'Line' => '851',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'wq_state',
                                                            'offset' => '4',
                                                            'type' => '12372'
                                                          },
                                                   '2' => {
                                                            'name' => 'curr_wq_state',
                                                            'offset' => '8',
                                                            'type' => '12372'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags_mask',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wq_attr',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '12545' => {
                                       'Header' => undef,
                                       'Line' => '869',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl_handle',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'ind_tbl_num',
                                                            'offset' => '12',
                                                            'type' => '130'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12642' => {
                                       'Header' => undef,
                                       'Line' => '883',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_ind_tbl_size',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'ind_tbl',
                                                            'offset' => '8',
                                                            'type' => '12699'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12699' => {
                                       'BaseType' => '10783',
                                       'Name' => 'struct ibv_wq**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12705' => {
                                       'Header' => undef,
                                       'Line' => '890',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_QPT_RC',
                                                            'value' => '2'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_QPT_UC',
                                                            'value' => '3'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_QPT_UD',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_QPT_RAW_PACKET',
                                                            'value' => '8'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_QPT_XRC_SEND',
                                                            'value' => '9'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_QPT_XRC_RECV',
                                                            'value' => '10'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_QPT_DRIVER',
                                                            'value' => '255'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_qp_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12767' => {
                                       'Header' => undef,
                                       'Line' => '900',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_cap',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '12852' => {
                                       'Header' => undef,
                                       'Line' => '908',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '0',
                                                            'type' => '71'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_cq',
                                                            'offset' => '8',
                                                            'type' => '10262'
                                                          },
                                                   '2' => {
                                                            'name' => 'recv_cq',
                                                            'offset' => '16',
                                                            'type' => '10262'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq',
                                                            'offset' => '24',
                                                            'type' => '10582'
                                                          },
                                                   '4' => {
                                                            'name' => 'cap',
                                                            'offset' => '32',
                                                            'type' => '12767'
                                                          },
                                                   '5' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '52',
                                                            'type' => '12705'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_sig_all',
                                                            'offset' => '56',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_init_attr',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12965' => {
                                       'BaseType' => '12545',
                                       'Name' => 'struct ibv_rwq_ind_table*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '130' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '13021' => {
                                       'Header' => undef,
                                       'Line' => '988',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_num',
                                                            'offset' => '4',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '8',
                                                            'type' => '12290'
                                                          },
                                                   '3' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '16',
                                                            'type' => '71'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '12705'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_open_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1305' => {
                                      'Header' => undef,
                                      'Line' => '146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'command',
                                                           'offset' => '0',
                                                           'type' => '886'
                                                         },
                                                  '1' => {
                                                           'name' => 'in_words',
                                                           'offset' => '4',
                                                           'type' => '874'
                                                         },
                                                  '2' => {
                                                           'name' => 'out_words',
                                                           'offset' => '6',
                                                           'type' => '874'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_cmd_hdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '13284' => {
                                       'Header' => undef,
                                       'Line' => '1028',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_QPS_RESET',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_QPS_INIT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_QPS_RTR',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_QPS_RTS',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_QPS_SQD',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_QPS_SQE',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_QPS_ERR',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_QPS_UNKNOWN',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_qp_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13352' => {
                                       'Header' => undef,
                                       'Line' => '1039',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_MIG_MIGRATED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_MIG_REARM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_MIG_ARMED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_mig_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13390' => {
                                       'Header' => undef,
                                       'Line' => '1045',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_state',
                                                            'offset' => '0',
                                                            'type' => '13284'
                                                          },
                                                   '1' => {
                                                            'name' => 'cur_qp_state',
                                                            'offset' => '4',
                                                            'type' => '13284'
                                                          },
                                                   '10' => {
                                                             'name' => 'ah_attr',
                                                             'offset' => '56',
                                                             'type' => '12121'
                                                           },
                                                   '11' => {
                                                             'name' => 'alt_ah_attr',
                                                             'offset' => '88',
                                                             'type' => '12121'
                                                           },
                                                   '12' => {
                                                             'name' => 'pkey_index',
                                                             'offset' => '120',
                                                             'type' => '814'
                                                           },
                                                   '13' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '122',
                                                             'type' => '814'
                                                           },
                                                   '14' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '124',
                                                             'type' => '802'
                                                           },
                                                   '15' => {
                                                             'name' => 'sq_draining',
                                                             'offset' => '125',
                                                             'type' => '802'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '126',
                                                             'type' => '802'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '127',
                                                             'type' => '802'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '128',
                                                             'type' => '802'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '129',
                                                             'type' => '802'
                                                           },
                                                   '2' => {
                                                            'name' => 'path_mtu',
                                                            'offset' => '8',
                                                            'type' => '10071'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '130',
                                                             'type' => '802'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '131',
                                                             'type' => '802'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '132',
                                                             'type' => '802'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '133',
                                                             'type' => '802'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '134',
                                                             'type' => '802'
                                                           },
                                                   '25' => {
                                                             'name' => 'rate_limit',
                                                             'offset' => '136',
                                                             'type' => '826'
                                                           },
                                                   '3' => {
                                                            'name' => 'path_mig_state',
                                                            'offset' => '12',
                                                            'type' => '13352'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '28',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '32',
                                                            'type' => '64'
                                                          },
                                                   '9' => {
                                                            'name' => 'cap',
                                                            'offset' => '36',
                                                            'type' => '12767'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_attr',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '1358' => {
                                      'Header' => undef,
                                      'Line' => '152',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'provider_in_words',
                                                           'offset' => '8',
                                                           'type' => '874'
                                                         },
                                                  '2' => {
                                                           'name' => 'provider_out_words',
                                                           'offset' => '10',
                                                           'type' => '874'
                                                         },
                                                  '3' => {
                                                           'name' => 'cmd_hdr_reserved',
                                                           'offset' => '12',
                                                           'type' => '886'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_ex_cmd_hdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '137' => {
                                     'BaseType' => '64',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '13769' => {
                                       'Header' => undef,
                                       'Line' => '1081',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WR_RDMA_WRITE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WR_TSO',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WR_DRIVER1',
                                                             'value' => '11'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WR_SEND',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WR_SEND_WITH_IMM',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WR_RDMA_READ',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WR_LOCAL_INV',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WR_BIND_MW',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WR_SEND_WITH_INV',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wr_opcode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13861' => {
                                       'Header' => undef,
                                       'Line' => '1104',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '71'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_data_buf',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13904' => {
                                       'BaseType' => '13861',
                                       'Name' => 'struct ibv_data_buf const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '13909' => {
                                       'Header' => undef,
                                       'Line' => '1109',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'lkey',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_sge',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '13966' => {
                                       'BaseType' => '13909',
                                       'Name' => 'struct ibv_sge const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '13971' => {
                                       'Header' => undef,
                                       'Line' => '1125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '922'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14008' => {
                                       'Header' => undef,
                                       'Line' => '1130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14047' => {
                                       'Header' => undef,
                                       'Line' => '1134',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '838'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '16',
                                                            'type' => '838'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '14114' => {
                                       'Header' => undef,
                                       'Line' => '1140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '14222'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '12',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14166' => {
                                       'Header' => undef,
                                       'Line' => '1640',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '11914'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14222' => {
                                       'BaseType' => '14166',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14228' => {
                                       'Header' => undef,
                                       'Line' => '1129',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '14008'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '14047'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '14114'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '1426' => {
                                      'BaseType' => '862',
                                      'Name' => '__u8[7]',
                                      'Size' => '7',
                                      'Type' => 'Array'
                                    },
                          '14277' => {
                                       'Header' => undef,
                                       'Line' => '1147',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14302' => {
                                       'Header' => undef,
                                       'Line' => '1146',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '14277'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14326' => {
                                       'Header' => undef,
                                       'Line' => '1152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '14378'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '826'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '11511'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '14378' => {
                                       'BaseType' => '11952',
                                       'Name' => 'struct ibv_mw*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14384' => {
                                       'Header' => undef,
                                       'Line' => '1157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '71'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '814'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '10',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1442' => {
                                      'Header' => undef,
                                      'Line' => '309',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '8',
                                                           'type' => '1488'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_alloc_pd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '14437' => {
                                       'Header' => undef,
                                       'Line' => '1151',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '14326'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '14384'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '14474' => {
                                       'Header' => undef,
                                       'Line' => '1115',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '14612'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '14618'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '130'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '28',
                                                            'type' => '13769'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '32',
                                                            'type' => '64'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '36',
                                                            'type' => '13971'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '40',
                                                            'type' => '14228'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '72',
                                                            'type' => '14302'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '80',
                                                            'type' => '14437'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '14612' => {
                                       'BaseType' => '14474',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14618' => {
                                       'BaseType' => '13909',
                                       'Name' => 'struct ibv_sge*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14624' => {
                                       'Header' => undef,
                                       'Line' => '1165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '14695'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '16',
                                                            'type' => '14618'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '24',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_recv_wr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '14695' => {
                                       'BaseType' => '14624',
                                       'Name' => 'struct ibv_recv_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14701' => {
                                       'Header' => undef,
                                       'Line' => '1201',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '838'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '8',
                                                            'type' => '64'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '16',
                                                            'type' => '11511'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '14783' => {
                                       'BaseType' => '14695',
                                       'Name' => 'struct ibv_recv_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14789' => {
                                       'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10783'
                                                           },
                                                    '1' => {
                                                             'type' => '14695'
                                                           },
                                                    '2' => {
                                                             'type' => '14783'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14795' => {
                                       'Header' => undef,
                                       'Line' => '1264',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_base',
                                                            'offset' => '0',
                                                            'type' => '10268'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '160',
                                                            'type' => '838'
                                                          },
                                                   '10' => {
                                                             'name' => 'wr_rdma_write_imm',
                                                             'offset' => '232',
                                                             'type' => '15346'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_send',
                                                             'offset' => '240',
                                                             'type' => '15363'
                                                           },
                                                   '12' => {
                                                             'name' => 'wr_send_imm',
                                                             'offset' => '248',
                                                             'type' => '15385'
                                                           },
                                                   '13' => {
                                                             'name' => 'wr_send_inv',
                                                             'offset' => '256',
                                                             'type' => '15287'
                                                           },
                                                   '14' => {
                                                             'name' => 'wr_send_tso',
                                                             'offset' => '264',
                                                             'type' => '15417'
                                                           },
                                                   '15' => {
                                                             'name' => 'wr_set_ud_addr',
                                                             'offset' => '272',
                                                             'type' => '15449'
                                                           },
                                                   '16' => {
                                                             'name' => 'wr_set_xrc_srqn',
                                                             'offset' => '280',
                                                             'type' => '15287'
                                                           },
                                                   '17' => {
                                                             'name' => 'wr_set_inline_data',
                                                             'offset' => '288',
                                                             'type' => '15476'
                                                           },
                                                   '18' => {
                                                             'name' => 'wr_set_inline_data_list',
                                                             'offset' => '296',
                                                             'type' => '15509'
                                                           },
                                                   '19' => {
                                                             'name' => 'wr_set_sge',
                                                             'offset' => '304',
                                                             'type' => '15541'
                                                           },
                                                   '2' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '168',
                                                            'type' => '838'
                                                          },
                                                   '20' => {
                                                             'name' => 'wr_set_sge_list',
                                                             'offset' => '312',
                                                             'type' => '15574'
                                                           },
                                                   '21' => {
                                                             'name' => 'wr_start',
                                                             'offset' => '320',
                                                             'type' => '15363'
                                                           },
                                                   '22' => {
                                                             'name' => 'wr_complete',
                                                             'offset' => '328',
                                                             'type' => '15595'
                                                           },
                                                   '23' => {
                                                             'name' => 'wr_abort',
                                                             'offset' => '336',
                                                             'type' => '15363'
                                                           },
                                                   '3' => {
                                                            'name' => 'wr_flags',
                                                            'offset' => '176',
                                                            'type' => '64'
                                                          },
                                                   '4' => {
                                                            'name' => 'wr_atomic_cmp_swp',
                                                            'offset' => '184',
                                                            'type' => '15195'
                                                          },
                                                   '5' => {
                                                            'name' => 'wr_atomic_fetch_add',
                                                            'offset' => '192',
                                                            'type' => '15227'
                                                          },
                                                   '6' => {
                                                            'name' => 'wr_bind_mw',
                                                            'offset' => '200',
                                                            'type' => '15265'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr_local_inv',
                                                            'offset' => '208',
                                                            'type' => '15287'
                                                          },
                                                   '8' => {
                                                            'name' => 'wr_rdma_read',
                                                            'offset' => '216',
                                                            'type' => '15314'
                                                          },
                                                   '9' => {
                                                            'name' => 'wr_rdma_write',
                                                            'offset' => '224',
                                                            'type' => '15314'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_ex',
                                       'Size' => '344',
                                       'Type' => 'Struct'
                                     },
                          '1488' => {
                                      'BaseType' => '898',
                                      'Name' => '__u64[]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '149' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1504' => {
                                      'Header' => undef,
                                      'Line' => '314',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pd_handle',
                                                           'offset' => '0',
                                                           'type' => '886'
                                                         },
                                                  '1' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '4',
                                                           'type' => '1547'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_alloc_pd_resp',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '15189' => {
                                       'BaseType' => '14795',
                                       'Name' => 'struct ibv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15195' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, uint64_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '838'
                                                           },
                                                    '4' => {
                                                             'type' => '838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15227' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '152349' => {
                                        'BaseType' => '24326',
                                        'Name' => 'struct verbs_flow_action*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '15259' => {
                                       'BaseType' => '11581',
                                       'Name' => 'struct ibv_mw_bind_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15265' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, struct ibv_mw*, uint32_t, struct ibv_mw_bind_info const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '14378'
                                                           },
                                                    '2' => {
                                                             'type' => '826'
                                                           },
                                                    '3' => {
                                                             'type' => '15259'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15287' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15314' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15346' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, __be32)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '922'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15363' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15385' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, __be32)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '922'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15417' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, void*, uint16_t, uint16_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '71'
                                                           },
                                                    '2' => {
                                                             'type' => '814'
                                                           },
                                                    '3' => {
                                                             'type' => '814'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15449' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, struct ibv_ah*, uint32_t, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '14222'
                                                           },
                                                    '2' => {
                                                             'type' => '826'
                                                           },
                                                    '3' => {
                                                             'type' => '826'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1547' => {
                                      'BaseType' => '886',
                                      'Name' => '__u32[]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '15476' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, void*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '71'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15503' => {
                                       'BaseType' => '13904',
                                       'Name' => 'struct ibv_data_buf const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15509' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, size_t, struct ibv_data_buf const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '52'
                                                           },
                                                    '2' => {
                                                             'type' => '15503'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15541' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '826'
                                                           },
                                                    '2' => {
                                                             'type' => '838'
                                                           },
                                                    '3' => {
                                                             'type' => '826'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15568' => {
                                       'BaseType' => '13966',
                                       'Name' => 'struct ibv_sge const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '155722' => {
                                        'BaseType' => '71',
                                        'Name' => 'void**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '15574' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, size_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           },
                                                    '1' => {
                                                             'type' => '52'
                                                           },
                                                    '2' => {
                                                             'type' => '15568'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15595' => {
                                       'Name' => 'int(*)(struct ibv_qp_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '15189'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '156' => {
                                     'BaseType' => '45',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '15601' => {
                                       'Header' => undef,
                                       'Line' => '1447',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '130'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '12',
                                                            'type' => '130'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1563' => {
                                      'Header' => undef,
                                      'Line' => '323',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'fd',
                                                           'offset' => '8',
                                                           'type' => '886'
                                                         },
                                                  '2' => {
                                                           'name' => 'oflags',
                                                           'offset' => '12',
                                                           'type' => '886'
                                                         },
                                                  '3' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '16',
                                                           'type' => '1488'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_open_xrcd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '15657' => {
                                       'BaseType' => '15601',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15695' => {
                                       'Header' => undef,
                                       'Line' => '1522',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cq_count',
                                                            'offset' => '0',
                                                            'type' => '814'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_period',
                                                            'offset' => '2',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_moderate_cq',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15738' => {
                                       'Header' => undef,
                                       'Line' => '1527',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'moderate',
                                                            'offset' => '4',
                                                            'type' => '15695'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_cq_attr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15781' => {
                                       'Header' => undef,
                                       'Line' => '1652',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1652' => {
                                      'Header' => undef,
                                      'Line' => '330',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'xrcd_handle',
                                                           'offset' => '0',
                                                           'type' => '886'
                                                         },
                                                  '1' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '4',
                                                           'type' => '1547'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_open_xrcd_resp',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '168' => {
                                     'BaseType' => '149',
                                     'Header' => undef,
                                     'Line' => '193',
                                     'Name' => '__ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1711' => {
                                      'Header' => undef,
                                      'Line' => '339',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'start',
                                                           'offset' => '8',
                                                           'type' => '898'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '16',
                                                           'type' => '898'
                                                         },
                                                  '3' => {
                                                           'name' => 'hca_va',
                                                           'offset' => '24',
                                                           'type' => '898'
                                                         },
                                                  '4' => {
                                                           'name' => 'pd_handle',
                                                           'offset' => '32',
                                                           'type' => '886'
                                                         },
                                                  '5' => {
                                                           'name' => 'access_flags',
                                                           'offset' => '36',
                                                           'type' => '886'
                                                         },
                                                  '6' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '40',
                                                           'type' => '1488'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_reg_mr',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '17265' => {
                                       'Header' => undef,
                                       'Line' => '1884',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '17362' => {
                                       'Header' => undef,
                                       'Line' => '2049',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '9515'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '17391' => {
                                       'BaseType' => '17362',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17650' => {
                                       'Header' => undef,
                                       'Line' => '1864',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '4',
                                                            'type' => '15781'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '814'
                                                          },
                                                   '3' => {
                                                            'name' => 'priority',
                                                            'offset' => '10',
                                                            'type' => '814'
                                                          },
                                                   '4' => {
                                                            'name' => 'num_of_specs',
                                                            'offset' => '12',
                                                            'type' => '802'
                                                          },
                                                   '5' => {
                                                            'name' => 'port',
                                                            'offset' => '13',
                                                            'type' => '802'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_attr',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '17763' => {
                                       'Header' => undef,
                                       'Line' => '1878',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '826'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '9515'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '17820' => {
                                       'Header' => undef,
                                       'Line' => '1913',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '18004'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '18021'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17883' => {
                                       'BaseType' => '17889',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17889' => {
                                       'Header' => undef,
                                       'Line' => '1923',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '17820'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '16',
                                                            'type' => '9237'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '20',
                                                            'type' => '9304'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '24',
                                                            'type' => '10055'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '88',
                                                            'type' => '10055'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '152',
                                                            'type' => '18056'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '408',
                                                            'type' => '18056'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '180' => {
                                     'BaseType' => '186',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '18004' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17883'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '9515',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18021' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9515'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18056' => {
                                       'BaseType' => '186',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '18072' => {
                                       'Header' => undef,
                                       'Line' => '1938',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '18562'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '18604'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '80',
                                                             'type' => '18615'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '88',
                                                             'type' => '18736'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '96',
                                                             'type' => '18762'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '104',
                                                             'type' => '18615'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '112',
                                                             'type' => '18615'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '120',
                                                             'type' => '18615'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '128',
                                                             'type' => '18615'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '136',
                                                             'type' => '18615'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '144',
                                                             'type' => '18615'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '152',
                                                             'type' => '18615'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '16',
                                                            'type' => '18615'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '160',
                                                             'type' => '18793'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '168',
                                                             'type' => '18615'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '176',
                                                             'type' => '18615'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '184',
                                                             'type' => '18615'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '192',
                                                             'type' => '18615'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '200',
                                                             'type' => '18830'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '208',
                                                             'type' => '18861'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '216',
                                                             'type' => '18615'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '224',
                                                             'type' => '18615'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '232',
                                                             'type' => '18615'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '24',
                                                            'type' => '18615'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '240',
                                                             'type' => '18615'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '248',
                                                             'type' => '18615'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '32',
                                                            'type' => '18615'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '40',
                                                            'type' => '18615'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '48',
                                                            'type' => '18615'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '56',
                                                            'type' => '18641'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '64',
                                                            'type' => '18678'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '72',
                                                            'type' => '18699'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '1846' => {
                                      'Header' => undef,
                                      'Line' => '349',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr_handle',
                                                           'offset' => '0',
                                                           'type' => '886'
                                                         },
                                                  '1' => {
                                                           'name' => 'lkey',
                                                           'offset' => '4',
                                                           'type' => '886'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '886'
                                                         },
                                                  '3' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '12',
                                                           'type' => '1547'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_reg_mr_resp',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '18556' => {
                                       'BaseType' => '9521',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18562' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9515'
                                                           },
                                                    '1' => {
                                                             'type' => '18556'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18593' => {
                                       'BaseType' => '18599',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18599' => {
                                       'Header' => undef,
                                       'Line' => '189',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '56189'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_mtu',
                                                            'offset' => '4',
                                                            'type' => '10071'
                                                          },
                                                   '10' => {
                                                             'name' => 'sm_lid',
                                                             'offset' => '36',
                                                             'type' => '814'
                                                           },
                                                   '11' => {
                                                             'name' => 'lmc',
                                                             'offset' => '38',
                                                             'type' => '802'
                                                           },
                                                   '12' => {
                                                             'name' => 'max_vl_num',
                                                             'offset' => '39',
                                                             'type' => '802'
                                                           },
                                                   '13' => {
                                                             'name' => 'sm_sl',
                                                             'offset' => '40',
                                                             'type' => '802'
                                                           },
                                                   '14' => {
                                                             'name' => 'subnet_timeout',
                                                             'offset' => '41',
                                                             'type' => '802'
                                                           },
                                                   '15' => {
                                                             'name' => 'init_type_reply',
                                                             'offset' => '42',
                                                             'type' => '802'
                                                           },
                                                   '16' => {
                                                             'name' => 'active_width',
                                                             'offset' => '43',
                                                             'type' => '802'
                                                           },
                                                   '17' => {
                                                             'name' => 'active_speed',
                                                             'offset' => '44',
                                                             'type' => '802'
                                                           },
                                                   '18' => {
                                                             'name' => 'phys_state',
                                                             'offset' => '45',
                                                             'type' => '802'
                                                           },
                                                   '19' => {
                                                             'name' => 'link_layer',
                                                             'offset' => '46',
                                                             'type' => '802'
                                                           },
                                                   '2' => {
                                                            'name' => 'active_mtu',
                                                            'offset' => '8',
                                                            'type' => '10071'
                                                          },
                                                   '20' => {
                                                             'name' => 'flags',
                                                             'offset' => '47',
                                                             'type' => '802'
                                                           },
                                                   '3' => {
                                                            'name' => 'gid_tbl_len',
                                                            'offset' => '12',
                                                            'type' => '130'
                                                          },
                                                   '4' => {
                                                            'name' => 'port_cap_flags',
                                                            'offset' => '16',
                                                            'type' => '826'
                                                          },
                                                   '5' => {
                                                            'name' => 'max_msg_sz',
                                                            'offset' => '20',
                                                            'type' => '826'
                                                          },
                                                   '6' => {
                                                            'name' => 'bad_pkey_cntr',
                                                            'offset' => '24',
                                                            'type' => '826'
                                                          },
                                                   '7' => {
                                                            'name' => 'qkey_viol_cntr',
                                                            'offset' => '28',
                                                            'type' => '826'
                                                          },
                                                   '8' => {
                                                            'name' => 'pkey_tbl_len',
                                                            'offset' => '32',
                                                            'type' => '814'
                                                          },
                                                   '9' => {
                                                            'name' => 'lid',
                                                            'offset' => '34',
                                                            'type' => '814'
                                                          }
                                                 },
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '186' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '18604' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9515'
                                                           },
                                                    '1' => {
                                                             'type' => '802'
                                                           },
                                                    '2' => {
                                                             'type' => '18593'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18615' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '71',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18641' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11914'
                                                           },
                                                    '1' => {
                                                             'type' => '11920'
                                                           }
                                                  },
                                       'Return' => '14378',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18672' => {
                                       'BaseType' => '14701',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18678' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10464'
                                                           },
                                                    '1' => {
                                                             'type' => '14378'
                                                           },
                                                    '2' => {
                                                             'type' => '18672'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18699' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14378'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18730' => {
                                       'BaseType' => '11246',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18736' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10262'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           },
                                                    '2' => {
                                                             'type' => '18730'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18762' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10262'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18793' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10582'
                                                           },
                                                    '1' => {
                                                             'type' => '14695'
                                                           },
                                                    '2' => {
                                                             'type' => '14783'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18824' => {
                                       'BaseType' => '14612',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18830' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10464'
                                                           },
                                                    '1' => {
                                                             'type' => '14612'
                                                           },
                                                    '2' => {
                                                             'type' => '18824'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18861' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10464'
                                                           },
                                                    '1' => {
                                                             'type' => '14695'
                                                           },
                                                    '2' => {
                                                             'type' => '14783'
                                                           }
                                                  },
                                       'Return' => '130',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18867' => {
                                       'BaseType' => '17763',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18873' => {
                                       'BaseType' => '15738',
                                       'Name' => 'struct ibv_modify_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18879' => {
                                       'BaseType' => '12642',
                                       'Name' => 'struct ibv_rwq_ind_table_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18885' => {
                                       'BaseType' => '12460',
                                       'Name' => 'struct ibv_wq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18891' => {
                                       'BaseType' => '17650',
                                       'Name' => 'struct ibv_flow_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18897' => {
                                       'BaseType' => '13021',
                                       'Name' => 'struct ibv_qp_open_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18903' => {
                                       'BaseType' => '11785',
                                       'Name' => 'struct ibv_xrcd_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18909' => {
                                       'Name' => '_Bool',
                                       'Size' => '1',
                                       'Type' => 'Intrinsic'
                                     },
                          '18916' => {
                                       'Header' => undef,
                                       'Line' => '51',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'ex_hdr',
                                                            'offset' => '8',
                                                            'type' => '1358'
                                                          }
                                                 },
                                       'Name' => 'struct ex_hdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '18958' => {
                                       'Header' => undef,
                                       'Line' => '175',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '898'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'mw_type',
                                                            'offset' => '12',
                                                            'type' => '862'
                                                          },
                                                   '3' => {
                                                            'name' => 'reserved',
                                                            'offset' => '13',
                                                            'type' => '2259'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19052' => {
                                       'Header' => undef,
                                       'Line' => '175',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '18958'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '2171'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '19082' => {
                                       'Header' => undef,
                                       'Line' => '175',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '19052'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_mw',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '19143' => {
                                       'Header' => undef,
                                       'Line' => '176',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '898'
                                                          },
                                                   '1' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '8',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '19198' => {
                                       'Header' => undef,
                                       'Line' => '176',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '19143'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '1442'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '19228' => {
                                       'Header' => undef,
                                       'Line' => '176',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '19198'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_alloc_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '193' => {
                                     'BaseType' => '168',
                                     'Header' => undef,
                                     'Line' => '77',
                                     'Name' => 'ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1933' => {
                                      'Header' => undef,
                                      'Line' => '356',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'mr_handle',
                                                           'offset' => '8',
                                                           'type' => '886'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '12',
                                                           'type' => '886'
                                                         },
                                                  '3' => {
                                                           'name' => 'start',
                                                           'offset' => '16',
                                                           'type' => '898'
                                                         },
                                                  '4' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '898'
                                                         },
                                                  '5' => {
                                                           'name' => 'hca_va',
                                                           'offset' => '32',
                                                           'type' => '898'
                                                         },
                                                  '6' => {
                                                           'name' => 'pd_handle',
                                                           'offset' => '40',
                                                           'type' => '886'
                                                         },
                                                  '7' => {
                                                           'name' => 'access_flags',
                                                           'offset' => '44',
                                                           'type' => '886'
                                                         },
                                                  '8' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '48',
                                                           'type' => '1488'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_rereg_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '19828' => {
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dest',
                                                            'offset' => '0',
                                                            'type' => '3542'
                                                          },
                                                   '1' => {
                                                            'name' => 'alt_dest',
                                                            'offset' => '32',
                                                            'type' => '3542'
                                                          },
                                                   '10' => {
                                                             'name' => 'alt_pkey_index',
                                                             'offset' => '94',
                                                             'type' => '874'
                                                           },
                                                   '11' => {
                                                             'name' => 'qp_state',
                                                             'offset' => '96',
                                                             'type' => '862'
                                                           },
                                                   '12' => {
                                                             'name' => 'cur_qp_state',
                                                             'offset' => '97',
                                                             'type' => '862'
                                                           },
                                                   '13' => {
                                                             'name' => 'path_mtu',
                                                             'offset' => '98',
                                                             'type' => '862'
                                                           },
                                                   '14' => {
                                                             'name' => 'path_mig_state',
                                                             'offset' => '99',
                                                             'type' => '862'
                                                           },
                                                   '15' => {
                                                             'name' => 'en_sqd_async_notify',
                                                             'offset' => '100',
                                                             'type' => '862'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_rd_atomic',
                                                             'offset' => '101',
                                                             'type' => '862'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dest_rd_atomic',
                                                             'offset' => '102',
                                                             'type' => '862'
                                                           },
                                                   '18' => {
                                                             'name' => 'min_rnr_timer',
                                                             'offset' => '103',
                                                             'type' => '862'
                                                           },
                                                   '19' => {
                                                             'name' => 'port_num',
                                                             'offset' => '104',
                                                             'type' => '862'
                                                           },
                                                   '2' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '64',
                                                            'type' => '886'
                                                          },
                                                   '20' => {
                                                             'name' => 'timeout',
                                                             'offset' => '105',
                                                             'type' => '862'
                                                           },
                                                   '21' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '106',
                                                             'type' => '862'
                                                           },
                                                   '22' => {
                                                             'name' => 'rnr_retry',
                                                             'offset' => '107',
                                                             'type' => '862'
                                                           },
                                                   '23' => {
                                                             'name' => 'alt_port_num',
                                                             'offset' => '108',
                                                             'type' => '862'
                                                           },
                                                   '24' => {
                                                             'name' => 'alt_timeout',
                                                             'offset' => '109',
                                                             'type' => '862'
                                                           },
                                                   '25' => {
                                                             'name' => 'reserved',
                                                             'offset' => '110',
                                                             'type' => '4676'
                                                           },
                                                   '26' => {
                                                             'name' => 'driver_data',
                                                             'offset' => '112',
                                                             'type' => '1488'
                                                           },
                                                   '3' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '68',
                                                            'type' => '886'
                                                          },
                                                   '4' => {
                                                            'name' => 'qkey',
                                                            'offset' => '72',
                                                            'type' => '886'
                                                          },
                                                   '5' => {
                                                            'name' => 'rq_psn',
                                                            'offset' => '76',
                                                            'type' => '886'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_psn',
                                                            'offset' => '80',
                                                            'type' => '886'
                                                          },
                                                   '7' => {
                                                            'name' => 'dest_qp_num',
                                                            'offset' => '84',
                                                            'type' => '886'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_access_flags',
                                                            'offset' => '88',
                                                            'type' => '886'
                                                          },
                                                   '9' => {
                                                            'name' => 'pkey_index',
                                                            'offset' => '92',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '20207' => {
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '19828'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '4281'
                                                          }
                                                 },
                                       'Size' => '112',
                                       'Type' => 'Union'
                                     },
                          '20237' => {
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '20207'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_qp',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '20285' => {
                                       'Header' => undef,
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '0',
                                                            'type' => '886'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '4',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_wr',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq_limit',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          },
                                                   '4' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '203235' => {
                                        'Header' => undef,
                                        'Line' => '572',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'response',
                                                             'offset' => '0',
                                                             'type' => '898'
                                                           },
                                                    '1' => {
                                                             'name' => 'user_handle',
                                                             'offset' => '8',
                                                             'type' => '898'
                                                           },
                                                    '10' => {
                                                              'name' => 'max_inline_data',
                                                              'offset' => '48',
                                                              'type' => '886'
                                                            },
                                                    '11' => {
                                                              'name' => 'sq_sig_all',
                                                              'offset' => '52',
                                                              'type' => '862'
                                                            },
                                                    '12' => {
                                                              'name' => 'qp_type',
                                                              'offset' => '53',
                                                              'type' => '862'
                                                            },
                                                    '13' => {
                                                              'name' => 'is_srq',
                                                              'offset' => '54',
                                                              'type' => '862'
                                                            },
                                                    '14' => {
                                                              'name' => 'reserved',
                                                              'offset' => '55',
                                                              'type' => '862'
                                                            },
                                                    '15' => {
                                                              'name' => 'driver_data',
                                                              'offset' => '56',
                                                              'type' => '1488'
                                                            },
                                                    '2' => {
                                                             'name' => 'pd_handle',
                                                             'offset' => '16',
                                                             'type' => '886'
                                                           },
                                                    '3' => {
                                                             'name' => 'send_cq_handle',
                                                             'offset' => '20',
                                                             'type' => '886'
                                                           },
                                                    '4' => {
                                                             'name' => 'recv_cq_handle',
                                                             'offset' => '24',
                                                             'type' => '886'
                                                           },
                                                    '5' => {
                                                             'name' => 'srq_handle',
                                                             'offset' => '28',
                                                             'type' => '886'
                                                           },
                                                    '6' => {
                                                             'name' => 'max_send_wr',
                                                             'offset' => '32',
                                                             'type' => '886'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_recv_wr',
                                                             'offset' => '36',
                                                             'type' => '886'
                                                           },
                                                    '8' => {
                                                             'name' => 'max_send_sge',
                                                             'offset' => '40',
                                                             'type' => '886'
                                                           },
                                                    '9' => {
                                                             'name' => 'max_recv_sge',
                                                             'offset' => '44',
                                                             'type' => '886'
                                                           }
                                                  },
                                        'Name' => 'struct ib_uverbs_create_qp',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '203520' => {
                                        'Header' => undef,
                                        'Line' => '599',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_handle',
                                                             'offset' => '0',
                                                             'type' => '898'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd_handle',
                                                             'offset' => '8',
                                                             'type' => '886'
                                                           },
                                                    '10' => {
                                                              'name' => 'sq_sig_all',
                                                              'offset' => '44',
                                                              'type' => '862'
                                                            },
                                                    '11' => {
                                                              'name' => 'qp_type',
                                                              'offset' => '45',
                                                              'type' => '862'
                                                            },
                                                    '12' => {
                                                              'name' => 'is_srq',
                                                              'offset' => '46',
                                                              'type' => '862'
                                                            },
                                                    '13' => {
                                                              'name' => 'reserved',
                                                              'offset' => '47',
                                                              'type' => '862'
                                                            },
                                                    '14' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '48',
                                                              'type' => '886'
                                                            },
                                                    '15' => {
                                                              'name' => 'create_flags',
                                                              'offset' => '52',
                                                              'type' => '886'
                                                            },
                                                    '16' => {
                                                              'name' => 'rwq_ind_tbl_handle',
                                                              'offset' => '56',
                                                              'type' => '886'
                                                            },
                                                    '17' => {
                                                              'name' => 'source_qpn',
                                                              'offset' => '60',
                                                              'type' => '886'
                                                            },
                                                    '2' => {
                                                             'name' => 'send_cq_handle',
                                                             'offset' => '12',
                                                             'type' => '886'
                                                           },
                                                    '3' => {
                                                             'name' => 'recv_cq_handle',
                                                             'offset' => '16',
                                                             'type' => '886'
                                                           },
                                                    '4' => {
                                                             'name' => 'srq_handle',
                                                             'offset' => '20',
                                                             'type' => '886'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_send_wr',
                                                             'offset' => '24',
                                                             'type' => '886'
                                                           },
                                                    '6' => {
                                                             'name' => 'max_recv_wr',
                                                             'offset' => '28',
                                                             'type' => '886'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_send_sge',
                                                             'offset' => '32',
                                                             'type' => '886'
                                                           },
                                                    '8' => {
                                                             'name' => 'max_recv_sge',
                                                             'offset' => '36',
                                                             'type' => '886'
                                                           },
                                                    '9' => {
                                                             'name' => 'max_inline_data',
                                                             'offset' => '40',
                                                             'type' => '886'
                                                           }
                                                  },
                                        'Name' => 'struct ib_uverbs_ex_create_qp',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '20378' => {
                                       'Header' => undef,
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '20285'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '8521'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '203946' => {
                                        'Header' => undef,
                                        'Line' => '643',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'base',
                                                             'offset' => '0',
                                                             'type' => '3385'
                                                           },
                                                    '1' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '32',
                                                             'type' => '886'
                                                           },
                                                    '2' => {
                                                             'name' => 'response_length',
                                                             'offset' => '36',
                                                             'type' => '886'
                                                           }
                                                  },
                                        'Name' => 'struct ib_uverbs_ex_create_qp_resp',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '20408' => {
                                       'Header' => undef,
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '20378'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_modify_srq',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '20456' => {
                                       'Header' => undef,
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '898'
                                                          },
                                                   '1' => {
                                                            'name' => 'user_handle',
                                                            'offset' => '8',
                                                            'type' => '898'
                                                          },
                                                   '2' => {
                                                            'name' => 'pd_handle',
                                                            'offset' => '16',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'qpn',
                                                            'offset' => '20',
                                                            'type' => '886'
                                                          },
                                                   '4' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '24',
                                                            'type' => '862'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved',
                                                            'offset' => '25',
                                                            'type' => '1426'
                                                          },
                                                   '6' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '32',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '205' => {
                                     'Name' => 'long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '20577' => {
                                       'Header' => undef,
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '20456'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '3252'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '20607' => {
                                       'Header' => undef,
                                       'Line' => '196',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '20577'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_qp',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '20667' => {
                                       'Header' => undef,
                                       'Line' => '197',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '898'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'oflags',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20747' => {
                                       'Header' => undef,
                                       'Line' => '197',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '20667'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '1563'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '20777' => {
                                       'Header' => undef,
                                       'Line' => '197',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '20747'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_open_xrcd',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2096' => {
                                      'Header' => undef,
                                      'Line' => '368',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'lkey',
                                                           'offset' => '0',
                                                           'type' => '886'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '4',
                                                           'type' => '886'
                                                         },
                                                  '2' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '8',
                                                           'type' => '1488'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_rereg_mr_resp',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '21572' => {
                                       'Header' => undef,
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '898'
                                                          },
                                                   '1' => {
                                                            'name' => 'qp_handle',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'attr_mask',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21653' => {
                                       'Header' => undef,
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '21572'
                                                          },
                                                   '1' => {
                                                            'name' => 'core_payload',
                                                            'offset' => '0',
                                                            'type' => '3724'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '21683' => {
                                       'Header' => undef,
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '1305'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '21653'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_query_qp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2171' => {
                                      'Header' => undef,
                                      'Line' => '378',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'response',
                                                           'offset' => '0',
                                                           'type' => '898'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd_handle',
                                                           'offset' => '8',
                                                           'type' => '886'
                                                         },
                                                  '2' => {
                                                           'name' => 'mw_type',
                                                           'offset' => '12',
                                                           'type' => '862'
                                                         },
                                                  '3' => {
                                                           'name' => 'reserved',
                                                           'offset' => '13',
                                                           'type' => '2259'
                                                         },
                                                  '4' => {
                                                           'name' => 'driver_data',
                                                           'offset' => '16',
                                                           'type' => '1488'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_alloc_mw',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '21744' => {
                                       'Header' => undef,
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'response',
                                                            'offset' => '0',
                                                            'type' => '898'
                                                          },
                                                   '1' => {
                                                            'name' => 'srq_handle',
                                                            'offset' => '8',
                                                            'type' => '886'
                                                          },
                                                   '2' => {
                                                            'name' => 'reserved',
                                                            'offset' => '12',
                                                            'type' => '886'
                                                          },
                                                   '3' => {
                                                            'name' => 'driver_data',
                                                            'offset' => '16',
                                                            'type' => '1488'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '217995' => {
                                        'Header' => undef,
                                        'Line' => '182',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'response',
                                                             'offset' => '0',
                                                             'type' => '898'
                                                           },
                                                    '1' => {
                                                             'name' => 'user_handle',
                                                             'offset' => '8',
                                                             'type' => '898'
                                                           },
                                                    '10' => {
                                                              'name' => 'max_inline_data',
                                                              'offset' => '48',
                                                              'type' => '886'
                                                            },
                                                    '11' => {
                                                              'name' => 'sq_sig_all',
                                                              'offset' => '52',
                                                              'type' => '862'
                                                            },
                                                    '12' => {
                                                              'name' => 'qp_type',
                                                              'offset' => '53',
                                                              'type' => '862'
                                                            },
                                                    '13' => {
                                                              'name' => 'is_srq',
                                                              'offset' => '54',
                                                              'type' => '862'
                                                            },
                                                    '14' => {
                                                              'name' => 'reserved',
                                                              'offset' => '55',
                                                              'type' => '862'
                                                            },
                                                    '15' => {
                                                              'name' => 'driver_data',
                                                              'offset' => '56',
                                                              'type' => '1488'
                                                            },
                                                    '2' => {
                                                             'name' => 'pd_handle',
                                                             'offset' => '16',
                                                             'type' => '886'
                                                           },
                                                    '3' => {
                                                             'name' => 'send_cq_handle',
                                                             'offset' => '20',
                                                             'type' => '886'
                                                           },
                                                    '4' => {
                                                             'name' => 'recv_cq_handle',
                                                             'offset' => '24',
                                                             'type' => '886'
                                                           },
                                                    '5' => {
                                                             'name' => 'srq_handle',
                                                             'offset' => '28',
                                                             'type' => '886'
                                                           },
                                                    '6' => {
                                                             'name' => 'max_send_wr',
                                                             'offset' => '32',
                                                             'type' => '886'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_recv_wr',
                                                             'offset' => '36',
                                                             'type' => '886'
