$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.1.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmana.so.1.0.45.0',
          'LibraryVersion' => 'mana',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '40613' => {
                                         'Header' => undef,
                                         'Line' => '43',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'obj',
                                                               'type' => '40950'
                                                             },
                                                      '1' => {
                                                               'name' => 'obj_type',
                                                               'type' => '968'
                                                             }
                                                    },
                                         'Return' => '78',
                                         'ShortName' => 'manadv_init_obj'
                                       },
                            '40970' => {
                                         'Header' => undef,
                                         'Line' => '23',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ibv_ctx',
                                                               'type' => '4192'
                                                             },
                                                      '1' => {
                                                               'name' => 'type',
                                                               'type' => '39678'
                                                             },
                                                      '2' => {
                                                               'name' => 'attr',
                                                               'type' => '121'
                                                             }
                                                    },
                                         'Return' => '78',
                                         'ShortName' => 'manadv_set_context_attr'
                                       }
                          },
          'SymbolVersion' => {
                               'manadv_init_obj' => 'manadv_init_obj@@MANA_1.0',
                               'manadv_set_context_attr' => 'manadv_set_context_attr@@MANA_1.0'
                             },
          'Symbols' => {
                         'libmana.so.1.0.45.0' => {
                                                    'manadv_init_obj@@MANA_1.0' => 1,
                                                    'manadv_set_context_attr@@MANA_1.0' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10138' => {
                                       'Header' => undef,
                                       'Line' => '1092',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_WR_RDMA_WRITE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'IBV_WR_TSO',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'IBV_WR_DRIVER1',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'IBV_WR_FLUSH',
                                                             'value' => '14'
                                                           },
                                                   '13' => {
                                                             'name' => 'IBV_WR_ATOMIC_WRITE',
                                                             'value' => '15'
                                                           },
                                                   '2' => {
                                                            'name' => 'IBV_WR_SEND',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_WR_SEND_WITH_IMM',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'IBV_WR_RDMA_READ',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'IBV_WR_LOCAL_INV',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'IBV_WR_BIND_MW',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'IBV_WR_SEND_WITH_INV',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_wr_opcode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10239' => {
                                       'Header' => undef,
                                       'Line' => '1132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '968'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          },
                                                   '2' => {
                                                            'name' => 'lkey',
                                                            'offset' => '18',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_sge',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10295' => {
                                       'Header' => undef,
                                       'Line' => '1148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'imm_data',
                                                            'offset' => '0',
                                                            'type' => '1057'
                                                          },
                                                   '1' => {
                                                            'name' => 'invalidate_rkey',
                                                            'offset' => '0',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10328' => {
                                       'Header' => undef,
                                       'Line' => '1153',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '968'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1033' => {
                                      'BaseType' => '109',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '10366' => {
                                       'Header' => undef,
                                       'Line' => '1157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_addr',
                                                            'offset' => '0',
                                                            'type' => '968'
                                                          },
                                                   '1' => {
                                                            'name' => 'compare_add',
                                                            'offset' => '8',
                                                            'type' => '968'
                                                          },
                                                   '2' => {
                                                            'name' => 'swap',
                                                            'offset' => '22',
                                                            'type' => '968'
                                                          },
                                                   '3' => {
                                                            'name' => 'rkey',
                                                            'offset' => '36',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10432' => {
                                       'Header' => undef,
                                       'Line' => '1163',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ah',
                                                            'offset' => '0',
                                                            'type' => '10538'
                                                          },
                                                   '1' => {
                                                            'name' => 'remote_qpn',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_qkey',
                                                            'offset' => '18',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1045' => {
                                      'BaseType' => '406',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '10483' => {
                                       'Header' => undef,
                                       'Line' => '1682',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '4192'
                                                          },
                                                   '1' => {
                                                            'name' => 'pd',
                                                            'offset' => '8',
                                                            'type' => '7915'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '22',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_ah',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10538' => {
                                       'BaseType' => '10483',
                                       'Name' => 'struct ibv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10543' => {
                                       'Header' => undef,
                                       'Line' => '1152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdma',
                                                            'offset' => '0',
                                                            'type' => '10328'
                                                          },
                                                   '1' => {
                                                            'name' => 'atomic',
                                                            'offset' => '0',
                                                            'type' => '10366'
                                                          },
                                                   '2' => {
                                                            'name' => 'ud',
                                                            'offset' => '0',
                                                            'type' => '10432'
                                                          }
                                                 },
                                       'Size' => '32',
                                       'Type' => 'Union'
                                     },
                          '1057' => {
                                      'BaseType' => '1033',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '10587' => {
                                       'Header' => undef,
                                       'Line' => '1170',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'remote_srqn',
                                                            'offset' => '0',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10611' => {
                                       'Header' => undef,
                                       'Line' => '1169',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'xrc',
                                                            'offset' => '0',
                                                            'type' => '10587'
                                                          }
                                                 },
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '10632' => {
                                       'Header' => undef,
                                       'Line' => '1175',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mw',
                                                            'offset' => '0',
                                                            'type' => '10683'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '22',
                                                            'type' => '7549'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10683' => {
                                       'BaseType' => '7949',
                                       'Name' => 'struct ibv_mw*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10688' => {
                                       'Header' => undef,
                                       'Line' => '1180',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr_sz',
                                                            'offset' => '8',
                                                            'type' => '944'
                                                          },
                                                   '2' => {
                                                            'name' => 'mss',
                                                            'offset' => '16',
                                                            'type' => '944'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1069' => {
                                      'BaseType' => '1045',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '10740' => {
                                       'Header' => undef,
                                       'Line' => '1174',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '0',
                                                            'type' => '10632'
                                                          },
                                                   '1' => {
                                                            'name' => 'tso',
                                                            'offset' => '0',
                                                            'type' => '10688'
                                                          }
                                                 },
                                       'Size' => '48',
                                       'Type' => 'Union'
                                     },
                          '10773' => {
                                       'Header' => undef,
                                       'Line' => '1138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '968'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10910'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '22',
                                                            'type' => '10915'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '36',
                                                            'type' => '78'
                                                          },
                                                   '4' => {
                                                            'name' => 'opcode',
                                                            'offset' => '40',
                                                            'type' => '10138'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '50',
                                                            'type' => '109'
                                                          },
                                                   '6' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '54',
                                                            'type' => '10295'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr',
                                                            'offset' => '64',
                                                            'type' => '10543'
                                                          },
                                                   '8' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '114',
                                                            'type' => '10611'
                                                          },
                                                   '9' => {
                                                            'name' => 'unnamed1',
                                                            'offset' => '128',
                                                            'type' => '10740'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_send_wr',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '109' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '10910' => {
                                       'BaseType' => '10773',
                                       'Name' => 'struct ibv_send_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10915' => {
                                       'BaseType' => '10239',
                                       'Name' => 'struct ibv_sge*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10920' => {
                                       'Header' => undef,
                                       'Line' => '1188',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '968'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '10990'
                                                          },
                                                   '2' => {
                                                            'name' => 'sg_list',
                                                            'offset' => '22',
                                                            'type' => '10915'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_sge',
                                                            'offset' => '36',
                                                            'type' => '78'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_recv_wr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10990' => {
                                       'BaseType' => '10920',
                                       'Name' => 'struct ibv_recv_wr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11250' => {
                                       'Header' => undef,
                                       'Line' => '1224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '968'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_flags',
                                                            'offset' => '8',
                                                            'type' => '109'
                                                          },
                                                   '2' => {
                                                            'name' => 'bind_info',
                                                            'offset' => '22',
                                                            'type' => '7549'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_mw_bind',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11331' => {
                                       'BaseType' => '10990',
                                       'Name' => 'struct ibv_recv_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11336' => {
                                       'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6853'
                                                           },
                                                    '1' => {
                                                             'type' => '10990'
                                                           },
                                                    '2' => {
                                                             'type' => '11331'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11397' => {
                                       'Header' => undef,
                                       'Line' => '1489',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '4192'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '78'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '18',
                                                            'type' => '78'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11452' => {
                                       'BaseType' => '11397',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '121' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '123' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '12716' => {
                                       'Header' => undef,
                                       'Line' => '1955',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '12897'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '12913'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12778' => {
                                       'BaseType' => '12783',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12783' => {
                                       'Header' => undef,
                                       'Line' => '1965',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '12716'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '3791'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '3855'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '4806'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '4806'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '12944'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '12944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '12897' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12778'
                                                           },
                                                    '1' => {
                                                             'type' => '78'
                                                           }
                                                  },
                                       'Return' => '4192',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12913' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4192'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12944' => {
                                       'BaseType' => '267',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '12960' => {
                                       'Header' => undef,
                                       'Line' => '1980',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '13448'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '13488'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '13498'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '13613'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '13638'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '13498'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '13498'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '13498'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '13498'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '13498'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '13498'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '13498'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '13498'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '13668'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '13498'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '13498'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '13498'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '13498'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '13703'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '13733'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '13498'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '13498'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '13498'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '13498'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '13498'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '13498'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '13498'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '13498'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '13498'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '13523'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '13558'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '13578'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '13443' => {
                                       'BaseType' => '4272',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13448' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4192'
                                                           },
                                                    '1' => {
                                                             'type' => '13443'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13478' => {
                                       'BaseType' => '13483',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13483' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '13488' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4192'
                                                           },
                                                    '1' => {
                                                             'type' => '932'
                                                           },
                                                    '2' => {
                                                             'type' => '13478'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13498' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '135' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '13523' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7915'
                                                           },
                                                    '1' => {
                                                             'type' => '7920'
                                                           }
                                                  },
                                       'Return' => '10683',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13553' => {
                                       'BaseType' => '11250',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13558' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6538'
                                                           },
                                                    '1' => {
                                                             'type' => '10683'
                                                           },
                                                    '2' => {
                                                             'type' => '13553'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13578' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10683'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13608' => {
                                       'BaseType' => '7362',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13613' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6338'
                                                           },
                                                    '1' => {
                                                             'type' => '78'
                                                           },
                                                    '2' => {
                                                             'type' => '13608'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13638' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6338'
                                                           },
                                                    '1' => {
                                                             'type' => '78'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13668' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6654'
                                                           },
                                                    '1' => {
                                                             'type' => '10990'
                                                           },
                                                    '2' => {
                                                             'type' => '11331'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13698' => {
                                       'BaseType' => '10910',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13703' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6538'
                                                           },
                                                    '1' => {
                                                             'type' => '10910'
                                                           },
                                                    '2' => {
                                                             'type' => '13698'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13733' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6538'
                                                           },
                                                    '1' => {
                                                             'type' => '10990'
                                                           },
                                                    '2' => {
                                                             'type' => '11331'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '159' => {
                                     'BaseType' => '123',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '183' => {
                                     'BaseType' => '135',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '195' => {
                                     'BaseType' => '109',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '207' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '267' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3791' => {
                                      'Header' => undef,
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3855' => {
                                      'Header' => undef,
                                      'Line' => '106',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3907' => {
                                      'Header' => undef,
                                      'Line' => '155',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '39678' => {
                                       'Header' => undef,
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MANADV_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum manadv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '39800' => {
                                       'Header' => undef,
                                       'Line' => '32',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sq_buf',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'sq_count',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          },
                                                   '2' => {
                                                            'name' => 'sq_size',
                                                            'offset' => '18',
                                                            'type' => '956'
                                                          },
                                                   '3' => {
                                                            'name' => 'sq_id',
                                                            'offset' => '22',
                                                            'type' => '956'
                                                          },
                                                   '4' => {
                                                            'name' => 'tx_vp_offset',
                                                            'offset' => '32',
                                                            'type' => '956'
                                                          },
                                                   '5' => {
                                                            'name' => 'db_page',
                                                            'offset' => '36',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct manadv_qp',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '39892' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'count',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          },
                                                   '2' => {
                                                            'name' => 'cq_id',
                                                            'offset' => '18',
                                                            'type' => '956'
                                                          }
                                                 },
                                       'Name' => 'struct manadv_cq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '39945' => {
                                       'Header' => undef,
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '121'
                                                          },
                                                   '1' => {
                                                            'name' => 'count',
                                                            'offset' => '8',
                                                            'type' => '956'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '18',
                                                            'type' => '956'
                                                          },
                                                   '3' => {
                                                            'name' => 'wq_id',
                                                            'offset' => '22',
                                                            'type' => '956'
                                                          },
                                                   '4' => {
                                                            'name' => 'db_page',
                                                            'offset' => '36',
                                                            'type' => '121'
                                                          }
                                                 },
                                       'Name' => 'struct manadv_rwq',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '40024' => {
                                       'Header' => undef,
                                       'Line' => '56',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6538'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '40059'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '40059' => {
                                       'BaseType' => '39800',
                                       'Name' => 'struct manadv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40064' => {
                                       'Header' => undef,
                                       'Line' => '61',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6338'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '40099'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '40099' => {
                                       'BaseType' => '39892',
                                       'Name' => 'struct manadv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40104' => {
                                       'Header' => undef,
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6853'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '40139'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '40139' => {
                                       'BaseType' => '39945',
                                       'Name' => 'struct manadv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40144' => {
                                       'Header' => undef,
                                       'Line' => '55',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '40024'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '22',
                                                            'type' => '40064'
                                                          },
                                                   '2' => {
                                                            'name' => 'rwq',
                                                            'offset' => '50',
                                                            'type' => '40104'
                                                          }
                                                 },
                                       'Name' => 'struct manadv_obj',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '406' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '4074' => {
                                      'Header' => undef,
                                      'Line' => '2023',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '12778'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '12960'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '612',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '616',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '626',
                                                           'type' => '78'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '640',
                                                           'type' => '788'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '800',
                                                           'type' => '121'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '40950' => {
                                       'BaseType' => '40144',
                                       'Name' => 'struct manadv_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4192' => {
                                      'BaseType' => '4074',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4272' => {
                                      'Header' => undef,
                                      'Line' => '182',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '4806'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '100',
                                                           'type' => '1069'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '278',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '288',
                                                            'type' => '78'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '292',
                                                            'type' => '78'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '296',
                                                            'type' => '78'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '306',
                                                            'type' => '78'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '310',
                                                            'type' => '78'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '320',
                                                            'type' => '78'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '324',
                                                            'type' => '78'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '328',
                                                            'type' => '78'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '338',
                                                            'type' => '78'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '114',
                                                           'type' => '1069'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '342',
                                                            'type' => '78'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '352',
                                                            'type' => '78'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '356',
                                                            'type' => '3907'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '360',
                                                            'type' => '78'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '370',
                                                            'type' => '78'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '374',
                                                            'type' => '78'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '384',
                                                            'type' => '78'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '388',
                                                            'type' => '78'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '392',
                                                            'type' => '78'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '402',
                                                            'type' => '78'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '128',
                                                           'type' => '968'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '406',
                                                            'type' => '78'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '512',
                                                            'type' => '78'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '516',
                                                            'type' => '78'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '520',
                                                            'type' => '78'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '530',
                                                            'type' => '78'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '534',
                                                            'type' => '78'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '544',
                                                            'type' => '78'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '548',
                                                            'type' => '944'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '550',
                                                            'type' => '932'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '551',
                                                            'type' => '932'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '136',
                                                           'type' => '968'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '150',
                                                           'type' => '956'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '256',
                                                           'type' => '956'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '260',
                                                           'type' => '956'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '264',
                                                           'type' => '78'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '274',
                                                           'type' => '78'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '4806' => {
                                      'BaseType' => '267',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '54' => {
                                    'BaseType' => '66',
                                    'Header' => undef,
                                    'Line' => '214',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '6198' => {
                                      'Header' => undef,
                                      'Line' => '1495',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '11452'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '22',
                                                           'type' => '121'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '956'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '40',
                                                           'type' => '78'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '788'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '862'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '288',
                                                           'type' => '956'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '292',
                                                           'type' => '956'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '6338' => {
                                      'BaseType' => '6198',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6343' => {
                                      'Header' => undef,
                                      'Line' => '1270',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '121'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '100',
                                                            'type' => '788'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '260',
                                                            'type' => '862'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '338',
                                                            'type' => '956'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7915'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '36',
                                                           'type' => '6338'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '50',
                                                           'type' => '6338'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '64',
                                                           'type' => '6654'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '72',
                                                           'type' => '956'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '82',
                                                           'type' => '956'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '86',
                                                           'type' => '9590'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '96',
                                                           'type' => '8934'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '6538' => {
                                      'BaseType' => '6343',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6543' => {
                                      'Header' => undef,
                                      'Line' => '1230',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '121'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7915'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '956'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '788'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '862'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '288',
                                                           'type' => '956'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6654' => {
                                      'BaseType' => '6543',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6659' => {
                                      'Header' => undef,
                                      'Line' => '1252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'wq_context',
                                                           'offset' => '8',
                                                           'type' => '121'
                                                         },
                                                  '10' => {
                                                            'name' => 'cond',
                                                            'offset' => '150',
                                                            'type' => '862'
                                                          },
                                                  '11' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '324',
                                                            'type' => '956'
                                                          },
                                                  '12' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '328',
                                                            'type' => '956'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '7915'
                                                         },
                                                  '3' => {
                                                           'name' => 'cq',
                                                           'offset' => '36',
                                                           'type' => '6338'
                                                         },
                                                  '4' => {
                                                           'name' => 'wq_num',
                                                           'offset' => '50',
                                                           'type' => '956'
                                                         },
                                                  '5' => {
                                                           'name' => 'handle',
                                                           'offset' => '54',
                                                           'type' => '956'
                                                         },
                                                  '6' => {
                                                           'name' => 'state',
                                                           'offset' => '64',
                                                           'type' => '8678'
                                                         },
                                                  '7' => {
                                                           'name' => 'wq_type',
                                                           'offset' => '68',
                                                           'type' => '8531'
                                                         },
                                                  '8' => {
                                                           'name' => 'post_recv',
                                                           'offset' => '72',
                                                           'type' => '11336'
                                                         },
                                                  '9' => {
                                                           'name' => 'mutex',
                                                           'offset' => '86',
                                                           'type' => '788'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wq',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '6853' => {
                                      'BaseType' => '6659',
                                      'Name' => 'struct ibv_wq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6900' => {
                                      'Header' => undef,
                                      'Line' => '483',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_LOC_LEN_ERR',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_REM_OP_ERR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_REM_ABORT_ERR',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_INV_EECN_ERR',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_FATAL_ERR',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'IBV_WC_GENERAL_ERR',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'IBV_WC_TM_ERR',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                            'value' => '23'
                                                          },
                                                  '3' => {
                                                           'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_LOC_PROT_ERR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_MW_BIND_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_BAD_RESP_ERR',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_status',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7061' => {
                                      'Header' => undef,
                                      'Line' => '511',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SEND',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_RDMA_WRITE',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_RECV',
                                                            'value' => '128'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                            'value' => '129'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_TM_ADD',
                                                            'value' => '130'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_TM_DEL',
                                                            'value' => '131'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_TM_SYNC',
                                                            'value' => '132'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_TM_RECV',
                                                            'value' => '133'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_TM_NO_TAG',
                                                            'value' => '134'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_DRIVER1',
                                                            'value' => '135'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_DRIVER2',
                                                            'value' => '136'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_DRIVER3',
                                                            'value' => '137'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_RDMA_READ',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WC_COMP_SWAP',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_FETCH_ADD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_BIND_MW',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_LOCAL_INV',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_TSO',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_FLUSH',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_ATOMIC_WRITE',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7329' => {
                                      'Header' => undef,
                                      'Line' => '596',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '1057'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '956'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7362' => {
                                      'Header' => undef,
                                      'Line' => '587',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '968'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '6900'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '66',
                                                            'type' => '944'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '68',
                                                            'type' => '932'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '69',
                                                            'type' => '932'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '18',
                                                           'type' => '7061'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '22',
                                                           'type' => '956'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '32',
                                                           'type' => '956'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '36',
                                                           'type' => '7329'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '40',
                                                           'type' => '956'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '50',
                                                           'type' => '956'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '54',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '64',
                                                           'type' => '944'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7549' => {
                                      'Header' => undef,
                                      'Line' => '623',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '7729'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '968'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '22',
                                                           'type' => '968'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '36',
                                                           'type' => '109'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7618' => {
                                      'Header' => undef,
                                      'Line' => '666',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7915'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '22',
                                                           'type' => '121'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '36',
                                                           'type' => '54'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '50',
                                                           'type' => '956'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '54',
                                                           'type' => '956'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '64',
                                                           'type' => '956'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7729' => {
                                      'BaseType' => '7618',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7734' => {
                                      'Header' => undef,
                                      'Line' => '630',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '956'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '78' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7915' => {
                                      'BaseType' => '7734',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7920' => {
                                      'Header' => undef,
                                      'Line' => '676',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MW_TYPE_1',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MW_TYPE_2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mw_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7949' => {
                                      'Header' => undef,
                                      'Line' => '681',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '4192'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '7915'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '22',
                                                           'type' => '956'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '956'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '36',
                                                           'type' => '7920'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '8531' => {
                                      'Header' => undef,
                                      'Line' => '818',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WQT_RQ',
                                                           'value' => '0'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wq_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8678' => {
                                      'Header' => undef,
                                      'Line' => '846',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WQS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WQS_RDY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_WQS_ERR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WQS_UNKNOWN',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wq_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8934' => {
                                      'Header' => undef,
                                      'Line' => '899',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPT_RC',
                                                           'value' => '2'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPT_UC',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPT_UD',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPT_RAW_PACKET',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPT_XRC_SEND',
                                                           'value' => '9'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPT_XRC_RECV',
                                                           'value' => '10'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPT_DRIVER',
                                                           'value' => '255'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '932' => {
                                     'BaseType' => '159',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '944' => {
                                     'BaseType' => '183',
                                     'Header' => undef,
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '956' => {
                                     'BaseType' => '195',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '9590' => {
                                      'Header' => undef,
                                      'Line' => '1039',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPS_INIT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPS_RTR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPS_RTS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPS_SQD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPS_SQE',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPS_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_QPS_UNKNOWN',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '968' => {
                                     'BaseType' => '207',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libmana.so.1.0.45.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__verbs_log@IBVERBS_PRIVATE_34' => 0,
                                                             '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_34' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_qp_ex2@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_rwq_ind_table@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_rwq_ind_table@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_get_context@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_device_any@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_port@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_reg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'mmap@GLIBC_2.2.5' => 0,
                                                             'munmap@GLIBC_2.2.5' => 0,
                                                             'verbs_register_driver_34@IBVERBS_PRIVATE_34' => 0,
                                                             'verbs_set_ops@IBVERBS_PRIVATE_34' => 0,
                                                             'verbs_uninit_context@IBVERBS_PRIVATE_34' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
