$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.1.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx4.so.1.0.41.0',
          'LibraryVersion' => 'mlx4',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '182050' => {
                                          'Header' => undef,
                                          'Line' => '1051',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'context',
                                                                'type' => '1706'
                                                              },
                                                       '1' => {
                                                                'name' => 'attr',
                                                                'type' => '13294'
                                                              },

                                         'Header' => undef,
                                         'Line' => '388',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ctx_in',
                                                               'type' => '1706'
                                                             },
                                                      '1' => {
                                                               'name' => 'attrs_out',
                                                               'type' => '89362'
                                                             }
                                                    },
                                         'Return' => '64',
                                         'ShortName' => 'mlx4dv_query_device'
                                       },
                            '89368' => {
                                         'Header' => undef,
                                         'Line' => '372',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'obj',
                                                               'type' => '89821'
                                                             },
                                                      '1' => {
                                                               'name' => 'obj_type',
                                                               'type' => '917'
                                                             }
                                                    },
                                         'Return' => '64',
                                         'ShortName' => 'mlx4dv_init_obj'
                                       }
                          },
          'SymbolVersion' => {
                               'mlx4dv_create_qp' => 'mlx4dv_create_qp@@MLX4_1.0',
                               'mlx4dv_init_obj' => 'mlx4dv_init_obj@@MLX4_1.0',
                               'mlx4dv_query_device' => 'mlx4dv_query_device@@MLX4_1.0',
                               'mlx4dv_set_context_attr' => 'mlx4dv_set_context_attr@@MLX4_1.0'
                             },
          'Symbols' => {
                         'libmlx4.so.1.0.41.0' => {
                                                    'mlx4dv_create_qp@@MLX4_1.0' => 1,
                                                    'mlx4dv_init_obj@@MLX4_1.0' => 1,
                                                    'mlx4dv_query_device@@MLX4_1.0' => 1,
                                                    'mlx4dv_set_context_attr@@MLX4_1.0' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10234' => {
                                       'Header' => undef,
                                       'Line' => '1918',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '10418'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '10435'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10297' => {
                                       'BaseType' => '10303',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10303' => {
                                       'Header' => undef,
                                       'Line' => '1928',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '10234'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '16',
                                                            'type' => '1296'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '20',
                                                            'type' => '1363'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '24',
                                                            'type' => '2324'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '88',
                                                            'type' => '2324'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '152',
                                                            'type' => '10441'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '408',
                                                            'type' => '10441'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '104' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '10418' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10297'
                                                           },
                                                    '1' => {
                                                             'type' => '64'
                                                           }
                                                  },
                                       'Return' => '1706',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10435' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1706'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10441' => {
                                       'BaseType' => '211',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '10457' => {
                                       'Header' => undef,
                                       'Line' => '1943',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '10947'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '10989'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '80',
                                                             'type' => '11000'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '88',
                                                             'type' => '11121'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '96',
                                                             'type' => '11147'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '104',
                                                             'type' => '11000'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '112',
                                                             'type' => '11000'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '120',
                                                             'type' => '11000'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '128',
                                                             'type' => '11000'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '136',
                                                             'type' => '11000'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '144',
                                                             'type' => '11000'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '152',
                                                             'type' => '11000'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '16',
                                                            'type' => '11000'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '160',
                                                             'type' => '11178'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '168',
                                                             'type' => '11000'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '176',
                                                             'type' => '11000'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '184',
                                                             'type' => '11000'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '192',
                                                             'type' => '11000'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '200',
                                                             'type' => '11215'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '208',
                                                             'type' => '11246'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '216',
                                                             'type' => '11000'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '224',
                                                             'type' => '11000'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '232',
                                                             'type' => '11000'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '24',
                                                            'type' => '11000'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '240',
                                                             'type' => '11000'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '248',
                                                             'type' => '11000'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '32',
                                                            'type' => '11000'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '40',
                                                            'type' => '11000'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '48',
                                                            'type' => '11000'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '56',
                                                            'type' => '11026'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '64',
                                                            'type' => '11063'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '72',
                                                            'type' => '11084'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '108674' => {
                                        'Header' => undef,
                                        'Line' => '425',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '0',
                                                             'type' => '917'
                                                           },
                                                    '1' => {
                                                             'name' => 'inl_recv_sz',
                                                             'offset' => '8',
                                                             'type' => '905'
                                                           }
                                                  },
                                        'Name' => 'struct mlx4dv_qp_init_attr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '10941' => {
                                       'BaseType' => '1790',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10947' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1706'
                                                           },
                                                    '1' => {
                                                             'type' => '10941'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10978' => {
                                       'BaseType' => '10984',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10984' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '10989' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1706'
                                                           },
                                                    '1' => {
                                                             'type' => '881'
                                                           },
                                                    '2' => {
                                                             'type' => '10978'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11000' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '197',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11026' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5293'
                                                           },
                                                    '1' => {
                                                             'type' => '5299'
                                                           }
                                                  },
                                       'Return' => '7399',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11057' => {
                                       'BaseType' => '7984',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11063' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4072'
                                                           },
                                                    '1' => {
                                                             'type' => '7399'
                                                           },
                                                    '2' => {
                                                             'type' => '11057'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11084' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7399'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11115' => {
                                       'BaseType' => '4726',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11121' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3870'
                                                           },
                                                    '1' => {
                                                             'type' => '64'
                                                           },
                                                    '2' => {
                                                             'type' => '11115'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11147' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3870'
                                                           },
                                                    '1' => {
                                                             'type' => '64'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '111768' => {
                                        'BaseType' => '108674',
                                        'Name' => 'struct mlx4dv_qp_init_attr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11178' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4190'
                                                           },
                                                    '1' => {
                                                             'type' => '7716'
                                                           },
                                                    '2' => {
                                                             'type' => '8066'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11209' => {
                                       'BaseType' => '7633',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11215' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4072'
                                                           },
                                                    '1' => {
                                                             'type' => '7633'
                                                           },
                                                    '2' => {
                                                             'type' => '11209'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11246' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4072'
                                                           },
                                                    '1' => {
                                                             'type' => '7716'
                                                           },
                                                    '2' => {
                                                             'type' => '8066'
                                                           }
                                                  },
                                       'Return' => '64',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '118' => {
                                     'BaseType' => '97',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1296' => {
                                      'Header' => undef,
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '13294' => {
                                       'BaseType' => '6322',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13326' => {
                                       'BaseType' => '905',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1363' => {
                                      'Header' => undef,
                                      'Line' => '106',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '13650' => {
                                       'BaseType' => '965',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '137' => {
                                     'BaseType' => '104',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '1418' => {
                                      'Header' => undef,
                                      'Line' => '155',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '149' => {
                                     'BaseType' => '76',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1587' => {
                                      'Header' => undef,
                                      'Line' => '1986',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '10297'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '10457'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '264',
                                                           'type' => '64'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '268',
                                                           'type' => '64'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '272',
                                                           'type' => '64'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '280',
                                                           'type' => '762'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '320',
                                                           'type' => '197'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '161' => {
                                     'BaseType' => '57',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1706' => {
                                      'BaseType' => '1587',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '173' => {
                                     'BaseType' => '83',
                                     'Header' => undef,
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1790' => {
                                      'Header' => undef,
                                      'Line' => '182',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '2324'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '64',
                                                           'type' => '977'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '116',
                                                            'type' => '76'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '120',
                                                            'type' => '64'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '124',
                                                            'type' => '64'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '128',
                                                            'type' => '64'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '132',
                                                            'type' => '64'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '136',
                                                            'type' => '64'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '140',
                                                            'type' => '64'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '144',
                                                            'type' => '64'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '148',
                                                            'type' => '64'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '152',
                                                            'type' => '64'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '72',
                                                           'type' => '977'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '156',
                                                            'type' => '64'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '160',
                                                            'type' => '64'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '164',
                                                            'type' => '1418'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '168',
                                                            'type' => '64'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '172',
                                                            'type' => '64'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '176',
                                                            'type' => '64'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '180',
                                                            'type' => '64'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '184',
                                                            'type' => '64'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '188',
                                                            'type' => '64'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '192',
                                                            'type' => '64'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '80',
                                                           'type' => '917'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '196',
                                                            'type' => '64'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '200',
                                                            'type' => '64'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '204',
                                                            'type' => '64'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '208',
                                                            'type' => '64'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '212',
                                                            'type' => '64'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '216',
                                                            'type' => '64'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '220',
                                                            'type' => '64'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '224',
                                                            'type' => '893'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '226',
                                                            'type' => '881'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '227',
                                                            'type' => '881'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '88',
                                                           'type' => '917'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '96',
                                                           'type' => '905'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '100',
                                                           'type' => '905'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '104',
                                                           'type' => '905'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '108',
                                                           'type' => '64'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '112',
                                                           'type' => '64'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '197' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '211' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '218' => {
                                     'BaseType' => '173',
                                     'Header' => undef,
                                     'Line' => '85',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2324' => {
                                      'BaseType' => '211',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '3729' => {
                                      'Header' => undef,
                                      'Line' => '1458',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '8940'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '16',
                                                           'type' => '197'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '24',
                                                           'type' => '905'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '28',
                                                           'type' => '64'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '32',
                                                           'type' => '762'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '72',
                                                           'type' => '836'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '120',
                                                           'type' => '905'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '124',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '3870' => {
                                      'BaseType' => '3729',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3876' => {
                                      'Header' => undef,
                                      'Line' => '1252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '197'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '64',
                                                            'type' => '762'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '104',
                                                            'type' => '836'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '152',
                                                            'type' => '905'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '5293'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '24',
                                                           'type' => '3870'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '32',
                                                           'type' => '3870'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '40',
                                                           'type' => '4190'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '48',
                                                           'type' => '905'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '52',
                                                           'type' => '905'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '56',
                                                           'type' => '6651'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '60',
                                                           'type' => '6098'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '4072' => {
                                      'BaseType' => '3876',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4078' => {
                                      'Header' => undef,
                                      'Line' => '1212',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '197'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '5293'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '24',
                                                           'type' => '905'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '32',
                                                           'type' => '762'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '72',
                                                           'type' => '836'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '120',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '4190' => {
                                      'BaseType' => '4078',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4196' => {
                                      'Header' => undef,
                                      'Line' => '1234',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'wq_context',
                                                           'offset' => '8',
                                                           'type' => '197'
                                                         },
                                                  '10' => {
                                                            'name' => 'cond',
                                                            'offset' => '96',
                                                            'type' => '836'
                                                          },
                                                  '11' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '144',
                                                            'type' => '905'
                                                          },
                                                  '12' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '148',
                                                            'type' => '905'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '5293'
                                                         },
                                                  '3' => {
                                                           'name' => 'cq',
                                                           'offset' => '24',
                                                           'type' => '3870'
                                                         },
                                                  '4' => {
                                                           'name' => 'wq_num',
                                                           'offset' => '32',
                                                           'type' => '905'
                                                         },
                                                  '5' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '905'
                                                         },
                                                  '6' => {
                                                           'name' => 'state',
                                                           'offset' => '40',
                                                           'type' => '5835'
                                                         },
                                                  '7' => {
                                                           'name' => 'wq_type',
                                                           'offset' => '44',
                                                           'type' => '5684'
                                                         },
                                                  '8' => {
                                                           'name' => 'post_recv',
                                                           'offset' => '48',
                                                           'type' => '8072'
                                                         },
                                                  '9' => {
                                                           'name' => 'mutex',
                                                           'offset' => '56',
                                                           'type' => '762'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wq',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '4391' => {
                                      'BaseType' => '4196',
                                      'Name' => 'struct ibv_wq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4397' => {
                                      'Header' => undef,
                                      'Line' => '483',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_LOC_LEN_ERR',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_REM_OP_ERR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_REM_ABORT_ERR',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_INV_EECN_ERR',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_FATAL_ERR',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'IBV_WC_GENERAL_ERR',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'IBV_WC_TM_ERR',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                            'value' => '23'
                                                          },
                                                  '3' => {
                                                           'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_LOC_PROT_ERR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_MW_BIND_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_BAD_RESP_ERR',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_status',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '45' => {
                                    'BaseType' => '57',
                                    'Header' => undef,
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4561' => {
                                      'Header' => undef,
                                      'Line' => '511',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SEND',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_RDMA_WRITE',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_TM_ADD',
                                                            'value' => '130'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_TM_DEL',
                                                            'value' => '131'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_TM_SYNC',
                                                            'value' => '132'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_TM_RECV',
                                                            'value' => '133'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_TM_NO_TAG',
                                                            'value' => '134'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_DRIVER1',
                                                            'value' => '135'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_DRIVER2',
                                                            'value' => '136'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_DRIVER3',
                                                            'value' => '137'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_RDMA_READ',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WC_COMP_SWAP',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_FETCH_ADD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_BIND_MW',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_LOCAL_INV',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_TSO',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_RECV',
                                                           'value' => '128'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                           'value' => '129'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4689' => {
                                      'Header' => undef,
                                      'Line' => '594',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '965'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '4726' => {
                                      'Header' => undef,
                                      'Line' => '585',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '4397'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '42',
                                                            'type' => '893'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '44',
                                                            'type' => '881'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '45',
                                                            'type' => '881'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '12',
                                                           'type' => '4561'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '16',
                                                           'type' => '905'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '20',
                                                           'type' => '905'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '24',
                                                           'type' => '4689'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '28',
                                                           'type' => '905'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '32',
                                                           'type' => '905'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '36',
                                                           'type' => '76'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '40',
                                                           'type' => '893'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '4914' => {
                                      'Header' => undef,
                                      'Line' => '619',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '5101'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '917'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '16',
                                                           'type' => '917'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '24',
                                                           'type' => '76'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '4989' => {
                                      'Header' => undef,
                                      'Line' => '662',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '5293'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '16',
                                                           'type' => '197'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '45'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '905'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '36',
                                                           'type' => '905'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '40',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '5101' => {
                                      'BaseType' => '4989',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5107' => {
                                      'Header' => undef,
                                      'Line' => '626',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '516' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '5264' => {
                                      'Header' => undef,
                                      'Line' => '651',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         }
                                                },
                                      'Name' => 'struct ibv_xrcd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '5293' => {
                                      'BaseType' => '5107',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5299' => {
                                      'Header' => undef,
                                      'Line' => '672',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MW_TYPE_1',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MW_TYPE_2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mw_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5331' => {
                                      'Header' => undef,
                                      'Line' => '677',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '5293'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '16',
                                                           'type' => '905'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '20',
                                                           'type' => '905'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '24',
                                                           'type' => '5299'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '5678' => {
                                      'BaseType' => '5264',
                                      'Name' => 'struct ibv_xrcd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5684' => {
                                      'Header' => undef,
                                      'Line' => '814',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WQT_RQ',
                                                           'value' => '0'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wq_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '57' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5835' => {
                                      'Header' => undef,
                                      'Line' => '842',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WQS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WQS_RDY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_WQS_ERR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WQS_UNKNOWN',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wq_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5964' => {
                                      'Header' => undef,
                                      'Line' => '874',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'ind_tbl_handle',
                                                           'offset' => '8',
                                                           'type' => '64'
                                                         },
                                                  '2' => {
                                                           'name' => 'ind_tbl_num',
                                                           'offset' => '12',
                                                           'type' => '64'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '16',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rwq_ind_table',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '6098' => {
                                      'Header' => undef,
                                      'Line' => '895',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPT_RC',
                                                           'value' => '2'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPT_UC',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPT_UD',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPT_RAW_PACKET',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPT_XRC_SEND',
                                                           'value' => '9'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPT_XRC_RECV',
                                                           'value' => '10'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPT_DRIVER',
                                                           'value' => '255'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6160' => {
                                      'Header' => undef,
                                      'Line' => '905',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max_send_wr',
                                                           'offset' => '0',
                                                           'type' => '905'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_recv_wr',
                                                           'offset' => '4',
                                                           'type' => '905'
                                                         },
                                                  '2' => {
                                                           'name' => 'max_send_sge',
                                                           'offset' => '8',
                                                           'type' => '905'
                                                         },
                                                  '3' => {
                                                           'name' => 'max_recv_sge',
                                                           'offset' => '12',
                                                           'type' => '905'
                                                         },
                                                  '4' => {
                                                           'name' => 'max_inline_data',
                                                           'offset' => '16',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_cap',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '6245' => {
                                      'Header' => undef,
                                      'Line' => '955',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rx_hash_function',
                                                           'offset' => '0',
                                                           'type' => '881'
                                                         },
                                                  '1' => {
                                                           'name' => 'rx_hash_key_len',
                                                           'offset' => '1',
                                                           'type' => '881'
                                                         },
                                                  '2' => {
                                                           'name' => 'rx_hash_key',
                                                           'offset' => '8',
                                                           'type' => '6316'
                                                         },
                                                  '3' => {
                                                           'name' => 'rx_hash_fields_mask',
                                                           'offset' => '16',
                                                           'type' => '917'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rx_hash_conf',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '6316' => {
                                      'BaseType' => '881',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6322' => {
                                      'Header' => undef,
                                      'Line' => '964',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '197'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '3870'
                                                         },
                                                  '10' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '80',
                                                            'type' => '905'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_tso_header',
                                                            'offset' => '84',
                                                            'type' => '893'
                                                          },
                                                  '12' => {
                                                            'name' => 'rwq_ind_tbl',
                                                            'offset' => '88',
                                                            'type' => '6560'
                                                          },
                                                  '13' => {
                                                            'name' => 'rx_hash_conf',
                                                            'offset' => '96',
                                                            'type' => '6245'
                                                          },
                                                  '14' => {
                                                            'name' => 'source_qpn',
                                                            'offset' => '120',
                                                            'type' => '905'
                                                          },
                                                  '15' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '128',
                                                            'type' => '917'
                                                          },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '16',
                                                           'type' => '3870'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '24',
                                                           'type' => '4190'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '32',
                                                           'type' => '6160'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '52',
                                                           'type' => '6098'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '56',
                                                           'type' => '64'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '60',
                                                           'type' => '905'
                                                         },
                                                  '8' => {
                                                           'name' => 'pd',
                                                           'offset' => '64',
                                                           'type' => '5293'
                                                         },
                                                  '9' => {
                                                           'name' => 'xrcd',
                                                           'offset' => '72',
                                                           'type' => '5678'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr_ex',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '64' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6560' => {
                                      'BaseType' => '5964',
                                      'Name' => 'struct ibv_rwq_ind_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6651' => {
                                      'Header' => undef,
                                      'Line' => '1033',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPS_INIT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPS_RTR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPS_RTS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPS_SQD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPS_SQE',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPS_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_QPS_UNKNOWN',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6790' => {
                                      'Header' => undef,
                                      'Line' => '1086',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WR_TSO',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WR_DRIVER1',
                                                            'value' => '11'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WR_SEND',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WR_SEND_WITH_IMM',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WR_RDMA_READ',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WR_LOCAL_INV',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WR_BIND_MW',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WR_SEND_WITH_INV',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wr_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6930' => {
                                      'Header' => undef,
                                      'Line' => '1114',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'addr',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '905'
                                                         },
                                                  '2' => {
                                                           'name' => 'lkey',
                                                           'offset' => '12',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_sge',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6992' => {
                                      'Header' => undef,
                                      'Line' => '1130',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '965'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidate_rkey',
                                                           'offset' => '0',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7029' => {
                                      'Header' => undef,
                                      'Line' => '1135',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_addr',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7068' => {
                                      'Header' => undef,
                                      'Line' => '1139',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_addr',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'compare_add',
                                                           'offset' => '8',
                                                           'type' => '917'
                                                         },
                                                  '2' => {
                                                           'name' => 'swap',
                                                           'offset' => '16',
                                                           'type' => '917'
                                                         },
                                                  '3' => {
                                                           'name' => 'rkey',
                                                           'offset' => '24',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7135' => {
                                      'Header' => undef,
                                      'Line' => '1145',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ah',
                                                           'offset' => '0',
                                                           'type' => '7243'
                                                         },
                                                  '1' => {
                                                           'name' => 'remote_qpn',
                                                           'offset' => '8',
                                                           'type' => '905'
                                                         },
                                                  '2' => {
                                                           'name' => 'remote_qkey',
                                                           'offset' => '12',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7187' => {
                                      'Header' => undef,
                                      'Line' => '1645',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '5293'
                                                         },
                                                  '2' => {
                                                           'name' => 'handle',
                                                           'offset' => '16',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Name' => 'struct ibv_ah',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7243' => {
                                      'BaseType' => '7187',
                                      'Name' => 'struct ibv_ah*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7249' => {
                                      'Header' => undef,
                                      'Line' => '1134',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rdma',
                                                           'offset' => '0',
                                                           'type' => '7029'
                                                         },
                                                  '1' => {
                                                           'name' => 'atomic',
                                                           'offset' => '0',
                                                           'type' => '7068'
                                                         },
                                                  '2' => {
                                                           'name' => 'ud',
                                                           'offset' => '0',
                                                           'type' => '7135'
                                                         }
                                                },
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '7298' => {
                                      'Header' => undef,
                                      'Line' => '1152',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_srqn',
                                                           'offset' => '0',
                                                           'type' => '905'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7323' => {
                                      'Header' => undef,
                                      'Line' => '1151',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'xrc',
                                                           'offset' => '0',
                                                           'type' => '7298'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7347' => {
                                      'Header' => undef,
                                      'Line' => '1157',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mw',
                                                           'offset' => '0',
                                                           'type' => '7399'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '905'
                                                         },
                                                  '2' => {
                                                           'name' => 'bind_info',
                                                           'offset' => '16',
                                                           'type' => '4914'
                                                         }
                                                },
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7399' => {
                                      'BaseType' => '5331',
                                      'Name' => 'struct ibv_mw*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7405' => {
                                      'Header' => undef,
                                      'Line' => '1162',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'hdr',
                                                           'offset' => '0',
                                                           'type' => '197'
                                                         },
                                                  '1' => {
                                                           'name' => 'hdr_sz',
                                                           'offset' => '8',
                                                           'type' => '893'
                                                         },
                                                  '2' => {
                                                           'name' => 'mss',
                                                           'offset' => '10',
                                                           'type' => '893'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7458' => {
                                      'Header' => undef,
                                      'Line' => '1156',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bind_mw',
                                                           'offset' => '0',
                                                           'type' => '7347'
                                                         },
                                                  '1' => {
                                                           'name' => 'tso',
                                                           'offset' => '0',
                                                           'type' => '7405'
                                                         }
                                                },
                                      'Size' => '48',
                                      'Type' => 'Union'
                                    },
                          '7495' => {
                                      'Header' => undef,
                                      'Line' => '1120',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '7633'
                                                         },
                                                  '2' => {
                                                           'name' => 'sg_list',
                                                           'offset' => '16',
                                                           'type' => '7639'
                                                         },
                                                  '3' => {
                                                           'name' => 'num_sge',
                                                           'offset' => '24',
                                                           'type' => '64'
                                                         },
                                                  '4' => {
                                                           'name' => 'opcode',
                                                           'offset' => '28',
                                                           'type' => '6790'
                                                         },
                                                  '5' => {
                                                           'name' => 'send_flags',
                                                           'offset' => '32',
                                                           'type' => '76'
                                                         },
                                                  '6' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '36',
                                                           'type' => '6992'
                                                         },
                                                  '7' => {
                                                           'name' => 'wr',
                                                           'offset' => '40',
                                                           'type' => '7249'
                                                         },
                                                  '8' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '72',
                                                           'type' => '7323'
                                                         },
                                                  '9' => {
                                                           'name' => 'unnamed1',
                                                           'offset' => '80',
                                                           'type' => '7458'
                                                         }
                                                },
                                      'Name' => 'struct ibv_send_wr',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '76' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7633' => {
                                      'BaseType' => '7495',
                                      'Name' => 'struct ibv_send_wr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7639' => {
                                      'BaseType' => '6930',
                                      'Name' => 'struct ibv_sge*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7645' => {
                                      'Header' => undef,
                                      'Line' => '1170',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '7716'
                                                         },
                                                  '2' => {
                                                           'name' => 'sg_list',
                                                           'offset' => '16',
                                                           'type' => '7639'
                                                         },
                                                  '3' => {
                                                           'name' => 'num_sge',
                                                           'offset' => '24',
                                                           'type' => '64'
                                                         }
                                                },
                                      'Name' => 'struct ibv_recv_wr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7716' => {
                                      'BaseType' => '7645',
                                      'Name' => 'struct ibv_recv_wr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7984' => {
                                      'Header' => undef,
                                      'Line' => '1206',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '917'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_flags',
                                                           'offset' => '8',
                                                           'type' => '76'
                                                         },
                                                  '2' => {
                                                           'name' => 'bind_info',
                                                           'offset' => '16',
                                                           'type' => '4914'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '8066' => {
                                      'BaseType' => '7716',
                                      'Name' => 'struct ibv_recv_wr**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8072' => {
                                      'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4391'
                                                          },
                                                   '1' => {
                                                            'type' => '7716'
                                                          },
                                                   '2' => {
                                                            'type' => '8066'
                                                          }
                                                 },
                                      'Return' => '64',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '83' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '83900' => {
                                       'Header' => undef,
                                       'Line' => '161',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '905'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '64'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '64'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '83949' => {
                                       'Header' => undef,
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '905'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '64'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '64'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '83998' => {
                                       'Header' => undef,
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '197'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '45'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84034' => {
                                       'Header' => undef,
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdb',
                                                            'offset' => '0',
                                                            'type' => '13650'
                                                          },
                                                   '1' => {
                                                            'name' => 'sdb',
                                                            'offset' => '8',
                                                            'type' => '13326'
                                                          },
                                                   '2' => {
                                                            'name' => 'doorbell_qpn',
                                                            'offset' => '16',
                                                            'type' => '965'
                                                          },
                                                   '3' => {
                                                            'name' => 'sq',
                                                            'offset' => '20',
                                                            'type' => '83900'
                                                          },
                                                   '4' => {
                                                            'name' => 'rq',
                                                            'offset' => '32',
                                                            'type' => '83949'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '48',
                                                            'type' => '83998'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '917'
                                                          },
                                                   '7' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '72',
                                                            'type' => '218'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_qp',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '84181' => {
                                       'Header' => undef,
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '197'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '45'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84217' => {
                                       'Header' => undef,
                                       'Line' => '183',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '84181'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '16',
                                                            'type' => '905'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqn',
                                                            'offset' => '20',
                                                            'type' => '905'
                                                          },
                                                   '3' => {
                                                            'name' => 'set_ci_db',
                                                            'offset' => '24',
                                                            'type' => '13650'
                                                          },
                                                   '4' => {
                                                            'name' => 'arm_db',
                                                            'offset' => '32',
                                                            'type' => '13650'
                                                          },
                                                   '5' => {
                                                            'name' => 'arm_sn',
                                                            'offset' => '40',
                                                            'type' => '64'
                                                          },
                                                   '6' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '44',
                                                            'type' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '917'
                                                          },
                                                   '8' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '56',
                                                            'type' => '197'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_cq',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '84348' => {
                                       'Header' => undef,
                                       'Line' => '199',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '197'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '45'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84384' => {
                                       'Header' => undef,
                                       'Line' => '198',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '84348'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '16',
                                                            'type' => '64'
                                                          },
                                                   '2' => {
                                                            'name' => 'head',
                                                            'offset' => '20',
                                                            'type' => '64'
                                                          },
                                                   '3' => {
                                                            'name' => 'tail',
                                                            'offset' => '24',
                                                            'type' => '64'
                                                          },
                                                   '4' => {
                                                            'name' => 'db',
                                                            'offset' => '32',
                                                            'type' => '13650'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '917'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '84475' => {
                                       'Header' => undef,
                                       'Line' => '212',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '905'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '64'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '64'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '84524' => {
                                       'Header' => undef,
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '197'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '45'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84560' => {
                                       'Header' => undef,
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdb',
                                                            'offset' => '0',
                                                            'type' => '13650'
                                                          },
                                                   '1' => {
                                                            'name' => 'rq',
                                                            'offset' => '8',
                                                            'type' => '84475'
                                                          },
                                                   '2' => {
                                                            'name' => 'buf',
                                                            'offset' => '24',
                                                            'type' => '84524'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '917'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_rwq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '84625' => {
                                       'Header' => undef,
                                       'Line' => '225',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4072'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '84660'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84660' => {
                                       'BaseType' => '84034',
                                       'Name' => 'struct mlx4dv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84666' => {
                                       'Header' => undef,
                                       'Line' => '229',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '3870'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '84701'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84701' => {
                                       'BaseType' => '84217',
                                       'Name' => 'struct mlx4dv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84707' => {
                                       'Header' => undef,
                                       'Line' => '233',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4190'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '84742'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84742' => {
                                       'BaseType' => '84384',
                                       'Name' => 'struct mlx4dv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84748' => {
                                       'Header' => undef,
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4391'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '84783'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84783' => {
                                       'BaseType' => '84560',
                                       'Name' => 'struct mlx4dv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84789' => {
                                       'Header' => undef,
                                       'Line' => '224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '84625'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '16',
                                                            'type' => '84666'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '32',
                                                            'type' => '84707'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '48',
                                                            'type' => '84748'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_obj',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '84918' => {
                                       'Header' => undef,
                                       'Line' => '437',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '881'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_inl_recv_sz',
                                                            'offset' => '4',
                                                            'type' => '905'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '917'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_context',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '84975' => {
                                       'Header' => undef,
                                       'Line' => '539',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX4DV_SET_CTX_ATTR_LOG_WQS_RANGE_SZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX4DV_SET_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx4dv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '881' => {
                                     'BaseType' => '118',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '8884' => {
                                      'Header' => undef,
                                      'Line' => '1452',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1706'
                                                         },
                                                  '1' => {
                                                           'name' => 'fd',
                                                           'offset' => '8',
                                                           'type' => '64'
                                                         },
                                                  '2' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '12',
                                                           'type' => '64'
                                                         }
                                                },
                                      'Name' => 'struct ibv_comp_channel',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '893' => {
                                     'BaseType' => '137',
                                     'Header' => undef,
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '89362' => {
                                       'BaseType' => '84918',
                                       'Name' => 'struct mlx4dv_context*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8940' => {
                                      'BaseType' => '8884',
                                      'Name' => 'struct ibv_comp_channel*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '89821' => {
                                       'BaseType' => '84789',
                                       'Name' => 'struct mlx4dv_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '905' => {
                                     'BaseType' => '149',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '917' => {
                                     'BaseType' => '161',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '941' => {
                                     'BaseType' => '76',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => '__u32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '953' => {
                                     'BaseType' => '516',
                                     'Header' => undef,
                                     'Line' => '31',
                                     'Name' => '__u64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '965' => {
                                     'BaseType' => '941',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => '__be32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '97' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '977' => {
                                     'BaseType' => '953',
                                     'Header' => undef,
                                     'Line' => '29',
                                     'Name' => '__be64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libmlx4.so.1.0.41.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__printf_chk@GLIBC_2.3.4' => 0,
                                                             '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_34' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'ibv_cmd_alloc_mw@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_attach_mcast@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_close_xrcd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_cq_ex@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_flow@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_qp_ex2@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_qp_ex@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_rwq_ind_table@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_srq_ex@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dealloc_mw@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_flow@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_rwq_ind_table@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_detach_mcast@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_get_context@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_open_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_open_xrcd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_device_any@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_port@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_reg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_rereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_resize_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_dofork_range@IBVERBS_1.1' => 0,
                                                             'ibv_dontfork_range@IBVERBS_1.1' => 0,
                                                             'ibv_query_device@IBVERBS_1.1' => 0,
                                                             'ibv_query_gid@IBVERBS_1.1' => 0,
                                                             'ibv_query_port@IBVERBS_1.1' => 0,
                                                             'ibv_resolve_eth_l2_from_gid@IBVERBS_1.1' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'mmap@GLIBC_2.2.5' => 0,
                                                             'munmap@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_init@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_unlock@GLIBC_2.2.5' => 0,
                                                             'stderr@GLIBC_2.2.5' => 0,
                                                             'sysconf@GLIBC_2.2.5' => 0,
                                                             'verbs_register_driver_34@IBVERBS_PRIVATE_34' => 0,
                                                             'verbs_set_ops@IBVERBS_PRIVATE_34' => 0,
                                                             'verbs_uninit_context@IBVERBS_PRIVATE_34' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
