$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.1.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx4.so.1.0.46.0',
          'LibraryVersion' => 'mlx4',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '177965' => {
                                          'Header' => undef,
                                          'Line' => '1051',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'context',
                                                                'type' => '1699'
                                                              },
                                                       '1' => {
                                                                'name' => 'attr',
                                                                'type' => '13046'
                                                              },
                                                       '2' => {

                                         'Header' => undef,
                                         'Line' => '388',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ctx_in',
                                                               'type' => '1699'
                                                             },
                                                      '1' => {
                                                               'name' => 'attrs_out',
                                                               'type' => '87551'
                                                             }
                                                    },
                                         'Return' => '70',
                                         'ShortName' => 'mlx4dv_query_device'
                                       },
                            '87556' => {
                                         'Header' => undef,
                                         'Line' => '372',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'obj',
                                                               'type' => '88000'
                                                             },
                                                      '1' => {
                                                               'name' => 'obj_type',
                                                               'type' => '957'
                                                             }
                                                    },
                                         'Return' => '70',
                                         'ShortName' => 'mlx4dv_init_obj'
                                       }
                          },
          'SymbolVersion' => {
                               'mlx4dv_create_qp' => 'mlx4dv_create_qp@@MLX4_1.0',
                               'mlx4dv_init_obj' => 'mlx4dv_init_obj@@MLX4_1.0',
                               'mlx4dv_query_device' => 'mlx4dv_query_device@@MLX4_1.0',
                               'mlx4dv_set_context_attr' => 'mlx4dv_set_context_attr@@MLX4_1.0'
                             },
          'Symbols' => {
                         'libmlx4.so.1.0.46.0' => {
                                                    'mlx4dv_create_qp@@MLX4_1.0' => 1,
                                                    'mlx4dv_init_obj@@MLX4_1.0' => 1,
                                                    'mlx4dv_query_device@@MLX4_1.0' => 1,
                                                    'mlx4dv_set_context_attr@@MLX4_1.0' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1005' => {
                                      'BaseType' => '981',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '10090' => {
                                       'Header' => undef,
                                       'Line' => '1964',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '10269'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '10285'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10152' => {
                                       'BaseType' => '10157',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10157' => {
                                       'Header' => undef,
                                       'Line' => '1974',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '10090'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '1305'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '1369'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '2313'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '2313'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '10290'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '10290'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '1017' => {
                                      'BaseType' => '993',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '10269' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10152'
                                                           },
                                                    '1' => {
                                                             'type' => '70'
                                                           }
                                                  },
                                       'Return' => '1699',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10285' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1699'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10290' => {
                                       'BaseType' => '257',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '10306' => {
                                       'Header' => undef,
                                       'Line' => '1989',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '10793'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '10833'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '10843'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '10958'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '10983'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '10843'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '10843'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '10843'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '10843'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '10843'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '10843'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '10843'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '10843'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '11013'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '10843'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '10843'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '10843'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '10843'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '11048'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '11078'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '10843'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '10843'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '10843'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '10843'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '10843'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '10843'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '10843'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '10843'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '10843'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '10868'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '10903'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '10923'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '106609' => {
                                        'Header' => undef,
                                        'Line' => '425',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'comp_mask',
                                                             'offset' => '0',
                                                             'type' => '957'
                                                           },
                                                    '1' => {
                                                             'name' => 'inl_recv_sz',
                                                             'offset' => '8',
                                                             'type' => '945'
                                                           }
                                                  },
                                        'Name' => 'struct mlx4dv_qp_init_attr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '10788' => {
                                       'BaseType' => '1779',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10793' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1699'
                                                           },
                                                    '1' => {
                                                             'type' => '10788'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10823' => {
                                       'BaseType' => '10828',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10828' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '10833' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1699'
                                                           },
                                                    '1' => {
                                                             'type' => '921'
                                                           },
                                                    '2' => {
                                                             'type' => '10823'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10843' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '243',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10868' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5219'
                                                           },
                                                    '1' => {
                                                             'type' => '5224'
                                                           }
                                                  },
                                       'Return' => '7257',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10898' => {
                                       'BaseType' => '7816',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10903' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4019'
                                                           },
                                                    '1' => {
                                                             'type' => '7257'
                                                           },
                                                    '2' => {
                                                             'type' => '10898'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10923' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7257'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10953' => {
                                       'BaseType' => '4665',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10958' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3821'
                                                           },
                                                    '1' => {
                                                             'type' => '70'
                                                           },
                                                    '2' => {
                                                             'type' => '10953'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '109639' => {
                                        'BaseType' => '106609',
                                        'Name' => 'struct mlx4dv_qp_init_attr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '10983' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3821'
                                                           },
                                                    '1' => {
                                                             'type' => '70'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11013' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4134'
                                                           },
                                                    '1' => {
                                                             'type' => '7560'
                                                           },
                                                    '2' => {
                                                             'type' => '7897'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11043' => {
                                       'BaseType' => '7480',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11048' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4019'
                                                           },
                                                    '1' => {
                                                             'type' => '7480'
                                                           },
                                                    '2' => {
                                                             'type' => '11043'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11078' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4019'
                                                           },
                                                    '1' => {
                                                             'type' => '7560'
                                                           },
                                                    '2' => {
                                                             'type' => '7897'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '111' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '123' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '13046' => {
                                       'BaseType' => '6209',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1305' => {
                                      'Header' => undef,
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '13076' => {
                                       'BaseType' => '945',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13383' => {
                                       'BaseType' => '1005',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '135' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1369' => {
                                      'Header' => undef,
                                      'Line' => '106',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1421' => {
                                      'Header' => undef,
                                      'Line' => '155',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1588' => {
                                      'Header' => undef,
                                      'Line' => '2032',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '10152'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '10306'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '612',
                                                           'type' => '70'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '616',
                                                           'type' => '70'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '626',
                                                           'type' => '70'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '640',
                                                           'type' => '771'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '800',
                                                           'type' => '243'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '159' => {
                                     'BaseType' => '111',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1699' => {
                                      'BaseType' => '1588',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1779' => {
                                      'Header' => undef,
                                      'Line' => '182',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '2313'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '100',
                                                           'type' => '1017'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '278',
                                                            'type' => '135'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '288',
                                                            'type' => '70'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '292',
                                                            'type' => '70'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '296',
                                                            'type' => '70'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '306',
                                                            'type' => '70'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '310',
                                                            'type' => '70'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '320',
                                                            'type' => '70'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '324',
                                                            'type' => '70'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '328',
                                                            'type' => '70'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '338',
                                                            'type' => '70'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '114',
                                                           'type' => '1017'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '342',
                                                            'type' => '70'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '352',
                                                            'type' => '70'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '356',
                                                            'type' => '1421'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '360',
                                                            'type' => '70'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '370',
                                                            'type' => '70'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '374',
                                                            'type' => '70'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '384',
                                                            'type' => '70'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '388',
                                                            'type' => '70'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '392',
                                                            'type' => '70'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '402',
                                                            'type' => '70'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '128',
                                                           'type' => '957'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '406',
                                                            'type' => '70'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '512',
                                                            'type' => '70'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '516',
                                                            'type' => '70'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '520',
                                                            'type' => '70'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '530',
                                                            'type' => '70'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '534',
                                                            'type' => '70'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '544',
                                                            'type' => '70'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '548',
                                                            'type' => '933'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '550',
                                                            'type' => '921'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '551',
                                                            'type' => '921'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '136',
                                                           'type' => '957'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '150',
                                                           'type' => '945'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '256',
                                                           'type' => '945'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '260',
                                                           'type' => '945'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '264',
                                                           'type' => '70'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '274',
                                                           'type' => '70'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '183' => {
                                     'BaseType' => '123',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '195' => {
                                     'BaseType' => '135',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '207' => {
                                     'BaseType' => '58',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '219' => {
                                     'BaseType' => '87',
                                     'Header' => undef,
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2313' => {
                                      'BaseType' => '257',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '243' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '257' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '269' => {
                                     'BaseType' => '219',
                                     'Header' => undef,
                                     'Line' => '85',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3682' => {
                                      'Header' => undef,
                                      'Line' => '1504',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '8835'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '22',
                                                           'type' => '243'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '945'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '40',
                                                           'type' => '70'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '771'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '844'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '288',
                                                           'type' => '945'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '292',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '3821' => {
                                      'BaseType' => '3682',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3826' => {
                                      'Header' => undef,
                                      'Line' => '1279',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '243'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '100',
                                                            'type' => '771'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '260',
                                                            'type' => '844'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '338',
                                                            'type' => '945'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '5219'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '36',
                                                           'type' => '3821'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '50',
                                                           'type' => '3821'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '64',
                                                           'type' => '4134'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '72',
                                                           'type' => '945'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '82',
                                                           'type' => '945'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '86',
                                                           'type' => '6532'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '96',
                                                           'type' => '5992'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '390' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '4019' => {
                                      'BaseType' => '3826',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4024' => {
                                      'Header' => undef,
                                      'Line' => '1239',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '243'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '5219'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '945'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '50',
                                                           'type' => '771'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '114',
                                                           'type' => '844'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '288',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '4134' => {
                                      'BaseType' => '4024',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4139' => {
                                      'Header' => undef,
                                      'Line' => '1261',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'wq_context',
                                                           'offset' => '8',
                                                           'type' => '243'
                                                         },
                                                  '10' => {
                                                            'name' => 'cond',
                                                            'offset' => '150',
                                                            'type' => '844'
                                                          },
                                                  '11' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '324',
                                                            'type' => '945'
                                                          },
                                                  '12' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '328',
                                                            'type' => '945'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '22',
                                                           'type' => '5219'
                                                         },
                                                  '3' => {
                                                           'name' => 'cq',
                                                           'offset' => '36',
                                                           'type' => '3821'
                                                         },
                                                  '4' => {
                                                           'name' => 'wq_num',
                                                           'offset' => '50',
                                                           'type' => '945'
                                                         },
                                                  '5' => {
                                                           'name' => 'handle',
                                                           'offset' => '54',
                                                           'type' => '945'
                                                         },
                                                  '6' => {
                                                           'name' => 'state',
                                                           'offset' => '64',
                                                           'type' => '5737'
                                                         },
                                                  '7' => {
                                                           'name' => 'wq_type',
                                                           'offset' => '68',
                                                           'type' => '5593'
                                                         },
                                                  '8' => {
                                                           'name' => 'post_recv',
                                                           'offset' => '72',
                                                           'type' => '7902'
                                                         },
                                                  '9' => {
                                                           'name' => 'mutex',
                                                           'offset' => '86',
                                                           'type' => '771'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wq',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '4331' => {
                                      'BaseType' => '4139',
                                      'Name' => 'struct ibv_wq*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4336' => {
                                      'Header' => undef,
                                      'Line' => '483',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_LOC_LEN_ERR',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_REM_OP_ERR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_REM_ABORT_ERR',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_INV_EECN_ERR',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_FATAL_ERR',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'IBV_WC_GENERAL_ERR',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'IBV_WC_TM_ERR',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                            'value' => '23'
                                                          },
                                                  '3' => {
                                                           'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_LOC_PROT_ERR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_MW_BIND_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_BAD_RESP_ERR',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_status',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4496' => {
                                      'Header' => undef,
                                      'Line' => '511',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WC_SEND',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WC_RDMA_WRITE',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WC_RECV',
                                                            'value' => '128'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                            'value' => '129'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WC_TM_ADD',
                                                            'value' => '130'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WC_TM_DEL',
                                                            'value' => '131'
                                                          },
                                                  '14' => {
                                                            'name' => 'IBV_WC_TM_SYNC',
                                                            'value' => '132'
                                                          },
                                                  '15' => {
                                                            'name' => 'IBV_WC_TM_RECV',
                                                            'value' => '133'
                                                          },
                                                  '16' => {
                                                            'name' => 'IBV_WC_TM_NO_TAG',
                                                            'value' => '134'
                                                          },
                                                  '17' => {
                                                            'name' => 'IBV_WC_DRIVER1',
                                                            'value' => '135'
                                                          },
                                                  '18' => {
                                                            'name' => 'IBV_WC_DRIVER2',
                                                            'value' => '136'
                                                          },
                                                  '19' => {
                                                            'name' => 'IBV_WC_DRIVER3',
                                                            'value' => '137'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WC_RDMA_READ',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WC_COMP_SWAP',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WC_FETCH_ADD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WC_BIND_MW',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WC_LOCAL_INV',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WC_TSO',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WC_FLUSH',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WC_ATOMIC_WRITE',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wc_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '46' => {
                                    'BaseType' => '58',
                                    'Header' => undef,
                                    'Line' => '214',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4632' => {
                                      'Header' => undef,
                                      'Line' => '596',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '1005'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '4665' => {
                                      'Header' => undef,
                                      'Line' => '587',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '4336'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '66',
                                                            'type' => '933'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '68',
                                                            'type' => '921'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '69',
                                                            'type' => '921'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '18',
                                                           'type' => '4496'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '22',
                                                           'type' => '945'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '32',
                                                           'type' => '945'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '36',
                                                           'type' => '4632'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '40',
                                                           'type' => '945'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '50',
                                                           'type' => '945'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '54',
                                                           'type' => '135'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '64',
                                                           'type' => '933'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '4851' => {
                                      'Header' => undef,
                                      'Line' => '623',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '5034'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '957'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '22',
                                                           'type' => '957'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '36',
                                                           'type' => '135'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '4924' => {
                                      'Header' => undef,
                                      'Line' => '666',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '5219'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '22',
                                                           'type' => '243'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '36',
                                                           'type' => '46'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '50',
                                                           'type' => '945'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '54',
                                                           'type' => '945'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '64',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '5034' => {
                                      'BaseType' => '4924',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5039' => {
                                      'Header' => undef,
                                      'Line' => '630',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5191' => {
                                      'Header' => undef,
                                      'Line' => '655',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         }
                                                },
                                      'Name' => 'struct ibv_xrcd',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '5219' => {
                                      'BaseType' => '5039',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5224' => {
                                      'Header' => undef,
                                      'Line' => '676',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_MW_TYPE_1',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_MW_TYPE_2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_mw_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5252' => {
                                      'Header' => undef,
                                      'Line' => '681',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '5219'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '22',
                                                           'type' => '945'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '945'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '36',
                                                           'type' => '5224'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '5588' => {
                                      'BaseType' => '5191',
                                      'Name' => 'struct ibv_xrcd*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5593' => {
                                      'Header' => undef,
                                      'Line' => '818',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WQT_RQ',
                                                           'value' => '0'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wq_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5737' => {
                                      'Header' => undef,
                                      'Line' => '846',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WQS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WQS_RDY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_WQS_ERR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WQS_UNKNOWN',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wq_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '58' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5861' => {
                                      'Header' => undef,
                                      'Line' => '878',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'ind_tbl_handle',
                                                           'offset' => '8',
                                                           'type' => '70'
                                                         },
                                                  '2' => {
                                                           'name' => 'ind_tbl_num',
                                                           'offset' => '18',
                                                           'type' => '70'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '22',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rwq_ind_table',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '5992' => {
                                      'Header' => undef,
                                      'Line' => '899',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPT_RC',
                                                           'value' => '2'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPT_UC',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPT_UD',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPT_RAW_PACKET',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPT_XRC_SEND',
                                                           'value' => '9'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPT_XRC_RECV',
                                                           'value' => '10'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPT_DRIVER',
                                                           'value' => '255'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6050' => {
                                      'Header' => undef,
                                      'Line' => '909',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max_send_wr',
                                                           'offset' => '0',
                                                           'type' => '945'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_recv_wr',
                                                           'offset' => '4',
                                                           'type' => '945'
                                                         },
                                                  '2' => {
                                                           'name' => 'max_send_sge',
                                                           'offset' => '8',
                                                           'type' => '945'
                                                         },
                                                  '3' => {
                                                           'name' => 'max_recv_sge',
                                                           'offset' => '18',
                                                           'type' => '945'
                                                         },
                                                  '4' => {
                                                           'name' => 'max_inline_data',
                                                           'offset' => '22',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_cap',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '6134' => {
                                      'Header' => undef,
                                      'Line' => '961',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rx_hash_function',
                                                           'offset' => '0',
                                                           'type' => '921'
                                                         },
                                                  '1' => {
                                                           'name' => 'rx_hash_key_len',
                                                           'offset' => '1',
                                                           'type' => '921'
                                                         },
                                                  '2' => {
                                                           'name' => 'rx_hash_key',
                                                           'offset' => '8',
                                                           'type' => '6204'
                                                         },
                                                  '3' => {
                                                           'name' => 'rx_hash_fields_mask',
                                                           'offset' => '22',
                                                           'type' => '957'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rx_hash_conf',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '6204' => {
                                      'BaseType' => '921',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6209' => {
                                      'Header' => undef,
                                      'Line' => '970',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '0',
                                                           'type' => '243'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '8',
                                                           'type' => '3821'
                                                         },
                                                  '10' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '128',
                                                            'type' => '945'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_tso_header',
                                                            'offset' => '132',
                                                            'type' => '933'
                                                          },
                                                  '12' => {
                                                            'name' => 'rwq_ind_tbl',
                                                            'offset' => '136',
                                                            'type' => '6443'
                                                          },
                                                  '13' => {
                                                            'name' => 'rx_hash_conf',
                                                            'offset' => '150',
                                                            'type' => '6134'
                                                          },
                                                  '14' => {
                                                            'name' => 'source_qpn',
                                                            'offset' => '288',
                                                            'type' => '945'
                                                          },
                                                  '15' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '296',
                                                            'type' => '957'
                                                          },
                                                  '2' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '22',
                                                           'type' => '3821'
                                                         },
                                                  '3' => {
                                                           'name' => 'srq',
                                                           'offset' => '36',
                                                           'type' => '4134'
                                                         },
                                                  '4' => {
                                                           'name' => 'cap',
                                                           'offset' => '50',
                                                           'type' => '6050'
                                                         },
                                                  '5' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '82',
                                                           'type' => '5992'
                                                         },
                                                  '6' => {
                                                           'name' => 'sq_sig_all',
                                                           'offset' => '86',
                                                           'type' => '70'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '96',
                                                           'type' => '945'
                                                         },
                                                  '8' => {
                                                           'name' => 'pd',
                                                           'offset' => '100',
                                                           'type' => '5219'
                                                         },
                                                  '9' => {
                                                           'name' => 'xrcd',
                                                           'offset' => '114',
                                                           'type' => '5588'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp_init_attr_ex',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '6443' => {
                                      'BaseType' => '5861',
                                      'Name' => 'struct ibv_rwq_ind_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6532' => {
                                      'Header' => undef,
                                      'Line' => '1048',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_QPS_RESET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_QPS_INIT',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_QPS_RTR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_QPS_RTS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_QPS_SQD',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_QPS_SQE',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_QPS_ERR',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_QPS_UNKNOWN',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_qp_state',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6666' => {
                                      'Header' => undef,
                                      'Line' => '1101',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'IBV_WR_TSO',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'IBV_WR_DRIVER1',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'IBV_WR_FLUSH',
                                                            'value' => '14'
                                                          },
                                                  '13' => {
                                                            'name' => 'IBV_WR_ATOMIC_WRITE',
                                                            'value' => '15'
                                                          },
                                                  '2' => {
                                                           'name' => 'IBV_WR_SEND',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_WR_SEND_WITH_IMM',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_WR_RDMA_READ',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_WR_LOCAL_INV',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'IBV_WR_BIND_MW',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'IBV_WR_SEND_WITH_INV',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum ibv_wr_opcode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6813' => {
                                      'Header' => undef,
                                      'Line' => '1141',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'addr',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '945'
                                                         },
                                                  '2' => {
                                                           'name' => 'lkey',
                                                           'offset' => '18',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_sge',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6874' => {
                                      'Header' => undef,
                                      'Line' => '1157',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '1005'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidate_rkey',
                                                           'offset' => '0',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '6907' => {
                                      'Header' => undef,
                                      'Line' => '1162',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_addr',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6945' => {
                                      'Header' => undef,
                                      'Line' => '1166',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_addr',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'compare_add',
                                                           'offset' => '8',
                                                           'type' => '957'
                                                         },
                                                  '2' => {
                                                           'name' => 'swap',
                                                           'offset' => '22',
                                                           'type' => '957'
                                                         },
                                                  '3' => {
                                                           'name' => 'rkey',
                                                           'offset' => '36',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '70' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7011' => {
                                      'Header' => undef,
                                      'Line' => '1172',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ah',
                                                           'offset' => '0',
                                                           'type' => '7115'
                                                         },
                                                  '1' => {
                                                           'name' => 'remote_qpn',
                                                           'offset' => '8',
                                                           'type' => '945'
                                                         },
                                                  '2' => {
                                                           'name' => 'remote_qkey',
                                                           'offset' => '18',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7061' => {
                                      'Header' => undef,
                                      'Line' => '1691',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '5219'
                                                         },
                                                  '2' => {
                                                           'name' => 'handle',
                                                           'offset' => '22',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Name' => 'struct ibv_ah',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7115' => {
                                      'BaseType' => '7061',
                                      'Name' => 'struct ibv_ah*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7120' => {
                                      'Header' => undef,
                                      'Line' => '1161',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rdma',
                                                           'offset' => '0',
                                                           'type' => '6907'
                                                         },
                                                  '1' => {
                                                           'name' => 'atomic',
                                                           'offset' => '0',
                                                           'type' => '6945'
                                                         },
                                                  '2' => {
                                                           'name' => 'ud',
                                                           'offset' => '0',
                                                           'type' => '7011'
                                                         }
                                                },
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '7163' => {
                                      'Header' => undef,
                                      'Line' => '1179',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_srqn',
                                                           'offset' => '0',
                                                           'type' => '945'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7187' => {
                                      'Header' => undef,
                                      'Line' => '1178',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'xrc',
                                                           'offset' => '0',
                                                           'type' => '7163'
                                                         }
                                                },
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7207' => {
                                      'Header' => undef,
                                      'Line' => '1184',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mw',
                                                           'offset' => '0',
                                                           'type' => '7257'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '945'
                                                         },
                                                  '2' => {
                                                           'name' => 'bind_info',
                                                           'offset' => '22',
                                                           'type' => '4851'
                                                         }
                                                },
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7257' => {
                                      'BaseType' => '5252',
                                      'Name' => 'struct ibv_mw*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7262' => {
                                      'Header' => undef,
                                      'Line' => '1189',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'hdr',
                                                           'offset' => '0',
                                                           'type' => '243'
                                                         },
                                                  '1' => {
                                                           'name' => 'hdr_sz',
                                                           'offset' => '8',
                                                           'type' => '933'
                                                         },
                                                  '2' => {
                                                           'name' => 'mss',
                                                           'offset' => '16',
                                                           'type' => '933'
                                                         }
                                                },
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7312' => {
                                      'Header' => undef,
                                      'Line' => '1183',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bind_mw',
                                                           'offset' => '0',
                                                           'type' => '7207'
                                                         },
                                                  '1' => {
                                                           'name' => 'tso',
                                                           'offset' => '0',
                                                           'type' => '7262'
                                                         }
                                                },
                                      'Size' => '48',
                                      'Type' => 'Union'
                                    },
                          '7344' => {
                                      'Header' => undef,
                                      'Line' => '1147',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '7480'
                                                         },
                                                  '2' => {
                                                           'name' => 'sg_list',
                                                           'offset' => '22',
                                                           'type' => '7485'
                                                         },
                                                  '3' => {
                                                           'name' => 'num_sge',
                                                           'offset' => '36',
                                                           'type' => '70'
                                                         },
                                                  '4' => {
                                                           'name' => 'opcode',
                                                           'offset' => '40',
                                                           'type' => '6666'
                                                         },
                                                  '5' => {
                                                           'name' => 'send_flags',
                                                           'offset' => '50',
                                                           'type' => '135'
                                                         },
                                                  '6' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '54',
                                                           'type' => '6874'
                                                         },
                                                  '7' => {
                                                           'name' => 'wr',
                                                           'offset' => '64',
                                                           'type' => '7120'
                                                         },
                                                  '8' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '114',
                                                           'type' => '7187'
                                                         },
                                                  '9' => {
                                                           'name' => 'unnamed1',
                                                           'offset' => '128',
                                                           'type' => '7312'
                                                         }
                                                },
                                      'Name' => 'struct ibv_send_wr',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '7480' => {
                                      'BaseType' => '7344',
                                      'Name' => 'struct ibv_send_wr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7485' => {
                                      'BaseType' => '6813',
                                      'Name' => 'struct ibv_sge*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7490' => {
                                      'Header' => undef,
                                      'Line' => '1197',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '7560'
                                                         },
                                                  '2' => {
                                                           'name' => 'sg_list',
                                                           'offset' => '22',
                                                           'type' => '7485'
                                                         },
                                                  '3' => {
                                                           'name' => 'num_sge',
                                                           'offset' => '36',
                                                           'type' => '70'
                                                         }
                                                },
                                      'Name' => 'struct ibv_recv_wr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7560' => {
                                      'BaseType' => '7490',
                                      'Name' => 'struct ibv_recv_wr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7816' => {
                                      'Header' => undef,
                                      'Line' => '1233',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '957'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_flags',
                                                           'offset' => '8',
                                                           'type' => '135'
                                                         },
                                                  '2' => {
                                                           'name' => 'bind_info',
                                                           'offset' => '22',
                                                           'type' => '4851'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7897' => {
                                      'BaseType' => '7560',
                                      'Name' => 'struct ibv_recv_wr**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7902' => {
                                      'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4331'
                                                          },
                                                   '1' => {
                                                            'type' => '7560'
                                                          },
                                                   '2' => {
                                                            'type' => '7897'
                                                          }
                                                 },
                                      'Return' => '70',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '82163' => {
                                       'Header' => undef,
                                       'Line' => '161',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '945'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '70'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '70'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '82212' => {
                                       'Header' => undef,
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '945'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '70'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '70'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '82261' => {
                                       'Header' => undef,
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '243'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '46'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82297' => {
                                       'Header' => undef,
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdb',
                                                            'offset' => '0',
                                                            'type' => '13383'
                                                          },
                                                   '1' => {
                                                            'name' => 'sdb',
                                                            'offset' => '8',
                                                            'type' => '13076'
                                                          },
                                                   '2' => {
                                                            'name' => 'doorbell_qpn',
                                                            'offset' => '22',
                                                            'type' => '1005'
                                                          },
                                                   '3' => {
                                                            'name' => 'sq',
                                                            'offset' => '32',
                                                            'type' => '82163'
                                                          },
                                                   '4' => {
                                                            'name' => 'rq',
                                                            'offset' => '50',
                                                            'type' => '82212'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '72',
                                                            'type' => '82261'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '100',
                                                            'type' => '957'
                                                          },
                                                   '7' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '114',
                                                            'type' => '269'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_qp',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '82441' => {
                                       'Header' => undef,
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '243'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '46'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82477' => {
                                       'Header' => undef,
                                       'Line' => '183',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '82441'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '945'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqn',
                                                            'offset' => '32',
                                                            'type' => '945'
                                                          },
                                                   '3' => {
                                                            'name' => 'set_ci_db',
                                                            'offset' => '36',
                                                            'type' => '13383'
                                                          },
                                                   '4' => {
                                                            'name' => 'arm_db',
                                                            'offset' => '50',
                                                            'type' => '13383'
                                                          },
                                                   '5' => {
                                                            'name' => 'arm_sn',
                                                            'offset' => '64',
                                                            'type' => '70'
                                                          },
                                                   '6' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '68',
                                                            'type' => '70'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '957'
                                                          },
                                                   '8' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '86',
                                                            'type' => '243'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_cq',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '82608' => {
                                       'Header' => undef,
                                       'Line' => '199',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '243'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '46'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82644' => {
                                       'Header' => undef,
                                       'Line' => '198',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '82608'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '22',
                                                            'type' => '70'
                                                          },
                                                   '2' => {
                                                            'name' => 'head',
                                                            'offset' => '32',
                                                            'type' => '70'
                                                          },
                                                   '3' => {
                                                            'name' => 'tail',
                                                            'offset' => '36',
                                                            'type' => '70'
                                                          },
                                                   '4' => {
                                                            'name' => 'db',
                                                            'offset' => '50',
                                                            'type' => '13383'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '957'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '82735' => {
                                       'Header' => undef,
                                       'Line' => '212',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '945'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '70'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '70'
                                                          }
                                                 },
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '82784' => {
                                       'Header' => undef,
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '243'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '46'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82820' => {
                                       'Header' => undef,
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdb',
                                                            'offset' => '0',
                                                            'type' => '13383'
                                                          },
                                                   '1' => {
                                                            'name' => 'rq',
                                                            'offset' => '8',
                                                            'type' => '82735'
                                                          },
                                                   '2' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '82784'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '957'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_rwq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '82885' => {
                                       'Header' => undef,
                                       'Line' => '225',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4019'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '82920'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82920' => {
                                       'BaseType' => '82297',
                                       'Name' => 'struct mlx4dv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82925' => {
                                       'Header' => undef,
                                       'Line' => '229',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '3821'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '82960'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82960' => {
                                       'BaseType' => '82477',
                                       'Name' => 'struct mlx4dv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82965' => {
                                       'Header' => undef,
                                       'Line' => '233',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4134'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '83000'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '83000' => {
                                       'BaseType' => '82644',
                                       'Name' => 'struct mlx4dv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83005' => {
                                       'Header' => undef,
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4331'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '83040'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '83040' => {
                                       'BaseType' => '82820',
                                       'Name' => 'struct mlx4dv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83045' => {
                                       'Header' => undef,
                                       'Line' => '224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '82885'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '22',
                                                            'type' => '82925'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '50',
                                                            'type' => '82965'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '72',
                                                            'type' => '83005'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_obj',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '83169' => {
                                       'Header' => undef,
                                       'Line' => '437',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '921'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_inl_recv_sz',
                                                            'offset' => '4',
                                                            'type' => '945'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '957'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_context',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '83225' => {
                                       'Header' => undef,
                                       'Line' => '539',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX4DV_SET_CTX_ATTR_LOG_WQS_RANGE_SZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX4DV_SET_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx4dv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '87' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '87551' => {
                                       'BaseType' => '83169',
                                       'Name' => 'struct mlx4dv_context*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8781' => {
                                      'Header' => undef,
                                      'Line' => '1498',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '1699'
                                                         },
                                                  '1' => {
                                                           'name' => 'fd',
                                                           'offset' => '8',
                                                           'type' => '70'
                                                         },
                                                  '2' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '18',
                                                           'type' => '70'
                                                         }
                                                },
                                      'Name' => 'struct ibv_comp_channel',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '88000' => {
                                       'BaseType' => '83045',
                                       'Name' => 'struct mlx4dv_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8835' => {
                                      'BaseType' => '8781',
                                      'Name' => 'struct ibv_comp_channel*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '921' => {
                                     'BaseType' => '159',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '933' => {
                                     'BaseType' => '183',
                                     'Header' => undef,
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '945' => {
                                     'BaseType' => '195',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '957' => {
                                     'BaseType' => '207',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '981' => {
                                     'BaseType' => '135',
                                     'Header' => undef,
                                     'Line' => '27',
                                     'Name' => '__u32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '993' => {
                                     'BaseType' => '390',
                                     'Header' => undef,
                                     'Line' => '31',
                                     'Name' => '__u64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libmlx4.so.1.0.46.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__printf_chk@GLIBC_2.3.4' => 0,
                                                             '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_34' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'ibv_cmd_alloc_mw@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_attach_mcast@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_close_xrcd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_cq_ex@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_flow@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_qp_ex2@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_qp_ex@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_rwq_ind_table@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_srq_ex@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_create_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dealloc_mw@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_flow@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_rwq_ind_table@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_destroy_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_detach_mcast@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_get_context@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_modify_wq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_open_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_open_xrcd@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_device_any@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_port@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_qp@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_query_srq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_reg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_rereg_mr@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_cmd_resize_cq@IBVERBS_PRIVATE_34' => 0,
                                                             'ibv_dofork_range@IBVERBS_1.1' => 0,
                                                             'ibv_dontfork_range@IBVERBS_1.1' => 0,
                                                             'ibv_query_device@IBVERBS_1.1' => 0,
                                                             'ibv_query_gid@IBVERBS_1.1' => 0,
                                                             'ibv_query_port@IBVERBS_1.1' => 0,
                                                             'ibv_resolve_eth_l2_from_gid@IBVERBS_1.1' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'mmap@GLIBC_2.2.5' => 0,
                                                             'munmap@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_init@GLIBC_2.34' => 0,
                                                             'pthread_spin_lock@GLIBC_2.34' => 0,
                                                             'pthread_spin_unlock@GLIBC_2.34' => 0,
                                                             'stderr@GLIBC_2.2.5' => 0,
                                                             'sysconf@GLIBC_2.2.5' => 0,
                                                             'verbs_register_driver_34@IBVERBS_PRIVATE_34' => 0,
                                                             'verbs_set_ops@IBVERBS_PRIVATE_34' => 0,
                                                             'verbs_uninit_context@IBVERBS_PRIVATE_34' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
