$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.12',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'Compiler' => 'clang version 7.0.0 (tags/RELEASE_700/final)',
          'Headers' => {
                         'int-ll64.h' => 1,
                         'mlx4dv.h' => 1,
                         'pthreadtypes.h' => 1,
                         'stddef.h' => 1,
                         'stdint.h' => 1,
                         'types.h' => 1,
                         'verbs.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libmlx4.so.1.0.23.0',
          'LibraryVersion' => 'mlx4',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {
                         'mlx4.c' => 1,
                         'verbs.c' => 1
                       },
          'SymbolInfo' => {
                            '125600' => {
                                          'Line' => '1023',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'context',
                                                                'type' => '2276'
                                                              },

                                         'Source' => 'mlx4.c'
                                       },
                            '66043' => {
                                         'Line' => '430',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'context',
                                                               'type' => '2276'
                                                             },
                                                      '1' => {
                                                               'name' => 'attr_type',
                                                               'type' => '61113'
                                                             },
                                                      '2' => {
                                                               'name' => 'attr',
                                                               'type' => '1223'
                                                             }
                                                    },
                                         'Reg' => {
                                                    '0' => 'rdi',
                                                    '1' => 'rsi',
                                                    '2' => 'rdx'
                                                  },
                                         'Return' => '97',
                                         'ShortName' => 'mlx4dv_set_context_attr',
                                         'Source' => 'mlx4.c'
                                       }
                          },
          'SymbolVersion' => {
                               '_ITM_deregisterTMCloneTable' => 'verbs_uninit_context@@IBVERBS_PRIVATE_22',
                               '_ITM_registerTMCloneTable' => 'verbs_uninit_context@@IBVERBS_PRIVATE_22',
                               '__gmon_start__' => 'verbs_uninit_context@@IBVERBS_PRIVATE_22',
                               'mlx4dv_create_qp' => 'mlx4dv_create_qp@@MLX4_1.0',
                               'mlx4dv_init_obj' => 'mlx4dv_init_obj@@MLX4_1.0',
                               'mlx4dv_query_device' => 'mlx4dv_query_device@@MLX4_1.0',
                               'mlx4dv_set_context_attr' => 'mlx4dv_set_context_attr@@MLX4_1.0'
                             },
          'Symbols' => {
                         'libmlx4.so.1.0.23.0' => {
                                                    'mlx4dv_create_qp@@MLX4_1.0' => 1,
                                                    'mlx4dv_init_obj@@MLX4_1.0' => 1,
                                                    'mlx4dv_query_device@@MLX4_1.0' => 1,
                                                    'mlx4dv_set_context_attr@@MLX4_1.0' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10371' => {
                                       'BaseType' => '10376',
                                       'Name' => 'struct ibv_xrcd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10376' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '614',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2276'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_xrcd',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '104' => {
                                     'BaseType' => '97',
                                     'Header' => 'verbs.h',
                                     'Line' => '89',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                          'value' => '-1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_TRANSPORT_IB',
                                                          'value' => '0'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_TRANSPORT_IWARP',
                                                          'value' => '1'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC',
                                                          'value' => '2'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum ibv_transport_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '10420' => {
                                       'BaseType' => '10425',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '128',
                                       'Type' => 'Pointer'
                                     },
                          '10425' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '912',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp_context',
                                                            'offset' => '0',
                                                            'type' => '1223'
                                                          },
                                                   '1' => {
                                                            'name' => 'send_cq',
                                                            'offset' => '8',
                                                            'type' => '3458'
                                                          },
                                                   '10' => {
                                                             'name' => 'create_flags',
                                                             'offset' => '80',
                                                             'type' => '3237'
                                                           },
                                                   '11' => {
                                                             'name' => 'max_tso_header',
                                                             'offset' => '84',
                                                             'type' => '4688'
                                                           },
                                                   '12' => {
                                                             'name' => 'rwq_ind_tbl',
                                                             'offset' => '88',
                                                             'type' => '7407'
                                                           },
                                                   '13' => {
                                                             'name' => 'rx_hash_conf',
                                                             'offset' => '96',
                                                             'type' => '10705'
                                                           },
                                                   '14' => {
                                                             'name' => 'source_qpn',
                                                             'offset' => '120',
                                                             'type' => '3237'
                                                           },
                                                   '2' => {
                                                            'name' => 'recv_cq',
                                                            'offset' => '16',
                                                            'type' => '3458'
                                                          },
                                                   '3' => {
                                                            'name' => 'srq',
                                                            'offset' => '24',
                                                            'type' => '4055'
                                                          },
                                                   '4' => {
                                                            'name' => 'cap',
                                                            'offset' => '32',
                                                            'type' => '10630'
                                                          },
                                                   '5' => {
                                                            'name' => 'qp_type',
                                                            'offset' => '52',
                                                            'type' => '242'
                                                          },
                                                   '6' => {
                                                            'name' => 'sq_sig_all',
                                                            'offset' => '56',
                                                            'type' => '97'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '60',
                                                            'type' => '3237'
                                                          },
                                                   '8' => {
                                                            'name' => 'pd',
                                                            'offset' => '64',
                                                            'type' => '3196'
                                                          },
                                                   '9' => {
                                                            'name' => 'xrcd',
                                                            'offset' => '72',
                                                            'type' => '10371'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_init_attr_ex',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '10630' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '867',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_send_wr',
                                                            'offset' => '0',
                                                            'type' => '3237'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_recv_wr',
                                                            'offset' => '4',
                                                            'type' => '3237'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_send_sge',
                                                            'offset' => '8',
                                                            'type' => '3237'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_recv_sge',
                                                            'offset' => '12',
                                                            'type' => '3237'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_inline_data',
                                                            'offset' => '16',
                                                            'type' => '3237'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_qp_cap',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '10705' => {
                                       'Header' => 'verbs.h',
                                       'Line' => '903',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rx_hash_function',
                                                            'offset' => '0',
                                                            'type' => '3067'
                                                          },
                                                   '1' => {
                                                            'name' => 'rx_hash_key_len',
                                                            'offset' => '1',
                                                            'type' => '3067'
                                                          },
                                                   '2' => {
                                                            'name' => 'rx_hash_key',
                                                            'offset' => '8',
                                                            'type' => '10767'
                                                          },
                                                   '3' => {
                                                            'name' => 'rx_hash_fields_mask',
                                                            'offset' => '16',
                                                            'type' => '4215'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_rx_hash_conf',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10767' => {
                                       'BaseType' => '3067',
                                       'Name' => 'uint8_t*',
                                       'Size' => '1',
                                       'Type' => 'Pointer'
                                     },
                          '10793' => {
                                       'BaseType' => '3237',
                                       'Name' => 'uint32_t*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '11114' => {
                                       'BaseType' => '11125',
                                       'Header' => 'types.h',
                                       'Line' => '86',
                                       'Name' => 'off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11125' => {
                                       'BaseType' => '3869',
                                       'Header' => 'types.h',
                                       'Line' => '131',
                                       'Name' => '__off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11629' => {
                                       'BaseType' => '4666',
                                       'Name' => '__be32*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '1223' => {
                                      'BaseType' => '1',
                                      'Name' => 'void*',
                                      'Type' => 'Pointer'
                                    },
                          '147' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '636',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_MW_TYPE_1',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_MW_TYPE_2',
                                                          'value' => '2'
                                                        }
                                               },
                                     'Name' => 'enum ibv_mw_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '173' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '180' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '979',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_QPS_RESET',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_QPS_INIT',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_QPS_RTR',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_QPS_RTS',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_QPS_SQD',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_QPS_SQE',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_QPS_ERR',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_QPS_UNKNOWN',
                                                          'value' => '7'
                                                        }
                                               },
                                     'Name' => 'enum ibv_qp_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '2276' => {
                                      'BaseType' => '2281',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '328',
                                      'Type' => 'Pointer'
                                    },
                          '2281' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1742',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '2388'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '2604'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '264',
                                                           'type' => '97'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '268',
                                                           'type' => '97'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '272',
                                                           'type' => '97'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '280',
                                                           'type' => '3644'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '320',
                                                           'type' => '1223'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '2388' => {
                                      'BaseType' => '2393',
                                      'Name' => 'struct ibv_device*',
                                      'Size' => '664',
                                      'Type' => 'Pointer'
                                    },
                          '2393' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1685',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_ops',
                                                           'offset' => '0',
                                                           'type' => '2496'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_type',
                                                           'offset' => '16',
                                                           'type' => '42'
                                                         },
                                                  '2' => {
                                                           'name' => 'transport_type',
                                                           'offset' => '20',
                                                           'type' => '104'
                                                         },
                                                  '3' => {
                                                           'name' => 'name',
                                                           'offset' => '24',
                                                           'type' => '2565'
                                                         },
                                                  '4' => {
                                                           'name' => 'dev_name',
                                                           'offset' => '88',
                                                           'type' => '2565'
                                                         },
                                                  '5' => {
                                                           'name' => 'dev_path',
                                                           'offset' => '152',
                                                           'type' => '2565'
                                                         },
                                                  '6' => {
                                                           'name' => 'ibdev_path',
                                                           'offset' => '408',
                                                           'type' => '2565'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device',
                                      'Size' => '664',
                                      'Type' => 'Struct'
                                    },
                          '242' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '857',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_QPT_RC',
                                                          'value' => '2'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_QPT_UC',
                                                          'value' => '3'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_QPT_UD',
                                                          'value' => '4'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_QPT_RAW_PACKET',
                                                          'value' => '8'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_QPT_XRC_SEND',
                                                          'value' => '9'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_QPT_XRC_RECV',
                                                          'value' => '10'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_QPT_DRIVER',
                                                          'value' => '255'
                                                        }
                                               },
                                     'Name' => 'enum ibv_qp_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '2496' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1675',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_dummy1',
                                                           'offset' => '0',
                                                           'type' => '2532'
                                                         },
                                                  '1' => {
                                                           'name' => '_dummy2',
                                                           'offset' => '8',
                                                           'type' => '2553'
                                                         }
                                                },
                                      'Name' => 'struct _ibv_device_ops',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2532' => {
                                      'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2388'
                                                          },
                                                   '1' => {
                                                            'type' => '97'
                                                          }
                                                 },
                                      'Return' => '2276',
                                      'Type' => 'FuncPtr'
                                    },
                          '2553' => {
                                      'Name' => 'void(*)(struct ibv_context*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2276'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Type' => 'FuncPtr'
                                    },
                          '2565' => {
                                      'BaseType' => '2577',
                                      'Name' => 'char[]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '2577' => {
                                      'Name' => 'char',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '2604' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1700',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_compat_query_device',
                                                           'offset' => '0',
                                                           'type' => '3031'
                                                         },
                                                  '1' => {
                                                           'name' => '_compat_query_port',
                                                           'offset' => '8',
                                                           'type' => '3041'
                                                         },
                                                  '10' => {
                                                            'name' => '_compat_create_cq',
                                                            'offset' => '80',
                                                            'type' => '3031'
                                                          },
                                                  '11' => {
                                                            'name' => 'poll_cq',
                                                            'offset' => '88',
                                                            'type' => '4428'
                                                          },
                                                  '12' => {
                                                            'name' => 'req_notify_cq',
                                                            'offset' => '96',
                                                            'type' => '4706'
                                                          },
                                                  '13' => {
                                                            'name' => '_compat_cq_event',
                                                            'offset' => '104',
                                                            'type' => '3031'
                                                          },
                                                  '14' => {
                                                            'name' => '_compat_resize_cq',
                                                            'offset' => '112',
                                                            'type' => '3031'
                                                          },
                                                  '15' => {
                                                            'name' => '_compat_destroy_cq',
                                                            'offset' => '120',
                                                            'type' => '3031'
                                                          },
                                                  '16' => {
                                                            'name' => '_compat_create_srq',
                                                            'offset' => '128',
                                                            'type' => '3031'
                                                          },
                                                  '17' => {
                                                            'name' => '_compat_modify_srq',
                                                            'offset' => '136',
                                                            'type' => '3031'
                                                          },
                                                  '18' => {
                                                            'name' => '_compat_query_srq',
                                                            'offset' => '144',
                                                            'type' => '3031'
                                                          },
                                                  '19' => {
                                                            'name' => '_compat_destroy_srq',
                                                            'offset' => '152',
                                                            'type' => '3031'
                                                          },
                                                  '2' => {
                                                           'name' => '_compat_alloc_pd',
                                                           'offset' => '16',
                                                           'type' => '3031'
                                                         },
                                                  '20' => {
                                                            'name' => 'post_srq_recv',
                                                            'offset' => '160',
                                                            'type' => '4727'
                                                          },
                                                  '21' => {
                                                            'name' => '_compat_create_qp',
                                                            'offset' => '168',
                                                            'type' => '3031'
                                                          },
                                                  '22' => {
                                                            'name' => '_compat_query_qp',
                                                            'offset' => '176',
                                                            'type' => '3031'
                                                          },
                                                  '23' => {
                                                            'name' => '_compat_modify_qp',
                                                            'offset' => '184',
                                                            'type' => '3031'
                                                          },
                                                  '24' => {
                                                            'name' => '_compat_destroy_qp',
                                                            'offset' => '192',
                                                            'type' => '3031'
                                                          },
                                                  '25' => {
                                                            'name' => 'post_send',
                                                            'offset' => '200',
                                                            'type' => '4879'
                                                          },
                                                  '26' => {
                                                            'name' => 'post_recv',
                                                            'offset' => '208',
                                                            'type' => '5473'
                                                          },
                                                  '27' => {
                                                            'name' => '_compat_create_ah',
                                                            'offset' => '216',
                                                            'type' => '3031'
                                                          },
                                                  '28' => {
                                                            'name' => '_compat_destroy_ah',
                                                            'offset' => '224',
                                                            'type' => '3031'
                                                          },
                                                  '29' => {
                                                            'name' => '_compat_attach_mcast',
                                                            'offset' => '232',
                                                            'type' => '3031'
                                                          },
                                                  '3' => {
                                                           'name' => '_compat_dealloc_pd',
                                                           'offset' => '24',
                                                           'type' => '3031'
                                                         },
                                                  '30' => {
                                                            'name' => '_compat_detach_mcast',
                                                            'offset' => '240',
                                                            'type' => '3031'
                                                          },
                                                  '31' => {
                                                            'name' => '_compat_async_event',
                                                            'offset' => '248',
                                                            'type' => '3031'
                                                          },
                                                  '4' => {
                                                           'name' => '_compat_reg_mr',
                                                           'offset' => '32',
                                                           'type' => '3031'
                                                         },
                                                  '5' => {
                                                           'name' => '_compat_rereg_mr',
                                                           'offset' => '40',
                                                           'type' => '3031'
                                                         },
                                                  '6' => {
                                                           'name' => '_compat_dereg_mr',
                                                           'offset' => '48',
                                                           'type' => '3031'
                                                         },
                                                  '7' => {
                                                           'name' => 'alloc_mw',
                                                           'offset' => '56',
                                                           'type' => '3095'
                                                         },
                                                  '8' => {
                                                           'name' => 'bind_mw',
                                                           'offset' => '64',
                                                           'type' => '3248'
                                                         },
                                                  '9' => {
                                                           'name' => 'dealloc_mw',
                                                           'offset' => '72',
                                                           'type' => '4412'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context_ops',
                                      'Size' => '256',
                                      'Type' => 'Struct'
                                    },
                          '299' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '451',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_WC_SUCCESS',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_WC_LOC_LEN_ERR',
                                                          'value' => '1'
                                                        },
                                                 '10' => {
                                                           'name' => 'IBV_WC_REM_ACCESS_ERR',
                                                           'value' => '10'
                                                         },
                                                 '11' => {
                                                           'name' => 'IBV_WC_REM_OP_ERR',
                                                           'value' => '11'
                                                         },
                                                 '12' => {
                                                           'name' => 'IBV_WC_RETRY_EXC_ERR',
                                                           'value' => '12'
                                                         },
                                                 '13' => {
                                                           'name' => 'IBV_WC_RNR_RETRY_EXC_ERR',
                                                           'value' => '13'
                                                         },
                                                 '14' => {
                                                           'name' => 'IBV_WC_LOC_RDD_VIOL_ERR',
                                                           'value' => '14'
                                                         },
                                                 '15' => {
                                                           'name' => 'IBV_WC_REM_INV_RD_REQ_ERR',
                                                           'value' => '15'
                                                         },
                                                 '16' => {
                                                           'name' => 'IBV_WC_REM_ABORT_ERR',
                                                           'value' => '16'
                                                         },
                                                 '17' => {
                                                           'name' => 'IBV_WC_INV_EECN_ERR',
                                                           'value' => '17'
                                                         },
                                                 '18' => {
                                                           'name' => 'IBV_WC_INV_EEC_STATE_ERR',
                                                           'value' => '18'
                                                         },
                                                 '19' => {
                                                           'name' => 'IBV_WC_FATAL_ERR',
                                                           'value' => '19'
                                                         },
                                                 '2' => {
                                                          'name' => 'IBV_WC_LOC_QP_OP_ERR',
                                                          'value' => '2'
                                                        },
                                                 '20' => {
                                                           'name' => 'IBV_WC_RESP_TIMEOUT_ERR',
                                                           'value' => '20'
                                                         },
                                                 '21' => {
                                                           'name' => 'IBV_WC_GENERAL_ERR',
                                                           'value' => '21'
                                                         },
                                                 '22' => {
                                                           'name' => 'IBV_WC_TM_ERR',
                                                           'value' => '22'
                                                         },
                                                 '23' => {
                                                           'name' => 'IBV_WC_TM_RNDV_INCOMPLETE',
                                                           'value' => '23'
                                                         },
                                                 '3' => {
                                                          'name' => 'IBV_WC_LOC_EEC_OP_ERR',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_WC_LOC_PROT_ERR',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_WC_WR_FLUSH_ERR',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_WC_MW_BIND_ERR',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_WC_BAD_RESP_ERR',
                                                          'value' => '7'
                                                        },
                                                 '8' => {
                                                          'name' => 'IBV_WC_LOC_ACCESS_ERR',
                                                          'value' => '8'
                                                        },
                                                 '9' => {
                                                          'name' => 'IBV_WC_REM_INV_REQ_ERR',
                                                          'value' => '9'
                                                        }
                                               },
                                     'Name' => 'enum ibv_wc_status',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '3031' => {
                                      'Name' => 'void*(*)()',
                                      'Return' => '1223',
                                      'Type' => 'FuncPtr'
                                    },
                          '3041' => {
                                      'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2276'
                                                          },
                                                   '1' => {
                                                            'type' => '3067'
                                                          },
                                                   '2' => {
                                                            'type' => '3085'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '3067' => {
                                      'BaseType' => '3078',
                                      'Header' => 'stdint.h',
                                      'Line' => '48',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '3078' => {
                                      'Name' => 'unsigned char',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '3085' => {
                                      'BaseType' => '3090',
                                      'Name' => 'struct _compat_ibv_port_attr*',
                                      'Type' => 'Pointer'
                                    },
                          '3090' => {
                                      'Name' => 'struct _compat_ibv_port_attr',
                                      'Type' => 'Struct'
                                    },
                          '3095' => {
                                      'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3196'
                                                          },
                                                   '1' => {
                                                            'type' => '147'
                                                          }
                                                 },
                                      'Return' => '3116',
                                      'Type' => 'FuncPtr'
                                    },
                          '3116' => {
                                      'BaseType' => '3121',
                                      'Name' => 'struct ibv_mw*',
                                      'Size' => '32',
                                      'Type' => 'Pointer'
                                    },
                          '3121' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '641',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '3196'
                                                         },
                                                  '2' => {
                                                           'name' => 'rkey',
                                                           'offset' => '16',
                                                           'type' => '3237'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '20',
                                                           'type' => '3237'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '24',
                                                           'type' => '147'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3196' => {
                                      'BaseType' => '3201',
                                      'Name' => 'struct ibv_pd*',
                                      'Size' => '16',
                                      'Type' => 'Pointer'
                                    },
                          '3201' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '589',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'handle',
                                                           'offset' => '8',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_pd',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3237' => {
                                      'BaseType' => '173',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '3248' => {
                                      'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3274'
                                                          },
                                                   '1' => {
                                                            'type' => '3116'
                                                          },
                                                   '2' => {
                                                            'type' => '4161'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '3274' => {
                                      'BaseType' => '3279',
                                      'Name' => 'struct ibv_qp*',
                                      'Size' => '160',
                                      'Type' => 'Pointer'
                                    },
                          '3279' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1192',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'qp_context',
                                                           'offset' => '8',
                                                           'type' => '1223'
                                                         },
                                                  '10' => {
                                                            'name' => 'mutex',
                                                            'offset' => '64',
                                                            'type' => '3644'
                                                          },
                                                  '11' => {
                                                            'name' => 'cond',
                                                            'offset' => '104',
                                                            'type' => '3876'
                                                          },
                                                  '12' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '152',
                                                            'type' => '3237'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '3196'
                                                         },
                                                  '3' => {
                                                           'name' => 'send_cq',
                                                           'offset' => '24',
                                                           'type' => '3458'
                                                         },
                                                  '4' => {
                                                           'name' => 'recv_cq',
                                                           'offset' => '32',
                                                           'type' => '3458'
                                                         },
                                                  '5' => {
                                                           'name' => 'srq',
                                                           'offset' => '40',
                                                           'type' => '4055'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '48',
                                                           'type' => '3237'
                                                         },
                                                  '7' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '52',
                                                           'type' => '3237'
                                                         },
                                                  '8' => {
                                                           'name' => 'state',
                                                           'offset' => '56',
                                                           'type' => '180'
                                                         },
                                                  '9' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '60',
                                                           'type' => '242'
                                                         }
                                                },
                                      'Name' => 'struct ibv_qp',
                                      'Size' => '160',
                                      'Type' => 'Struct'
                                    },
                          '3458' => {
                                      'BaseType' => '3463',
                                      'Name' => 'struct ibv_cq*',
                                      'Size' => '128',
                                      'Type' => 'Pointer'
                                    },
                          '3463' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1215',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '8',
                                                           'type' => '3590'
                                                         },
                                                  '2' => {
                                                           'name' => 'cq_context',
                                                           'offset' => '16',
                                                           'type' => '1223'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '24',
                                                           'type' => '3237'
                                                         },
                                                  '4' => {
                                                           'name' => 'cqe',
                                                           'offset' => '28',
                                                           'type' => '97'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '32',
                                                           'type' => '3644'
                                                         },
                                                  '6' => {
                                                           'name' => 'cond',
                                                           'offset' => '72',
                                                           'type' => '3876'
                                                         },
                                                  '7' => {
                                                           'name' => 'comp_events_completed',
                                                           'offset' => '120',
                                                           'type' => '3237'
                                                         },
                                                  '8' => {
                                                           'name' => 'async_events_completed',
                                                           'offset' => '124',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_cq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '3590' => {
                                      'BaseType' => '3595',
                                      'Name' => 'struct ibv_comp_channel*',
                                      'Size' => '16',
                                      'Type' => 'Pointer'
                                    },
                          '3595' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1209',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'fd',
                                                           'offset' => '8',
                                                           'type' => '97'
                                                         },
                                                  '2' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '12',
                                                           'type' => '97'
                                                         }
                                                },
                                      'Name' => 'struct ibv_comp_channel',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3644' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__data',
                                                           'offset' => '0',
                                                           'type' => '3696'
                                                         },
                                                  '1' => {
                                                           'name' => '__size',
                                                           'offset' => '0',
                                                           'type' => '2565'
                                                         },
                                                  '2' => {
                                                           'name' => '__align',
                                                           'offset' => '0',
                                                           'type' => '3869'
                                                         }
                                                },
                                      'Name' => 'union pthread_mutex_t',
                                      'Size' => '40',
                                      'Type' => 'Union'
                                    },
                          '3696' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '92',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__lock',
                                                           'offset' => '0',
                                                           'type' => '97'
                                                         },
                                                  '1' => {
                                                           'name' => '__count',
                                                           'offset' => '4',
                                                           'type' => '173'
                                                         },
                                                  '2' => {
                                                           'name' => '__owner',
                                                           'offset' => '8',
                                                           'type' => '97'
                                                         },
                                                  '3' => {
                                                           'name' => '__nusers',
                                                           'offset' => '12',
                                                           'type' => '173'
                                                         },
                                                  '4' => {
                                                           'name' => '__kind',
                                                           'offset' => '16',
                                                           'type' => '97'
                                                         },
                                                  '5' => {
                                                           'name' => '__spins',
                                                           'offset' => '20',
                                                           'type' => '3801'
                                                         },
                                                  '6' => {
                                                           'name' => '__elision',
                                                           'offset' => '22',
                                                           'type' => '3801'
                                                         },
                                                  '7' => {
                                                           'name' => '__list',
                                                           'offset' => '24',
                                                           'type' => '3808'
                                                         }
                                                },
                                      'Name' => 'struct __pthread_mutex_s',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3801' => {
                                      'Name' => 'short',
                                      'Size' => '2',
                                      'Type' => 'Intrinsic'
                                    },
                          '3808' => {
                                      'BaseType' => '3819',
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '79',
                                      'Name' => '__pthread_list_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '3819' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '75',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__prev',
                                                           'offset' => '0',
                                                           'type' => '3852'
                                                         },
                                                  '1' => {
                                                           'name' => '__next',
                                                           'offset' => '8',
                                                           'type' => '3852'
                                                         }
                                                },
                                      'Name' => 'struct __pthread_internal_list',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3852' => {
                                      'BaseType' => '3819',
                                      'Name' => 'struct __pthread_internal_list*',
                                      'Size' => '16',
                                      'Type' => 'Pointer'
                                    },
                          '3869' => {
                                      'Name' => 'long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '3876' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '154',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__data',
                                                           'offset' => '0',
                                                           'type' => '3903'
                                                         },
                                                  '1' => {
                                                           'name' => '__size',
                                                           'offset' => '0',
                                                           'type' => '2565'
                                                         },
                                                  '2' => {
                                                           'name' => '__align',
                                                           'offset' => '0',
                                                           'type' => '4048'
                                                         }
                                                },
                                      'Name' => 'union pthread_cond_t',
                                      'Size' => '48',
                                      'Type' => 'Union'
                                    },
                          '3903' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '141',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__lock',
                                                           'offset' => '0',
                                                           'type' => '97'
                                                         },
                                                  '1' => {
                                                           'name' => '__futex',
                                                           'offset' => '4',
                                                           'type' => '173'
                                                         },
                                                  '2' => {
                                                           'name' => '__total_seq',
                                                           'offset' => '8',
                                                           'type' => '4029'
                                                         },
                                                  '3' => {
                                                           'name' => '__wakeup_seq',
                                                           'offset' => '16',
                                                           'type' => '4029'
                                                         },
                                                  '4' => {
                                                           'name' => '__woken_seq',
                                                           'offset' => '24',
                                                           'type' => '4029'
                                                         },
                                                  '5' => {
                                                           'name' => '__mutex',
                                                           'offset' => '32',
                                                           'type' => '1223'
                                                         },
                                                  '6' => {
                                                           'name' => '__nwaiters',
                                                           'offset' => '40',
                                                           'type' => '173'
                                                         },
                                                  '7' => {
                                                           'name' => '__broadcast_seq',
                                                           'offset' => '44',
                                                           'type' => '173'
                                                         }
                                                },
                                      'Name' => 'anon-struct-pthreadtypes.h-141',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '4029' => {
                                      'Name' => 'unsigned long long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '4048' => {
                                      'Name' => 'long long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '4055' => {
                                      'BaseType' => '4060',
                                      'Name' => 'struct ibv_srq*',
                                      'Size' => '128',
                                      'Type' => 'Pointer'
                                    },
                          '4060' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1152',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'srq_context',
                                                           'offset' => '8',
                                                           'type' => '1223'
                                                         },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '3196'
                                                         },
                                                  '3' => {
                                                           'name' => 'handle',
                                                           'offset' => '24',
                                                           'type' => '3237'
                                                         },
                                                  '4' => {
                                                           'name' => 'mutex',
                                                           'offset' => '32',
                                                           'type' => '3644'
                                                         },
                                                  '5' => {
                                                           'name' => 'cond',
                                                           'offset' => '72',
                                                           'type' => '3876'
                                                         },
                                                  '6' => {
                                                           'name' => 'events_completed',
                                                           'offset' => '120',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_srq',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '4161' => {
                                      'BaseType' => '4166',
                                      'Name' => 'struct ibv_mw_bind*',
                                      'Size' => '48',
                                      'Type' => 'Pointer'
                                    },
                          '4166' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'send_flags',
                                                           'offset' => '8',
                                                           'type' => '173'
                                                         },
                                                  '2' => {
                                                           'name' => 'bind_info',
                                                           'offset' => '16',
                                                           'type' => '4233'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '42' => {
                                    'BaseType' => '97',
                                    'Header' => 'verbs.h',
                                    'Line' => '79',
                                    'Memb' => {
                                                '0' => {
                                                         'name' => 'IBV_NODE_UNKNOWN',
                                                         'value' => '-1'
                                                       },
                                                '1' => {
                                                         'name' => 'IBV_NODE_CA',
                                                         'value' => '1'
                                                       },
                                                '2' => {
                                                         'name' => 'IBV_NODE_SWITCH',
                                                         'value' => '2'
                                                       },
                                                '3' => {
                                                         'name' => 'IBV_NODE_ROUTER',
                                                         'value' => '3'
                                                       },
                                                '4' => {
                                                         'name' => 'IBV_NODE_RNIC',
                                                         'value' => '4'
                                                       },
                                                '5' => {
                                                         'name' => 'IBV_NODE_USNIC',
                                                         'value' => '5'
                                                       },
                                                '6' => {
                                                         'name' => 'IBV_NODE_USNIC_UDP',
                                                         'value' => '6'
                                                       }
                                              },
                                    'Name' => 'enum ibv_node_type',
                                    'Size' => '4',
                                    'Type' => 'Enum'
                                  },
                          '4215' => {
                                      'BaseType' => '4226',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4226' => {
                                      'Name' => 'unsigned long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '4233' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '582',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mr',
                                                           'offset' => '0',
                                                           'type' => '4295'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '8',
                                                           'type' => '4215'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '16',
                                                           'type' => '4215'
                                                         },
                                                  '3' => {
                                                           'name' => 'mw_access_flags',
                                                           'offset' => '24',
                                                           'type' => '173'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mw_bind_info',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '4295' => {
                                      'BaseType' => '4300',
                                      'Name' => 'struct ibv_mr*',
                                      'Size' => '48',
                                      'Type' => 'Pointer'
                                    },
                          '4300' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '626',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '3196'
                                                         },
                                                  '2' => {
                                                           'name' => 'addr',
                                                           'offset' => '16',
                                                           'type' => '1223'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '4401'
                                                         },
                                                  '4' => {
                                                           'name' => 'handle',
                                                           'offset' => '32',
                                                           'type' => '3237'
                                                         },
                                                  '5' => {
                                                           'name' => 'lkey',
                                                           'offset' => '36',
                                                           'type' => '3237'
                                                         },
                                                  '6' => {
                                                           'name' => 'rkey',
                                                           'offset' => '40',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_mr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '4401' => {
                                      'BaseType' => '4226',
                                      'Header' => 'stddef.h',
                                      'Line' => '62',
                                      'Name' => 'size_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4412' => {
                                      'Name' => 'int(*)(struct ibv_mw*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3116'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '4428' => {
                                      'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3458'
                                                          },
                                                   '1' => {
                                                            'type' => '97'
                                                          },
                                                   '2' => {
                                                            'type' => '4454'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '4454' => {
                                      'BaseType' => '4459',
                                      'Name' => 'struct ibv_wc*',
                                      'Size' => '48',
                                      'Type' => 'Pointer'
                                    },
                          '4459' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '550',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '299'
                                                         },
                                                  '10' => {
                                                            'name' => 'slid',
                                                            'offset' => '42',
                                                            'type' => '4688'
                                                          },
                                                  '11' => {
                                                            'name' => 'sl',
                                                            'offset' => '44',
                                                            'type' => '3067'
                                                          },
                                                  '12' => {
                                                            'name' => 'dlid_path_bits',
                                                            'offset' => '45',
                                                            'type' => '3067'
                                                          },
                                                  '2' => {
                                                           'name' => 'opcode',
                                                           'offset' => '12',
                                                           'type' => '457'
                                                         },
                                                  '3' => {
                                                           'name' => 'vendor_err',
                                                           'offset' => '16',
                                                           'type' => '3237'
                                                         },
                                                  '4' => {
                                                           'name' => 'byte_len',
                                                           'offset' => '20',
                                                           'type' => '3237'
                                                         },
                                                  '5' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '24',
                                                           'type' => '4542'
                                                         },
                                                  '6' => {
                                                           'name' => 'qp_num',
                                                           'offset' => '28',
                                                           'type' => '3237'
                                                         },
                                                  '7' => {
                                                           'name' => 'src_qp',
                                                           'offset' => '32',
                                                           'type' => '3237'
                                                         },
                                                  '8' => {
                                                           'name' => 'wc_flags',
                                                           'offset' => '36',
                                                           'type' => '173'
                                                         },
                                                  '9' => {
                                                           'name' => 'pkey_index',
                                                           'offset' => '40',
                                                           'type' => '4688'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wc',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '4542' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '559',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '4666'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidated_rkey',
                                                           'offset' => '0',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'ibv_wc::anon-union-verbs.h-559',
                                      'NameSpace' => 'ibv_wc',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '457' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '479',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_WC_SEND',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_WC_RDMA_WRITE',
                                                          'value' => '1'
                                                        },
                                                 '10' => {
                                                           'name' => 'IBV_WC_TM_ADD',
                                                           'value' => '130'
                                                         },
                                                 '11' => {
                                                           'name' => 'IBV_WC_TM_DEL',
                                                           'value' => '131'
                                                         },
                                                 '12' => {
                                                           'name' => 'IBV_WC_TM_SYNC',
                                                           'value' => '132'
                                                         },
                                                 '13' => {
                                                           'name' => 'IBV_WC_TM_RECV',
                                                           'value' => '133'
                                                         },
                                                 '14' => {
                                                           'name' => 'IBV_WC_TM_NO_TAG',
                                                           'value' => '134'
                                                         },
                                                 '2' => {
                                                          'name' => 'IBV_WC_RDMA_READ',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_WC_COMP_SWAP',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_WC_FETCH_ADD',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_WC_BIND_MW',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_WC_LOCAL_INV',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_WC_TSO',
                                                          'value' => '7'
                                                        },
                                                 '8' => {
                                                          'name' => 'IBV_WC_RECV',
                                                          'value' => '128'
                                                        },
                                                 '9' => {
                                                          'name' => 'IBV_WC_RECV_RDMA_WITH_IMM',
                                                          'value' => '129'
                                                        }
                                               },
                                     'Name' => 'enum ibv_wc_opcode',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '4666' => {
                                      'BaseType' => '4677',
                                      'Header' => 'types.h',
                                      'Line' => '30',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4677' => {
                                      'BaseType' => '173',
                                      'Header' => 'int-ll64.h',
                                      'Line' => '26',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4688' => {
                                      'BaseType' => '4699',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '4699' => {
                                      'Name' => 'unsigned short',
                                      'Size' => '2',
                                      'Type' => 'Intrinsic'
                                    },
                          '4706' => {
                                      'Name' => 'int(*)(struct ibv_cq*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3458'
                                                          },
                                                   '1' => {
                                                            'type' => '97'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '4727' => {
                                      'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4055'
                                                          },
                                                   '1' => {
                                                            'type' => '4753'
                                                          },
                                                   '2' => {
                                                            'type' => '4874'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '4753' => {
                                      'BaseType' => '4758',
                                      'Name' => 'struct ibv_recv_wr*',
                                      'Size' => '32',
                                      'Type' => 'Pointer'
                                    },
                          '4758' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1110',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '4753'
                                                         },
                                                  '2' => {
                                                           'name' => 'sg_list',
                                                           'offset' => '16',
                                                           'type' => '4820'
                                                         },
                                                  '3' => {
                                                           'name' => 'num_sge',
                                                           'offset' => '24',
                                                           'type' => '97'
                                                         }
                                                },
                                      'Name' => 'struct ibv_recv_wr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '4820' => {
                                      'BaseType' => '4825',
                                      'Name' => 'struct ibv_sge*',
                                      'Size' => '16',
                                      'Type' => 'Pointer'
                                    },
                          '4825' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1054',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'addr',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '3237'
                                                         },
                                                  '2' => {
                                                           'name' => 'lkey',
                                                           'offset' => '12',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_sge',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4874' => {
                                      'BaseType' => '4753',
                                      'Name' => 'struct ibv_recv_wr**',
                                      'Size' => '32',
                                      'Type' => 'Pointer'
                                    },
                          '4879' => {
                                      'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3274'
                                                          },
                                                   '1' => {
                                                            'type' => '4905'
                                                          },
                                                   '2' => {
                                                            'type' => '5468'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '4905' => {
                                      'BaseType' => '4910',
                                      'Name' => 'struct ibv_send_wr*',
                                      'Size' => '128',
                                      'Type' => 'Pointer'
                                    },
                          '4910' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1060',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wr_id',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '4905'
                                                         },
                                                  '2' => {
                                                           'name' => 'sg_list',
                                                           'offset' => '16',
                                                           'type' => '4820'
                                                         },
                                                  '3' => {
                                                           'name' => 'num_sge',
                                                           'offset' => '24',
                                                           'type' => '97'
                                                         },
                                                  '4' => {
                                                           'name' => 'opcode',
                                                           'offset' => '28',
                                                           'type' => '568'
                                                         },
                                                  '5' => {
                                                           'name' => 'send_flags',
                                                           'offset' => '32',
                                                           'type' => '173'
                                                         },
                                                  '6' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '36',
                                                           'type' => '5006'
                                                         },
                                                  '7' => {
                                                           'name' => 'wr',
                                                           'offset' => '40',
                                                           'type' => '5051'
                                                         },
                                                  '8' => {
                                                           'name' => 'qp_type',
                                                           'offset' => '72',
                                                           'type' => '5244'
                                                         },
                                                  '9' => {
                                                           'name' => 'unnamed1',
                                                           'offset' => '80',
                                                           'type' => '5291'
                                                         }
                                                },
                                      'Name' => 'struct ibv_send_wr',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '5006' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1070',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'imm_data',
                                                           'offset' => '0',
                                                           'type' => '4666'
                                                         },
                                                  '1' => {
                                                           'name' => 'invalidate_rkey',
                                                           'offset' => '0',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'ibv_send_wr::anon-union-verbs.h-1070',
                                      'NameSpace' => 'ibv_send_wr',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '5051' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1074',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rdma',
                                                           'offset' => '0',
                                                           'type' => '5069'
                                                         },
                                                  '1' => {
                                                           'name' => 'atomic',
                                                           'offset' => '0',
                                                           'type' => '5114'
                                                         },
                                                  '2' => {
                                                           'name' => 'ud',
                                                           'offset' => '0',
                                                           'type' => '5185'
                                                         }
                                                },
                                      'Name' => 'ibv_send_wr::anon-union-verbs.h-1074',
                                      'NameSpace' => 'ibv_send_wr',
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '5069' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1075',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_addr',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'anon-struct-verbs.h-1075',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5114' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1079',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_addr',
                                                           'offset' => '0',
                                                           'type' => '4215'
                                                         },
                                                  '1' => {
                                                           'name' => 'compare_add',
                                                           'offset' => '8',
                                                           'type' => '4215'
                                                         },
                                                  '2' => {
                                                           'name' => 'swap',
                                                           'offset' => '16',
                                                           'type' => '4215'
                                                         },
                                                  '3' => {
                                                           'name' => 'rkey',
                                                           'offset' => '24',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'anon-struct-verbs.h-1079',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '5185' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1085',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ah',
                                                           'offset' => '0',
                                                           'type' => '5414'
                                                         },
                                                  '1' => {
                                                           'name' => 'remote_qpn',
                                                           'offset' => '8',
                                                           'type' => '3237'
                                                         },
                                                  '2' => {
                                                           'name' => 'remote_qkey',
                                                           'offset' => '12',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'anon-struct-verbs.h-1085',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5244' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1091',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'xrc',
                                                           'offset' => '0',
                                                           'type' => '5262'
                                                         }
                                                },
                                      'Name' => 'ibv_send_wr::anon-union-verbs.h-1091',
                                      'NameSpace' => 'ibv_send_wr',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '5262' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1092',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'remote_srqn',
                                                           'offset' => '0',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'anon-struct-verbs.h-1092',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5291' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1096',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bind_mw',
                                                           'offset' => '0',
                                                           'type' => '5309'
                                                         },
                                                  '1' => {
                                                           'name' => 'tso',
                                                           'offset' => '0',
                                                           'type' => '5367'
                                                         }
                                                },
                                      'Name' => 'ibv_send_wr::anon-union-verbs.h-1096',
                                      'NameSpace' => 'ibv_send_wr',
                                      'Size' => '48',
                                      'Type' => 'Union'
                                    },
                          '5309' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1097',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mw',
                                                           'offset' => '0',
                                                           'type' => '3116'
                                                         },
                                                  '1' => {
                                                           'name' => 'rkey',
                                                           'offset' => '8',
                                                           'type' => '3237'
                                                         },
                                                  '2' => {
                                                           'name' => 'bind_info',
                                                           'offset' => '16',
                                                           'type' => '4233'
                                                         }
                                                },
                                      'Name' => 'anon-struct-verbs.h-1097',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '5367' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1102',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'hdr',
                                                           'offset' => '0',
                                                           'type' => '1223'
                                                         },
                                                  '1' => {
                                                           'name' => 'hdr_sz',
                                                           'offset' => '8',
                                                           'type' => '4688'
                                                         },
                                                  '2' => {
                                                           'name' => 'mss',
                                                           'offset' => '10',
                                                           'type' => '4688'
                                                         }
                                                },
                                      'Name' => 'anon-struct-verbs.h-1102',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5414' => {
                                      'BaseType' => '5419',
                                      'Name' => 'struct ibv_ah*',
                                      'Size' => '24',
                                      'Type' => 'Pointer'
                                    },
                          '5419' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1402',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'pd',
                                                           'offset' => '8',
                                                           'type' => '3196'
                                                         },
                                                  '2' => {
                                                           'name' => 'handle',
                                                           'offset' => '16',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_ah',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '5468' => {
                                      'BaseType' => '4905',
                                      'Name' => 'struct ibv_send_wr**',
                                      'Size' => '128',
                                      'Type' => 'Pointer'
                                    },
                          '5473' => {
                                      'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3274'
                                                          },
                                                   '1' => {
                                                            'type' => '4753'
                                                          },
                                                   '2' => {
                                                            'type' => '4874'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '568' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '1032',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_WR_RDMA_WRITE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_WR_RDMA_WRITE_WITH_IMM',
                                                          'value' => '1'
                                                        },
                                                 '10' => {
                                                           'name' => 'IBV_WR_TSO',
                                                           'value' => '10'
                                                         },
                                                 '2' => {
                                                          'name' => 'IBV_WR_SEND',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_WR_SEND_WITH_IMM',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'IBV_WR_RDMA_READ',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'IBV_WR_ATOMIC_CMP_AND_SWP',
                                                          'value' => '5'
                                                        },
                                                 '6' => {
                                                          'name' => 'IBV_WR_ATOMIC_FETCH_AND_ADD',
                                                          'value' => '6'
                                                        },
                                                 '7' => {
                                                          'name' => 'IBV_WR_LOCAL_INV',
                                                          'value' => '7'
                                                        },
                                                 '8' => {
                                                          'name' => 'IBV_WR_BIND_MW',
                                                          'value' => '8'
                                                        },
                                                 '9' => {
                                                          'name' => 'IBV_WR_SEND_WITH_INV',
                                                          'value' => '9'
                                                        }
                                               },
                                     'Name' => 'enum ibv_wr_opcode',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '61113' => {
                                       'BaseType' => '173',
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '539',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX4DV_SET_CTX_ATTR_LOG_WQS_RANGE_SZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX4DV_SET_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx4dv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '64881' => {
                                       'BaseType' => '64886',
                                       'Name' => 'struct mlx4dv_qp*',
                                       'Size' => '80',
                                       'Type' => 'Pointer'
                                     },
                          '64886' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdb',
                                                            'offset' => '0',
                                                            'type' => '11629'
                                                          },
                                                   '1' => {
                                                            'name' => 'sdb',
                                                            'offset' => '8',
                                                            'type' => '10793'
                                                          },
                                                   '2' => {
                                                            'name' => 'doorbell_qpn',
                                                            'offset' => '16',
                                                            'type' => '4666'
                                                          },
                                                   '3' => {
                                                            'name' => 'sq',
                                                            'offset' => '20',
                                                            'type' => '64942'
                                                          },
                                                   '4' => {
                                                            'name' => 'rq',
                                                            'offset' => '32',
                                                            'type' => '64995'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '48',
                                                            'type' => '65048'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '4215'
                                                          },
                                                   '7' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '72',
                                                            'type' => '11114'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_qp',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '64942' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '161',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '3237'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '97'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '97'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_qp::anon-struct-mlx4dv.h-161',
                                       'NameSpace' => 'mlx4dv_qp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '64995' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '3237'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '97'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '97'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_qp::anon-struct-mlx4dv.h-166',
                                       'NameSpace' => 'mlx4dv_qp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '65048' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '1223'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4401'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_qp::anon-struct-mlx4dv.h-171',
                                       'NameSpace' => 'mlx4dv_qp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '65176' => {
                                       'BaseType' => '65181',
                                       'Name' => 'struct mlx4dv_cq*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '65181' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '183',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '65201'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '16',
                                                            'type' => '3237'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqn',
                                                            'offset' => '20',
                                                            'type' => '3237'
                                                          },
                                                   '3' => {
                                                            'name' => 'set_ci_db',
                                                            'offset' => '24',
                                                            'type' => '11629'
                                                          },
                                                   '4' => {
                                                            'name' => 'arm_db',
                                                            'offset' => '32',
                                                            'type' => '11629'
                                                          },
                                                   '5' => {
                                                            'name' => 'arm_sn',
                                                            'offset' => '40',
                                                            'type' => '97'
                                                          },
                                                   '6' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '44',
                                                            'type' => '97'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '4215'
                                                          },
                                                   '8' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '56',
                                                            'type' => '1223'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_cq',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '65201' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '1223'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4401'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_cq::anon-struct-mlx4dv.h-184',
                                       'NameSpace' => 'mlx4dv_cq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '65377' => {
                                       'BaseType' => '65382',
                                       'Name' => 'struct mlx4dv_srq*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '65382' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '198',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '65402'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '16',
                                                            'type' => '97'
                                                          },
                                                   '2' => {
                                                            'name' => 'head',
                                                            'offset' => '20',
                                                            'type' => '97'
                                                          },
                                                   '3' => {
                                                            'name' => 'tail',
                                                            'offset' => '24',
                                                            'type' => '97'
                                                          },
                                                   '4' => {
                                                            'name' => 'db',
                                                            'offset' => '32',
                                                            'type' => '11629'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '4215'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '65402' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '199',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '1223'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4401'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_srq::anon-struct-mlx4dv.h-199',
                                       'NameSpace' => 'mlx4dv_srq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '65542' => {
                                       'BaseType' => '65547',
                                       'Name' => 'struct mlx4dv_rwq*',
                                       'Size' => '48',
                                       'Type' => 'Pointer'
                                     },
                          '65547' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rdb',
                                                            'offset' => '0',
                                                            'type' => '11629'
                                                          },
                                                   '1' => {
                                                            'name' => 'rq',
                                                            'offset' => '8',
                                                            'type' => '65579'
                                                          },
                                                   '2' => {
                                                            'name' => 'buf',
                                                            'offset' => '24',
                                                            'type' => '65632'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '4215'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_rwq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '65579' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '212',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '0',
                                                            'type' => '3237'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_shift',
                                                            'offset' => '4',
                                                            'type' => '97'
                                                          },
                                                   '2' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '97'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_rwq::anon-struct-mlx4dv.h-212',
                                       'NameSpace' => 'mlx4dv_rwq',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '65632' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '1223'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '4401'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_rwq::anon-struct-mlx4dv.h-217',
                                       'NameSpace' => 'mlx4dv_rwq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66739' => {
                                       'BaseType' => '66744',
                                       'Name' => 'struct mlx4dv_obj*',
                                       'Size' => '64',
                                       'Type' => 'Pointer'
                                     },
                          '66744' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '66764'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '16',
                                                            'type' => '66805'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '32',
                                                            'type' => '66846'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '48',
                                                            'type' => '66887'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_obj',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '66764' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '225',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '3274'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '64881'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_obj::anon-struct-mlx4dv.h-225',
                                       'NameSpace' => 'mlx4dv_obj',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66805' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '229',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '3458'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '65176'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_obj::anon-struct-mlx4dv.h-229',
                                       'NameSpace' => 'mlx4dv_obj',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66846' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '233',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4055'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '65377'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_obj::anon-struct-mlx4dv.h-233',
                                       'NameSpace' => 'mlx4dv_obj',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66887' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '7554'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '65542'
                                                          }
                                                 },
                                       'Name' => 'mlx4dv_obj::anon-struct-mlx4dv.h-237',
                                       'NameSpace' => 'mlx4dv_obj',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66917' => {
                                       'BaseType' => '66922',
                                       'Name' => 'struct mlx4dv_context*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '66922' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '437',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '3067'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_inl_recv_sz',
                                                            'offset' => '4',
                                                            'type' => '3237'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '4215'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_context',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '7407' => {
                                      'BaseType' => '7412',
                                      'Name' => 'struct ibv_rwq_ind_table*',
                                      'Size' => '24',
                                      'Type' => 'Pointer'
                                    },
                          '7412' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '836',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'ind_tbl_handle',
                                                           'offset' => '8',
                                                           'type' => '97'
                                                         },
                                                  '2' => {
                                                           'name' => 'ind_tbl_num',
                                                           'offset' => '12',
                                                           'type' => '97'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '16',
                                                           'type' => '3237'
                                                         }
                                                },
                                      'Name' => 'struct ibv_rwq_ind_table',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7554' => {
                                      'BaseType' => '7559',
                                      'Name' => 'struct ibv_wq*',
                                      'Size' => '152',
                                      'Type' => 'Pointer'
                                    },
                          '7559' => {
                                      'Header' => 'verbs.h',
                                      'Line' => '1174',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2276'
                                                         },
                                                  '1' => {
                                                           'name' => 'wq_context',
                                                           'offset' => '8',
                                                           'type' => '1223'
                                                         },
                                                  '10' => {
                                                            'name' => 'cond',
                                                            'offset' => '96',
                                                            'type' => '3876'
                                                          },
                                                  '11' => {
                                                            'name' => 'events_completed',
                                                            'offset' => '144',
                                                            'type' => '3237'
                                                          },
                                                  '12' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '148',
                                                            'type' => '3237'
                                                          },
                                                  '2' => {
                                                           'name' => 'pd',
                                                           'offset' => '16',
                                                           'type' => '3196'
                                                         },
                                                  '3' => {
                                                           'name' => 'cq',
                                                           'offset' => '24',
                                                           'type' => '3458'
                                                         },
                                                  '4' => {
                                                           'name' => 'wq_num',
                                                           'offset' => '32',
                                                           'type' => '3237'
                                                         },
                                                  '5' => {
                                                           'name' => 'handle',
                                                           'offset' => '36',
                                                           'type' => '3237'
                                                         },
                                                  '6' => {
                                                           'name' => 'state',
                                                           'offset' => '40',
                                                           'type' => '869'
                                                         },
                                                  '7' => {
                                                           'name' => 'wq_type',
                                                           'offset' => '44',
                                                           'type' => '907'
                                                         },
                                                  '8' => {
                                                           'name' => 'post_recv',
                                                           'offset' => '48',
                                                           'type' => '7738'
                                                         },
                                                  '9' => {
                                                           'name' => 'mutex',
                                                           'offset' => '56',
                                                           'type' => '3644'
                                                         }
                                                },
                                      'Name' => 'struct ibv_wq',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '7738' => {
                                      'Name' => 'int(*)(struct ibv_wq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7554'
                                                          },
                                                   '1' => {
                                                            'type' => '4753'
                                                          },
                                                   '2' => {
                                                            'type' => '4874'
                                                          }
                                                 },
                                      'Return' => '97',
                                      'Type' => 'FuncPtr'
                                    },
                          '869' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '804',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_WQS_RESET',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'IBV_WQS_RDY',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'IBV_WQS_ERR',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'IBV_WQS_UNKNOWN',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum ibv_wq_state',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '87302' => {
                                       'BaseType' => '87307',
                                       'Name' => 'struct mlx4dv_qp_init_attr*',
                                       'Size' => '16',
                                       'Type' => 'Pointer'
                                     },
                          '87307' => {
                                       'Header' => 'mlx4dv.h',
                                       'Line' => '425',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '4215'
                                                          },
                                                   '1' => {
                                                            'name' => 'inl_recv_sz',
                                                            'offset' => '8',
                                                            'type' => '3237'
                                                          }
                                                 },
                                       'Name' => 'struct mlx4dv_qp_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '907' => {
                                     'BaseType' => '173',
                                     'Header' => 'verbs.h',
                                     'Line' => '776',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'IBV_WQT_RQ',
                                                          'value' => '0'
                                                        }
                                               },
                                     'Name' => 'enum ibv_wq_type',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '97' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libmlx4.so.1.0.23.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             '_verbs_init_and_alloc_context@IBVERBS_PRIVATE_22' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'ibv_cmd_alloc_mw@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_alloc_pd@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_attach_mcast@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_close_xrcd@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_cq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_cq_ex@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_flow@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_qp_ex2@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_qp_ex@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_rwq_ind_table@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_srq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_srq_ex@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_create_wq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_dealloc_mw@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_dealloc_pd@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_dereg_mr@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_destroy_cq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_destroy_flow@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_destroy_qp@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_destroy_rwq_ind_table@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_destroy_srq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_destroy_wq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_detach_mcast@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_get_context@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_modify_cq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_modify_qp@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_modify_srq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_modify_wq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_open_qp@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_open_xrcd@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_query_device@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_query_device_ex@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_query_port@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_query_qp@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_query_srq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_reg_mr@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_rereg_mr@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_cmd_resize_cq@IBVERBS_PRIVATE_22' => 0,
                                                             'ibv_dofork_range@IBVERBS_1.1' => 0,
                                                             'ibv_dontfork_range@IBVERBS_1.1' => 0,
                                                             'ibv_query_device@IBVERBS_1.1' => 0,
                                                             'ibv_query_gid@IBVERBS_1.1' => 0,
                                                             'ibv_query_port@IBVERBS_1.1' => 0,
                                                             'ibv_resolve_eth_l2_from_gid@IBVERBS_1.1' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'mmap@GLIBC_2.2.5' => 0,
                                                             'munmap@GLIBC_2.2.5' => 0,
                                                             'printf@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_init@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_spin_unlock@GLIBC_2.2.5' => 0,
                                                             'snprintf@GLIBC_2.2.5' => 0,
                                                             'stderr@GLIBC_2.2.5' => 0,
                                                             'sysconf@GLIBC_2.2.5' => 0,
                                                             'verbs_register_driver_22@IBVERBS_PRIVATE_22' => 0,
                                                             'verbs_set_ops@IBVERBS_PRIVATE_22' => 0,
                                                             'verbs_uninit_context@IBVERBS_PRIVATE_22' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
