$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.3.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx5.so.1.26.62.0',
          'LibraryVersion' => 'mlx5',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '1189433' => {
                                           'Header' => undef,
                                           'Line' => '5993',
                                           'Param' => {
                                                        '0' => {
                                                                 'name' => 'context',
                                                                 'type' => '2944'
                                                               },
                                                        '1' => {
                                                                 'name' => 'addr',
                                                                 'type' => '308'
                                                               },
                                                        '2' => {

                                                     'mlx5dv_dump_dr_table@@MLX5_1.12' => 1,
                                                     'mlx5dv_free_var@@MLX5_1.12' => 1,
                                                     'mlx5dv_get_clock_info@@MLX5_1.4' => 1,
                                                     'mlx5dv_get_data_direct_sysfs_path@@MLX5_1.25' => 1,
                                                     'mlx5dv_get_vfio_device_list@@MLX5_1.21' => 1,
                                                     'mlx5dv_init_obj@@MLX5_1.2' => 1,
                                                     'mlx5dv_init_obj@MLX5_1.0' => 1,
                                                     'mlx5dv_is_supported@@MLX5_1.8' => 1,
                                                     'mlx5dv_map_ah_to_qp@@MLX5_1.20' => 1,
                                                     'mlx5dv_modify_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_modify_qp_sched_elem@@MLX5_1.17' => 1,
                                                     'mlx5dv_modify_qp_udp_sport@@MLX5_1.17' => 1,
                                                     'mlx5dv_open_device@@MLX5_1.7' => 1,
                                                     'mlx5dv_pp_alloc@@MLX5_1.13' => 1,
                                                     'mlx5dv_pp_free@@MLX5_1.13' => 1,
                                                     'mlx5dv_qp_cancel_posted_send_wrs@@MLX5_1.20' => 1,
                                                     'mlx5dv_qp_ex_from_ibv_qp_ex@@MLX5_1.10' => 1,
                                                     'mlx5dv_query_device@@MLX5_1.0' => 1,
                                                     'mlx5dv_query_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_reg_dmabuf_mr@@MLX5_1.25' => 1,
                                                     'mlx5dv_reserved_qpn_alloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_reserved_qpn_dealloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_sched_leaf_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_set_context_attr@@MLX5_1.2' => 1,
                                                     'mlx5dv_vfio_get_events_fd@@MLX5_1.21' => 1,
                                                     'mlx5dv_vfio_process_events@@MLX5_1.21' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10004' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, size_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9636'
                                                           },
                                                    '1' => {
                                                             'type' => '419'
                                                           },
                                                    '2' => {
                                                             'type' => '9999'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10024' => {
                                       'Name' => 'int(*)(struct ibv_qp_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9636'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10055' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9636'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '2023'
                                                           },
                                                    '3' => {
                                                             'type' => '1961'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10096' => {
                                       'Name' => 'void(*)(struct ibv_qp_ex*, uint32_t, uint64_t, size_t, uint8_t, uint8_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9636'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '2023'
                                                           },
                                                    '3' => {
                                                             'type' => '419'
                                                           },
                                                    '4' => {
                                                             'type' => '1977'
                                                           },
                                                    '5' => {
                                                             'type' => '1977'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10101' => {
                                       'Header' => undef,
                                       'Line' => '1534',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '8',
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '18',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_comp_channel',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10156' => {
                                       'BaseType' => '10101',
                                       'Name' => 'struct ibv_comp_channel*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10161' => {
                                       'Header' => undef,
                                       'Line' => '1553',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_poll_cq_attr',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '10189' => {
                                       'Header' => undef,
                                       'Line' => '1557',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tag',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wc_tm_info',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10231' => {
                                       'Header' => undef,
                                       'Line' => '1562',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '10156'
                                                          },
                                                   '10' => {
                                                             'name' => 'status',
                                                             'offset' => '306',
                                                             'type' => '5422'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '310',
                                                             'type' => '2023'
                                                           },
                                                   '12' => {
                                                             'name' => 'start_poll',
                                                             'offset' => '324',
                                                             'type' => '10700'
                                                           },
                                                   '13' => {
                                                             'name' => 'next_poll',
                                                             'offset' => '338',
                                                             'type' => '10720'
                                                           },
                                                   '14' => {
                                                             'name' => 'end_poll',
                                                             'offset' => '352',
                                                             'type' => '10736'
                                                           },
                                                   '15' => {
                                                             'name' => 'read_opcode',
                                                             'offset' => '360',
                                                             'type' => '10756'
                                                           },
                                                   '16' => {
                                                             'name' => 'read_vendor_err',
                                                             'offset' => '374',
                                                             'type' => '10776'
                                                           },
                                                   '17' => {
                                                             'name' => 'read_byte_len',
                                                             'offset' => '388',
                                                             'type' => '10776'
                                                           },
                                                   '18' => {
                                                             'name' => 'read_imm_data',
                                                             'offset' => '402',
                                                             'type' => '10796'
                                                           },
                                                   '19' => {
                                                             'name' => 'read_qp_num',
                                                             'offset' => '512',
                                                             'type' => '10776'
                                                           },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '22',
                                                            'type' => '308'
                                                          },
                                                   '20' => {
                                                             'name' => 'read_src_qp',
                                                             'offset' => '520',
                                                             'type' => '10776'
                                                           },
                                                   '21' => {
                                                             'name' => 'read_wc_flags',
                                                             'offset' => '534',
                                                             'type' => '10816'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_slid',
                                                             'offset' => '548',
                                                             'type' => '10776'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_sl',
                                                             'offset' => '562',
                                                             'type' => '10836'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_dlid_path_bits',
                                                             'offset' => '576',
                                                             'type' => '10836'
                                                           },
                                                   '25' => {
                                                             'name' => 'read_completion_ts',
                                                             'offset' => '584',
                                                             'type' => '10856'
                                                           },
                                                   '26' => {
                                                             'name' => 'read_cvlan',
                                                             'offset' => '598',
                                                             'type' => '10876'
                                                           },
                                                   '27' => {
                                                             'name' => 'read_flow_tag',
                                                             'offset' => '612',
                                                             'type' => '10776'
                                                           },
                                                   '28' => {
                                                             'name' => 'read_tm_info',
                                                             'offset' => '626',
                                                             'type' => '10902'
                                                           },
                                                   '29' => {
                                                             'name' => 'read_completion_wallclock_ns',
                                                             'offset' => '640',
                                                             'type' => '10856'
                                                           },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '40',
                                                            'type' => '159'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '50',
                                                            'type' => '893'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '114',
                                                            'type' => '966'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '288',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '292',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '296',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_ex',
                                       'Size' => '288',
                                       'Type' => 'Struct'
                                     },
                          '10690' => {
                                       'BaseType' => '10231',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10695' => {
                                       'BaseType' => '10161',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10700' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           },
                                                    '1' => {
                                                             'type' => '10695'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10720' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10736' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10756' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '5583',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10776' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '2001',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10796' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '2203',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10816' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10836' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '1977',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10856' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '2023',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10876' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           }
                                                  },
                                       'Return' => '1989',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10897' => {
                                       'BaseType' => '10189',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10902' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10690'
                                                           },
                                                    '1' => {
                                                             'type' => '10897'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10991' => {
                                       'Header' => undef,
                                       'Line' => '1739',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11032' => {
                                       'BaseType' => '1977',
                                       'Name' => 'uint8_t[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '11048' => {
                                       'Header' => undef,
                                       'Line' => '1972',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '11076' => {
                                       'Header' => undef,
                                       'Line' => '2155',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '111' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11104' => {
                                       'BaseType' => '11076',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11221' => {
                                       'Header' => undef,
                                       'Line' => '1966',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2944'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11277' => {
                                       'Header' => undef,
                                       'Line' => '1980',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '11431'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '2243'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '22',
                                                            'type' => '308'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '36',
                                                            'type' => '2267'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '40',
                                                            'type' => '1989'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '50',
                                                            'type' => '308'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '64',
                                                            'type' => '2406'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '82',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '11431' => {
                                       'BaseType' => '2411',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11436' => {
                                       'Header' => undef,
                                       'Line' => '2001',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '11617'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '11633'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11498' => {
                                       'BaseType' => '11503',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11503' => {
                                       'Header' => undef,
                                       'Line' => '2011',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '11436'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '2540'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '2605'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '3558'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '3558'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '11638'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '11638'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '11617' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11498'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '2944',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11633' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11638' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '11654' => {
                                       'Header' => undef,
                                       'Line' => '2026',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '12142'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '12182'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '12192'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '12307'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '12332'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '12192'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '12192'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '12192'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '12192'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '12192'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '12192'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '12192'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '12192'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '12362'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '12192'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '12192'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '12192'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '12192'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '12397'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '12427'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '12192'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '12192'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '12192'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '12192'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '12192'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '12192'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '12192'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '12192'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '12192'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '12217'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '12252'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '12272'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '12137' => {
                                       'BaseType' => '3024',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12142' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           },
                                                    '1' => {
                                                             'type' => '12137'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12172' => {
                                       'BaseType' => '12177',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12177' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '12182' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           },
                                                    '1' => {
                                                             'type' => '1977'
                                                           },
                                                    '2' => {
                                                             'type' => '12172'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12192' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '308',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12217' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6342'
                                                           },
                                                    '1' => {
                                                             'type' => '6477'
                                                           }
                                                  },
                                       'Return' => '8549',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12247' => {
                                       'BaseType' => '9122',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12252' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5102'
                                                           },
                                                    '1' => {
                                                             'type' => '8549'
                                                           },
                                                    '2' => {
                                                             'type' => '12247'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12272' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '8549'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '123' => {
                                     'BaseType' => '46',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '12302' => {
                                       'BaseType' => '5756',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12307' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4902'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           },
                                                    '2' => {
                                                             'type' => '12302'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12332' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4902'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12362' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5218'
                                                           },
                                                    '1' => {
                                                             'type' => '8860'
                                                           },
                                                    '2' => {
                                                             'type' => '9203'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12392' => {
                                       'BaseType' => '8780',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12397' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5102'
                                                           },
                                                    '1' => {
                                                             'type' => '8780'
                                                           },
                                                    '2' => {
                                                             'type' => '12392'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12427' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5102'
                                                           },
                                                    '1' => {
                                                             'type' => '8860'
                                                           },
                                                    '2' => {
                                                             'type' => '9203'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12432' => {
                                       'Header' => undef,
                                       'Line' => '2089',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '308'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '22',
                                                            'type' => '10156'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2001'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '68',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '72',
                                                            'type' => '6342'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '12694' => {
                                       'Name' => 'void*(*)(struct ibv_pd*, void*, size_t, size_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6342'
                                                           },
                                                    '1' => {
                                                             'type' => '308'
                                                           },
                                                    '2' => {
                                                             'type' => '419'
                                                           },
                                                    '3' => {
                                                             'type' => '419'
                                                           },
                                                    '4' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '308',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12725' => {
                                       'Name' => 'void(*)(struct ibv_pd*, void*, void*, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6342'
                                                           },
                                                    '1' => {
                                                             'type' => '308'
                                                           },
                                                    '2' => {
                                                             'type' => '308'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1298127' => {
                                         'Header' => undef,
                                         'Line' => '9',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_1',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MIN',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_2',
                                                              'value' => '1'
                                                            },
                                                     '3' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_3',
                                                              'value' => '2'
                                                            },
                                                     '4' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_4',
                                                              'value' => '3'
                                                            },
                                                     '5' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MAX',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum dr_arg_chunk_size',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1298181' => {
                                         'Header' => undef,
                                         'Line' => '19',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'log_chunk_size',
                                                              'offset' => '0',
                                                              'type' => '1298127'
                                                            },
                                                     '1' => {
                                                              'name' => 'dmn',
                                                              'offset' => '8',
                                                              'type' => '286570'
                                                            },
                                                     '2' => {
                                                              'name' => 'free_list',
                                                              'offset' => '22',
                                                              'type' => '14776'
                                                            },
                                                     '3' => {
                                                              'name' => 'mutex',
                                                              'offset' => '50',
                                                              'type' => '1265383'
                                                            }
                                                   },
                                         'Name' => 'struct dr_arg_pool',
                                         'Size' => '72',
                                         'Type' => 'Struct'
                                       },
                          '1298247' => {
                                         'BaseType' => '1298263',
                                         'Name' => 'struct dr_arg_pool*[4]',
                                         'Size' => '32',
                                         'Type' => 'Array'
                                       },
                          '1298263' => {
                                         'BaseType' => '1298181',
                                         'Name' => 'struct dr_arg_pool*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1314411' => {
                                         'Header' => undef,
                                         'Line' => '1178',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'arr',
                                                              'offset' => '0',
                                                              'type' => '8142'
                                                            },
                                                     '1' => {
                                                              'name' => 'count',
                                                              'offset' => '8',
                                                              'type' => '2001'
                                                            }
                                                   },
                                         'Name' => 'struct ibv_fd_arr',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1333973' => {
                                         'Header' => undef,
                                         'Line' => '1728',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'flags',
                                                              'offset' => '0',
                                                              'type' => '2001'
                                                            },
                                                     '1' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '8',
                                                              'type' => '2023'
                                                            },
                                                     '2' => {
                                                              'name' => 'fds',
                                                              'offset' => '22',
                                                              'type' => '1334029'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_context_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1334029' => {
                                         'BaseType' => '1314411',
                                         'Name' => 'struct ibv_fd_arr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1372501' => {
                                         'BaseType' => '1333973',
                                         'Name' => 'struct mlx5dv_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '13841' => {
                                       'BaseType' => '2023',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13881' => {
                                       'BaseType' => '11221',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14001' => {
                                       'BaseType' => '2694',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14031' => {
                                       'BaseType' => '11048',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14036' => {
                                       'BaseType' => '11277',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1408' => {
                                      'Header' => undef,
                                      'Line' => '49',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '159'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '346'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '128',
                                                            'type' => '346'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '136',
                                                            'type' => '346'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '150',
                                                            'type' => '1824'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '260',
                                                            'type' => '1829'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '274',
                                                            'type' => '159'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '278',
                                                            'type' => '159'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '288',
                                                            'type' => '248'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '296',
                                                            'type' => '58'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '304',
                                                            'type' => '111'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '305',
                                                            'type' => '1834'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '22',
                                                           'type' => '346'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '310',
                                                            'type' => '1850'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '324',
                                                            'type' => '260'
                                                          },
                                                  '22' => {
                                                            'name' => '_codecvt',
                                                            'offset' => '338',
                                                            'type' => '1860'
                                                          },
                                                  '23' => {
                                                            'name' => '_wide_data',
                                                            'offset' => '352',
                                                            'type' => '1870'
                                                          },
                                                  '24' => {
                                                            'name' => '_freeres_list',
                                                            'offset' => '360',
                                                            'type' => '1829'
                                                          },
                                                  '25' => {
                                                            'name' => '_freeres_buf',
                                                            'offset' => '374',
                                                            'type' => '308'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '388',
                                                            'type' => '419'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '402',
                                                            'type' => '159'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '406',
                                                            'type' => '1875'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '36',
                                                           'type' => '346'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '50',
                                                           'type' => '346'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '64',
                                                           'type' => '346'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '72',
                                                           'type' => '346'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '86',
                                                           'type' => '346'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '100',
                                                           'type' => '346'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '114',
                                                           'type' => '346'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '1433000' => {
                                         'Header' => undef,
                                         'Line' => '1740',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pci_name',
                                                              'offset' => '0',
                                                              'type' => '1967'
                                                            },
                                                     '1' => {
                                                              'name' => 'flags',
                                                              'offset' => '8',
                                                              'type' => '2001'
                                                            },
                                                     '2' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '22',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_vfio_context_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '14386' => {
                                       'BaseType' => '6874',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14446' => {
                                       'BaseType' => '12432',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14611' => {
                                       'BaseType' => '7472',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14641' => {
                                       'BaseType' => '2001',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '147' => {
                                     'BaseType' => '58',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '1471270' => {
                                         'BaseType' => '11498',
                                         'Name' => 'struct ibv_device**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1471275' => {
                                         'BaseType' => '1433000',
                                         'Name' => 'struct mlx5dv_vfio_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '14731' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '14771'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '14771'
                                                          }
                                                 },
                                       'Name' => 'struct list_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14771' => {
                                       'BaseType' => '14731',
                                       'Name' => 'struct list_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14776' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'n',
                                                            'offset' => '0',
                                                            'type' => '14731'
                                                          }
                                                 },
                                       'Name' => 'struct list_head',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '15330' => {
                                       'Header' => undef,
                                       'Line' => '42',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_RX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_TX',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_FDB',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_RX',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TX',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TRANSPORT_RX',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TRANSPORT_TX',
                                                            'value' => '6'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_table_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15390' => {
                                       'Header' => undef,
                                       'Line' => '52',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TUNNEL_TO_L2',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L2_TUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L3_TUNNEL_TO_L2',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L3_TUNNEL',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_action_packet_reformat_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15432' => {
                                       'Header' => undef,
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15470'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_cmd_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15470' => {
                                       'BaseType' => '2143',
                                       'Name' => '__u8[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '15485' => {
                                       'Header' => undef,
                                       'Line' => '68',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_MEMIC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_STEERING_SW_ICM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_SW_ICM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_PATTERN_SW_ICM',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_ENCAP_SW_ICM',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_dm_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15533' => {
                                       'Header' => undef,
                                       'Line' => '76',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DEVX_CR_EV_CH_FLAGS_OMIT_DATA',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_devx_create_event_channel_flags',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15557' => {
                                       'Header' => undef,
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15470'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_event_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15595' => {
                                       'Header' => undef,
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '2167'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '4',
                                                            'type' => '2167'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_reg',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15635' => {
                                       'Header' => undef,
                                       'Line' => '108',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'vport',
                                                            'offset' => '8',
                                                            'type' => '2155'
                                                          },
                                                   '2' => {
                                                            'name' => 'vport_vhca_id',
                                                            'offset' => '16',
                                                            'type' => '2155'
                                                          },
                                                   '3' => {
                                                            'name' => 'esw_owner_vhca_id',
                                                            'offset' => '18',
                                                            'type' => '2155'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsvd0',
                                                            'offset' => '20',
                                                            'type' => '2155'
                                                          },
                                                   '5' => {
                                                            'name' => 'vport_steering_icm_rx',
                                                            'offset' => '22',
                                                            'type' => '2179'
                                                          },
                                                   '6' => {
                                                            'name' => 'vport_steering_icm_tx',
                                                            'offset' => '36',
                                                            'type' => '2179'
                                                          },
                                                   '7' => {
                                                            'name' => 'reg_c0',
                                                            'offset' => '50',
                                                            'type' => '15595'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_query_port',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '159' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '16069' => {
                                       'Header' => undef,
                                       'Line' => '94',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_num',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_format',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cqe_comp_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '16109' => {
                                       'Header' => undef,
                                       'Line' => '99',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sw_parsing_offloads',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sw_parsing_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '16149' => {
                                       'Header' => undef,
                                       'Line' => '104',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'min_single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_single_stride_log_num_of_bytes',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'min_single_wqe_log_num_of_strides',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_single_wqe_log_num_of_strides',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '16228' => {
                                       'Header' => undef,
                                       'Line' => '112',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams_caps',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '16268' => {
                                       'Header' => undef,
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_T10DIF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_CRC',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16298' => {
                                       'Header' => undef,
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CRC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CSUM',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_t10dif_bg_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16328' => {
                                       'Header' => undef,
                                       'Line' => '153',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32C',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC64_XP10',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_crc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16364' => {
                                       'Header' => undef,
                                       'Line' => '165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_512',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_520',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4048',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4096',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4160',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_block_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16412' => {
                                       'Header' => undef,
                                       'Line' => '181',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'block_size',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_prot',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 't10dif_bg',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'crc_type',
                                                            'offset' => '20',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_caps',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16478' => {
                                       'Header' => undef,
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'failed_selftests',
                                                            'offset' => '0',
                                                            'type' => '1989'
                                                          },
                                                   '1' => {
                                                            'name' => 'crypto_engines',
                                                            'offset' => '2',
                                                            'type' => '1977'
                                                          },
                                                   '2' => {
                                                            'name' => 'wrapped_import_method',
                                                            'offset' => '3',
                                                            'type' => '1977'
                                                          },
                                                   '3' => {
                                                            'name' => 'log_max_num_deks',
                                                            'offset' => '4',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '16557' => {
                                       'Header' => undef,
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_rc',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_xrc',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_dct',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_ud',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_uc',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_ooo_recv_wrs_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '166' => {
                                     'BaseType' => '159',
                                     'Name' => 'int volatile',
                                     'Size' => '4',
                                     'Type' => 'Volatile'
                                   },
                          '16636' => {
                                       'Header' => undef,
                                       'Line' => '228',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '10' => {
                                                             'name' => 'dc_odp_caps',
                                                             'offset' => '132',
                                                             'type' => '2001'
                                                           },
                                                   '11' => {
                                                             'name' => 'hca_core_clock',
                                                             'offset' => '136',
                                                             'type' => '308'
                                                           },
                                                   '12' => {
                                                             'name' => 'num_lag_ports',
                                                             'offset' => '150',
                                                             'type' => '1977'
                                                           },
                                                   '13' => {
                                                             'name' => 'sig_caps',
                                                             'offset' => '260',
                                                             'type' => '16412'
                                                           },
                                                   '14' => {
                                                             'name' => 'dci_streams_caps',
                                                             'offset' => '288',
                                                             'type' => '16228'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_wr_memcpy_length',
                                                             'offset' => '296',
                                                             'type' => '419'
                                                           },
                                                   '16' => {
                                                             'name' => 'crypto_caps',
                                                             'offset' => '310',
                                                             'type' => '16478'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dc_rd_atom',
                                                             'offset' => '338',
                                                             'type' => '2023'
                                                           },
                                                   '18' => {
                                                             'name' => 'max_dc_init_rd_atom',
                                                             'offset' => '352',
                                                             'type' => '2023'
                                                           },
                                                   '19' => {
                                                             'name' => 'reg_c0',
                                                             'offset' => '360',
                                                             'type' => '15595'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '20' => {
                                                             'name' => 'ooo_recv_wrs_caps',
                                                             'offset' => '374',
                                                             'type' => '16557'
                                                           },
                                                   '3' => {
                                                            'name' => 'cqe_comp_caps',
                                                            'offset' => '36',
                                                            'type' => '16069'
                                                          },
                                                   '4' => {
                                                            'name' => 'sw_parsing_caps',
                                                            'offset' => '50',
                                                            'type' => '16109'
                                                          },
                                                   '5' => {
                                                            'name' => 'striding_rq_caps',
                                                            'offset' => '64',
                                                            'type' => '16149'
                                                          },
                                                   '6' => {
                                                            'name' => 'tunnel_offloads_caps',
                                                            'offset' => '96',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_dynamic_bfregs',
                                                            'offset' => '100',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_clock_info_update_nsec',
                                                            'offset' => '114',
                                                            'type' => '2023'
                                                          },
                                                   '9' => {
                                                            'name' => 'flow_action_flags',
                                                            'offset' => '128',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_context',
                                       'Size' => '200',
                                       'Type' => 'Struct'
                                     },
                          '16923' => {
                                       'Header' => undef,
                                       'Line' => '278',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_comp_res_format',
                                                            'offset' => '8',
                                                            'type' => '1977'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '22',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16993' => {
                                       'Header' => undef,
                                       'Line' => '308',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pd',
                                                            'offset' => '0',
                                                            'type' => '6342'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_entries',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17048' => {
                                       'Header' => undef,
                                       'Line' => '314',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '17090' => {
                                       'Header' => undef,
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCT',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCI',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17119' => {
                                       'Header' => undef,
                                       'Line' => '334',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '17161' => {
                                       'Header' => undef,
                                       'Line' => '341',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dct_access_key',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'dci_streams',
                                                            'offset' => '0',
                                                            'type' => '17119'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '17197' => {
                                       'Header' => undef,
                                       'Line' => '339',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dc_type',
                                                            'offset' => '0',
                                                            'type' => '17090'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '17161'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dc_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17231' => {
                                       'Header' => undef,
                                       'Line' => '355',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'dc_init_attr',
                                                            'offset' => '22',
                                                            'type' => '17197'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_init_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '17301' => {
                                       'Header' => undef,
                                       'Line' => '366',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'bytes_count',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes_skip',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'lkey',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mr_interleaved',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '17371' => {
                                       'BaseType' => '17301',
                                       'Name' => 'struct mlx5dv_mr_interleaved const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '17376' => {
                                       'Header' => undef,
                                       'Line' => '379',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bg_type',
                                                            'offset' => '0',
                                                            'type' => '16298'
                                                          },
                                                   '1' => {
                                                            'name' => 'bg',
                                                            'offset' => '4',
                                                            'type' => '1989'
                                                          },
                                                   '2' => {
                                                            'name' => 'app_tag',
                                                            'offset' => '6',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'ref_tag',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_t10dif',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1740567' => {
                                         'Header' => undef,
                                         'Line' => '599',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MLX5DV_MKEY_NO_ERR',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_GUARD',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_REFTAG',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_APPTAG',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum mlx5dv_mkey_err_type',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1740609' => {
                                         'Header' => undef,
                                         'Line' => '606',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'actual_value',
                                                              'offset' => '0',
                                                              'type' => '2023'
                                                            },
                                                     '1' => {
                                                              'name' => 'expected_value',
                                                              'offset' => '8',
                                                              'type' => '2023'
                                                            },
                                                     '2' => {
                                                              'name' => 'offset',
                                                              'offset' => '22',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_sig_err',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1740665' => {
                                         'Header' => undef,
                                         'Line' => '614',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'sig',
                                                              'offset' => '0',
                                                              'type' => '1740609'
                                                            }
                                                   },
                                         'Size' => '24',
                                         'Type' => 'Union'
                                       },
                          '1740688' => {
                                         'Header' => undef,
                                         'Line' => '612',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'err_type',
                                                              'offset' => '0',
                                                              'type' => '1740567'
                                                            },
                                                     '1' => {
                                                              'name' => 'err',
                                                              'offset' => '8',
                                                              'type' => '1740665'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_mkey_err',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '17459' => {
                                       'BaseType' => '17376',
                                       'Name' => 'struct mlx5dv_sig_t10dif const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '17464' => {
                                       'Header' => undef,
                                       'Line' => '387',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '16328'
                                                          },
                                                   '1' => {
                                                            'name' => 'seed',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_crc',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17506' => {
                                       'BaseType' => '17464',
                                       'Name' => 'struct mlx5dv_sig_crc const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '17511' => {
                                       'Header' => undef,
                                       'Line' => '394',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dif',
                                                            'offset' => '0',
                                                            'type' => '17547'
                                                          },
                                                   '1' => {
                                                            'name' => 'crc',
                                                            'offset' => '0',
                                                            'type' => '17552'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '17547' => {
                                       'BaseType' => '17459',
                                       'Name' => 'struct mlx5dv_sig_t10dif const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17552' => {
                                       'BaseType' => '17506',
                                       'Name' => 'struct mlx5dv_sig_crc const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17557' => {
                                       'Header' => undef,
                                       'Line' => '392',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sig_type',
                                                            'offset' => '0',
                                                            'type' => '16268'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig',
                                                            'offset' => '8',
                                                            'type' => '17511'
                                                          },
                                                   '2' => {
                                                            'name' => 'block_size',
                                                            'offset' => '22',
                                                            'type' => '16364'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_domain',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '176' => {
                                     'BaseType' => '70',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '17627' => {
                                       'BaseType' => '17557',
                                       'Name' => 'struct mlx5dv_sig_block_domain const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17632' => {
                                       'Header' => undef,
                                       'Line' => '415',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem',
                                                            'offset' => '0',
                                                            'type' => '17735'
                                                          },
                                                   '1' => {
                                                            'name' => 'wire',
                                                            'offset' => '8',
                                                            'type' => '17735'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'check_mask',
                                                            'offset' => '32',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'copy_mask',
                                                            'offset' => '33',
                                                            'type' => '1977'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '17730' => {
                                       'BaseType' => '17632',
                                       'Name' => 'struct mlx5dv_sig_block_attr const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17735' => {
                                       'BaseType' => '17627',
                                       'Name' => 'struct mlx5dv_sig_block_domain const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17740' => {
                                       'Header' => undef,
                                       'Line' => '424',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_STANDARD_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_standard',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17763' => {
                                       'Header' => undef,
                                       'Line' => '428',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_AFTER_CRYPTO_ON_TX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_BEFORE_CRYPTO_ON_TX',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_signature_crypto_order',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17792' => {
                                       'Header' => undef,
                                       'Line' => '433',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crypto_standard',
                                                            'offset' => '0',
                                                            'type' => '17740'
                                                          },
                                                   '1' => {
                                                            'name' => 'encrypt_on_tx',
                                                            'offset' => '4',
                                                            'type' => '2091'
                                                          },
                                                   '2' => {
                                                            'name' => 'signature_crypto_order',
                                                            'offset' => '8',
                                                            'type' => '17763'
                                                          },
                                                   '3' => {
                                                            'name' => 'data_unit_size',
                                                            'offset' => '18',
                                                            'type' => '16364'
                                                          },
                                                   '4' => {
                                                            'name' => 'initial_tweak',
                                                            'offset' => '22',
                                                            'type' => '17923'
                                                          },
                                                   '5' => {
                                                            'name' => 'dek',
                                                            'offset' => '50',
                                                            'type' => '17967'
                                                          },
                                                   '6' => {
                                                            'name' => 'keytag',
                                                            'offset' => '64',
                                                            'type' => '978'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '17918' => {
                                       'BaseType' => '17792',
                                       'Name' => 'struct mlx5dv_crypto_attr const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '17923' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '17939' => {
                                       'Header' => undef,
                                       'Line' => '921',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19679'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1794078' => {
                                         'BaseType' => '1740688',
                                         'Name' => 'struct mlx5dv_mkey_err*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '17967' => {
                                       'BaseType' => '17939',
                                       'Name' => 'struct mlx5dv_dek*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17972' => {
                                       'Header' => undef,
                                       'Line' => '448',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conf_flags',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_conf_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1799' => {
                                      'BaseType' => '1408',
                                      'Header' => undef,
                                      'Line' => '7',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '18014' => {
                                       'Header' => undef,
                                       'Line' => '459',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'wr_set_dc_addr',
                                                            'offset' => '8',
                                                            'type' => '18241'
                                                          },
                                                   '10' => {
                                                             'name' => 'wr_set_dc_addr_stream',
                                                             'offset' => '128',
                                                             'type' => '18530'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_memcpy',
                                                             'offset' => '136',
                                                             'type' => '18571'
                                                           },
                                                   '12' => {
                                                             'name' => 'wr_set_mkey_crypto',
                                                             'offset' => '150',
                                                             'type' => '18597'
                                                           },
                                                   '2' => {
                                                            'name' => 'wr_mr_interleaved',
                                                            'offset' => '22',
                                                            'type' => '18292'
                                                          },
                                                   '3' => {
                                                            'name' => 'wr_mr_list',
                                                            'offset' => '36',
                                                            'type' => '18328'
                                                          },
                                                   '4' => {
                                                            'name' => 'wr_mkey_configure',
                                                            'offset' => '50',
                                                            'type' => '18364'
                                                          },
                                                   '5' => {
                                                            'name' => 'wr_set_mkey_access_flags',
                                                            'offset' => '64',
                                                            'type' => '18385'
                                                          },
                                                   '6' => {
                                                            'name' => 'wr_set_mkey_layout_list',
                                                            'offset' => '72',
                                                            'type' => '18411'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr_set_mkey_layout_interleaved',
                                                            'offset' => '86',
                                                            'type' => '18447'
                                                          },
                                                   '8' => {
                                                            'name' => 'wr_set_mkey_sig_block',
                                                            'offset' => '100',
                                                            'type' => '18473'
                                                          },
                                                   '9' => {
                                                            'name' => 'wr_raw_wqe',
                                                            'offset' => '114',
                                                            'type' => '18494'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_ex',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '1811' => {
                                      'BaseType' => '1',
                                      'Header' => undef,
                                      'Line' => '43',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '1819' => {
                                      'Name' => 'struct _IO_marker',
                                      'Type' => 'Struct'
                                    },
                          '18236' => {
                                       'BaseType' => '18014',
                                       'Name' => 'struct mlx5dv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1824' => {
                                      'BaseType' => '1819',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18241' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '8396'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18282' => {
                                       'BaseType' => '17048',
                                       'Name' => 'struct mlx5dv_mkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18287' => {
                                       'BaseType' => '17301',
                                       'Name' => 'struct mlx5dv_mr_interleaved*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1829' => {
                                      'BaseType' => '1408',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18292' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint32_t, uint16_t, struct mlx5dv_mr_interleaved*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '18282'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2001'
                                                           },
                                                    '4' => {
                                                             'type' => '1989'
                                                           },
                                                    '5' => {
                                                             'type' => '18287'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18328' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint16_t, struct ibv_sge*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '18282'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '1989'
                                                           },
                                                    '4' => {
                                                             'type' => '8785'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1834' => {
                                      'BaseType' => '356',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '18359' => {
                                       'BaseType' => '17972',
                                       'Name' => 'struct mlx5dv_mkey_conf_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18364' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint8_t, struct mlx5dv_mkey_conf_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '18282'
                                                           },
                                                    '2' => {
                                                             'type' => '1977'
                                                           },
                                                    '3' => {
                                                             'type' => '18359'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18385' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18411' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint16_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '1989'
                                                           },
                                                    '2' => {
                                                             'type' => '9999'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18442' => {
                                       'BaseType' => '17371',
                                       'Name' => 'struct mlx5dv_mr_interleaved const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18447' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint16_t, struct mlx5dv_mr_interleaved const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '1989'
                                                           },
                                                    '3' => {
                                                             'type' => '18442'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18468' => {
                                       'BaseType' => '17730',
                                       'Name' => 'struct mlx5dv_sig_block_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18473' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_sig_block_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '18468'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18494' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '1961'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1850' => {
                                      'BaseType' => '1811',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18530' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t, uint16_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '8396'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           },
                                                    '4' => {
                                                             'type' => '1989'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1855' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'Type' => 'Struct'
                                    },
                          '18571' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint64_t, uint32_t, uint64_t, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '2023'
                                                           },
                                                    '3' => {
                                                             'type' => '2001'
                                                           },
                                                    '4' => {
                                                             'type' => '2023'
                                                           },
                                                    '5' => {
                                                             'type' => '419'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18592' => {
                                       'BaseType' => '17918',
                                       'Name' => 'struct mlx5dv_crypto_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18597' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_crypto_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18236'
                                                           },
                                                    '1' => {
                                                             'type' => '18592'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1860' => {
                                      'BaseType' => '1855',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18602' => {
                                       'Header' => undef,
                                       'Line' => '638',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '950'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '86',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1865' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'Type' => 'Struct'
                                    },
                          '18672' => {
                                       'Header' => undef,
                                       'Line' => '645',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '1961'
                                                          },
                                                   '3' => {
                                                            'name' => 'credential_len',
                                                            'offset' => '22',
                                                            'type' => '419'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1870' => {
                                      'BaseType' => '1865',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1875' => {
                                      'BaseType' => '356',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '18756' => {
                                       'Header' => undef,
                                       'Line' => '652',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_VALID',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_NO_LOGIN',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_INVALID',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_login_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18791' => {
                                       'Header' => undef,
                                       'Line' => '658',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18756'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_query_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '188' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '18833' => {
                                       'Header' => undef,
                                       'Line' => '680',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_128',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_256',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18862' => {
                                       'Header' => undef,
                                       'Line' => '685',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_PURPOSE_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_purpose',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18885' => {
                                       'Header' => undef,
                                       'Line' => '689',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DEK_STATE_READY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DEK_STATE_ERROR',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dek_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18914' => {
                                       'Header' => undef,
                                       'Line' => '698',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key_size',
                                                            'offset' => '0',
                                                            'type' => '18833'
                                                          },
                                                   '1' => {
                                                            'name' => 'has_keytag',
                                                            'offset' => '4',
                                                            'type' => '2091'
                                                          },
                                                   '2' => {
                                                            'name' => 'key_purpose',
                                                            'offset' => '8',
                                                            'type' => '18862'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd',
                                                            'offset' => '22',
                                                            'type' => '6342'
                                                          },
                                                   '4' => {
                                                            'name' => 'opaque',
                                                            'offset' => '36',
                                                            'type' => '978'
                                                          },
                                                   '5' => {
                                                            'name' => 'key',
                                                            'offset' => '50',
                                                            'type' => '19039'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '352',
                                                            'type' => '2023'
                                                          },
                                                   '7' => {
                                                            'name' => 'crypto_login',
                                                            'offset' => '360',
                                                            'type' => '19083'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_init_attr',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '1903' => {
                                      'BaseType' => '248',
                                      'Header' => undef,
                                      'Line' => '63',
                                      'Name' => 'off_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19039' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '19055' => {
                                       'Header' => undef,
                                       'Line' => '917',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19679'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_obj',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '19083' => {
                                       'BaseType' => '19055',
                                       'Name' => 'struct mlx5dv_crypto_login_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19088' => {
                                       'Header' => undef,
                                       'Line' => '709',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18885'
                                                          },
                                                   '1' => {
                                                            'name' => 'opaque',
                                                            'offset' => '4',
                                                            'type' => '978'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '19144' => {
                                       'Header' => undef,
                                       'Line' => '728',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'action_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_esp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1915' => {
                                      'BaseType' => '310',
                                      'Header' => undef,
                                      'Line' => '77',
                                      'Name' => 'ssize_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19186' => {
                                       'Header' => undef,
                                       'Line' => '733',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'match_sz',
                                                            'offset' => '0',
                                                            'type' => '419'
                                                          },
                                                   '1' => {
                                                            'name' => 'match_buf',
                                                            'offset' => '8',
                                                            'type' => '19228'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_match_parameters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '19228' => {
                                       'BaseType' => '2023',
                                       'Name' => 'uint64_t[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '19243' => {
                                       'Header' => undef,
                                       'Line' => '743',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '10991'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'priority',
                                                            'offset' => '8',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'match_criteria_enable',
                                                            'offset' => '16',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'match_mask',
                                                            'offset' => '22',
                                                            'type' => '19369'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '6' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '50',
                                                            'type' => '15330'
                                                          },
                                                   '7' => {
                                                            'name' => 'ib_port',
                                                            'offset' => '54',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_matcher_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '1927' => {
                                      'BaseType' => '1799',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19369' => {
                                       'BaseType' => '19186',
                                       'Name' => 'struct mlx5dv_flow_match_parameters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19374' => {
                                       'Header' => undef,
                                       'Line' => '762',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '0',
                                                            'type' => '15330'
                                                          },
                                                   '1' => {
                                                            'name' => 'priority',
                                                            'offset' => '4',
                                                            'type' => '1989'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19430' => {
                                       'Header' => undef,
                                       'Line' => '768',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '19457' => {
                                       'Header' => undef,
                                       'Line' => '777',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_IBV_QP',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DROP',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_COUNTER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_FLOW_ACTION',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_TAG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_DEVX',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEFAULT_MISS',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX_WITH_OFFSET',
                                                            'value' => '8'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_flow_action_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '19528' => {
                                       'Header' => undef,
                                       'Line' => '797',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'obj',
                                                            'offset' => '0',
                                                            'type' => '19679'
                                                          },
                                                   '1' => {
                                                            'name' => 'offset',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19567' => {
                                       'Header' => undef,
                                       'Line' => '796',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '18',
                                                            'type' => '28657'
                                                          },
                                                   '3' => {
                                                            'name' => 'object_id',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'rx_icm_addr',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'log_obj_range',
                                                            'offset' => '50',
                                                            'type' => '1977'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv',
                                                            'offset' => '64',
                                                            'type' => '308'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_obj',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1961' => {
                                      'BaseType' => '1966',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1966' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1967' => {
                                      'BaseType' => '363',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19679' => {
                                       'BaseType' => '19567',
                                       'Name' => 'struct mlx5dv_devx_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19684' => {
                                       'Header' => undef,
                                       'Line' => '791',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '5102'
                                                          },
                                                   '1' => {
                                                            'name' => 'counter',
                                                            'offset' => '0',
                                                            'type' => '11104'
                                                          },
                                                   '2' => {
                                                            'name' => 'action',
                                                            'offset' => '0',
                                                            'type' => '14031'
                                                          },
                                                   '3' => {
                                                            'name' => 'tag_value',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'obj',
                                                            'offset' => '0',
                                                            'type' => '19679'
                                                          },
                                                   '5' => {
                                                            'name' => 'bulk_obj',
                                                            'offset' => '0',
                                                            'type' => '19528'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '1977' => {
                                      'BaseType' => '123',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '19771' => {
                                       'Header' => undef,
                                       'Line' => '789',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '19457'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '19684'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '19805' => {
                                       'Header' => undef,
                                       'Line' => '864',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19858' => {
                                       'Header' => undef,
                                       'Line' => '869',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1989' => {
                                      'BaseType' => '147',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '19911' => {
                                       'Header' => undef,
                                       'Line' => '874',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19950' => {
                                       'Header' => undef,
                                       'Line' => '862',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '0',
                                                            'type' => '20115'
                                                          },
                                                   '1' => {
                                                            'name' => 'sq',
                                                            'offset' => '8',
                                                            'type' => '19805'
                                                          },
                                                   '10' => {
                                                             'name' => 'tir_icm_addr',
                                                             'offset' => '136',
                                                             'type' => '2023'
                                                           },
                                                   '2' => {
                                                            'name' => 'rq',
                                                            'offset' => '36',
                                                            'type' => '19858'
                                                          },
                                                   '3' => {
                                                            'name' => 'bf',
                                                            'offset' => '64',
                                                            'type' => '19911'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '86',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '100',
                                                            'type' => '1903'
                                                          },
                                                   '6' => {
                                                            'name' => 'tirn',
                                                            'offset' => '114',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'tisn',
                                                            'offset' => '118',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'rqn',
                                                            'offset' => '128',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'sqn',
                                                            'offset' => '132',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp',
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '200' => {
                                     'BaseType' => '82',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2001' => {
                                      'BaseType' => '176',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '20115' => {
                                       'BaseType' => '2203',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20120' => {
                                       'Header' => undef,
                                       'Line' => '887',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '20115'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '36',
                                                            'type' => '308'
                                                          },
                                                   '5' => {
                                                            'name' => 'cqn',
                                                            'offset' => '50',
                                                            'type' => '2001'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '2023' => {
                                      'BaseType' => '200',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20232' => {
                                       'Header' => undef,
                                       'Line' => '901',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '20115'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'head',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'tail',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '6' => {
                                                            'name' => 'srqn',
                                                            'offset' => '64',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '20344' => {
                                       'Header' => undef,
                                       'Line' => '911',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '20115'
                                                          },
                                                   '2' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'stride',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_rwq',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '20428' => {
                                       'Header' => undef,
                                       'Line' => '919',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '15485'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_alloc_dm_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20470' => {
                                       'Header' => undef,
                                       'Line' => '928',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'remote_va',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dm',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '20540' => {
                                       'Header' => undef,
                                       'Line' => '949',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'av',
                                                            'offset' => '0',
                                                            'type' => '20749'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_ah',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20581' => {
                                       'Header' => undef,
                                       'Line' => '1303',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '21557'
                                                          },
                                                   '1' => {
                                                            'name' => 'dqp_dct',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '10' => {
                                                             'name' => 'rgid',
                                                             'offset' => '50',
                                                             'type' => '2524'
                                                           },
                                                   '2' => {
                                                            'name' => 'stat_rate_sl',
                                                            'offset' => '18',
                                                            'type' => '1977'
                                                          },
                                                   '3' => {
                                                            'name' => 'fl_mlid',
                                                            'offset' => '19',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'rlid',
                                                            'offset' => '20',
                                                            'type' => '2191'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved0',
                                                            'offset' => '22',
                                                            'type' => '21403'
                                                          },
                                                   '6' => {
                                                            'name' => 'rmac',
                                                            'offset' => '32',
                                                            'type' => '11032'
                                                          },
                                                   '7' => {
                                                            'name' => 'tclass',
                                                            'offset' => '38',
                                                            'type' => '1977'
                                                          },
                                                   '8' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '39',
                                                            'type' => '1977'
                                                          },
                                                   '9' => {
                                                            'name' => 'grh_gid_fl',
                                                            'offset' => '40',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_wqe_av',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '20749' => {
                                       'BaseType' => '20581',
                                       'Name' => 'struct mlx5_wqe_av*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20754' => {
                                       'Header' => undef,
                                       'Line' => '954',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdn',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20796' => {
                                       'Header' => undef,
                                       'Line' => '959',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'handle',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '20824' => {
                                       'Header' => undef,
                                       'Line' => '964',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5102'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20862'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20862' => {
                                       'BaseType' => '19950',
                                       'Name' => 'struct mlx5dv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20867' => {
                                       'Header' => undef,
                                       'Line' => '968',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4902'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20905'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20905' => {
                                       'BaseType' => '20120',
                                       'Name' => 'struct mlx5dv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2091' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '20910' => {
                                       'Header' => undef,
                                       'Line' => '972',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5218'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20948'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20948' => {
                                       'BaseType' => '20232',
                                       'Name' => 'struct mlx5dv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20953' => {
                                       'Header' => undef,
                                       'Line' => '976',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5417'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20991'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20991' => {
                                       'BaseType' => '20344',
                                       'Name' => 'struct mlx5dv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20996' => {
                                       'Header' => undef,
                                       'Line' => '980',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '2979'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '21034'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '2103' => {
                                      'BaseType' => '171',
                                      'Header' => undef,
                                      'Line' => '46',
                                      'Name' => 'atomic_int',
                                      'Type' => 'Typedef'
                                    },
                          '21034' => {
                                       'BaseType' => '20470',
                                       'Name' => 'struct mlx5dv_dm*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21039' => {
                                       'Header' => undef,
                                       'Line' => '984',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '8396'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '21077'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21077' => {
                                       'BaseType' => '20540',
                                       'Name' => 'struct mlx5dv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21082' => {
                                       'Header' => undef,
                                       'Line' => '988',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6342'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '21120'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21120' => {
                                       'BaseType' => '20754',
                                       'Name' => 'struct mlx5dv_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21125' => {
                                       'Header' => undef,
                                       'Line' => '992',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '19679'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '21163'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21163' => {
                                       'BaseType' => '20796',
                                       'Name' => 'struct mlx5dv_devx*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21168' => {
                                       'Header' => undef,
                                       'Line' => '963',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '20824'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '22',
                                                            'type' => '20867'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '50',
                                                            'type' => '20910'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '72',
                                                            'type' => '20953'
                                                          },
                                                   '4' => {
                                                            'name' => 'dm',
                                                            'offset' => '100',
                                                            'type' => '20996'
                                                          },
                                                   '5' => {
                                                            'name' => 'ah',
                                                            'offset' => '128',
                                                            'type' => '21039'
                                                          },
                                                   '6' => {
                                                            'name' => 'pd',
                                                            'offset' => '150',
                                                            'type' => '21082'
                                                          },
                                                   '7' => {
                                                            'name' => 'devx',
                                                            'offset' => '274',
                                                            'type' => '21125'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_obj',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '21289' => {
                                       'Header' => undef,
                                       'Line' => '1013',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'single_wqe_log_num_of_strides',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'two_byte_shift_en',
                                                            'offset' => '8',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_init_attr',
