$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.1.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx5.so.1.24.42.0',
          'LibraryVersion' => 'mlx5',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '1186017' => {
                                           'Header' => undef,
                                           'Line' => '5617',
                                           'Param' => {
                                                        '0' => {
                                                                 'name' => 'context',
                                                                 'type' => '2938'
                                                               },
                                                        '1' => {
                                                                 'name' => 'addr',
                                                                 'type' => '267'
                                                               },

                                                     'mlx5dv_dump_dr_matcher@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_rule@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_table@@MLX5_1.12' => 1,
                                                     'mlx5dv_free_var@@MLX5_1.12' => 1,
                                                     'mlx5dv_get_clock_info@@MLX5_1.4' => 1,
                                                     'mlx5dv_get_vfio_device_list@@MLX5_1.21' => 1,
                                                     'mlx5dv_init_obj@@MLX5_1.2' => 1,
                                                     'mlx5dv_init_obj@MLX5_1.0' => 1,
                                                     'mlx5dv_is_supported@@MLX5_1.8' => 1,
                                                     'mlx5dv_map_ah_to_qp@@MLX5_1.20' => 1,
                                                     'mlx5dv_modify_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_modify_qp_sched_elem@@MLX5_1.17' => 1,
                                                     'mlx5dv_modify_qp_udp_sport@@MLX5_1.17' => 1,
                                                     'mlx5dv_open_device@@MLX5_1.7' => 1,
                                                     'mlx5dv_pp_alloc@@MLX5_1.13' => 1,
                                                     'mlx5dv_pp_free@@MLX5_1.13' => 1,
                                                     'mlx5dv_qp_cancel_posted_send_wrs@@MLX5_1.20' => 1,
                                                     'mlx5dv_qp_ex_from_ibv_qp_ex@@MLX5_1.10' => 1,
                                                     'mlx5dv_query_device@@MLX5_1.0' => 1,
                                                     'mlx5dv_query_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_reserved_qpn_alloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_reserved_qpn_dealloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_sched_leaf_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_set_context_attr@@MLX5_1.2' => 1,
                                                     'mlx5dv_vfio_get_events_fd@@MLX5_1.21' => 1,
                                                     'mlx5dv_vfio_process_events@@MLX5_1.21' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10004' => {
                                       'Header' => undef,
                                       'Line' => '1475',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tag',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wc_tm_info',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10047' => {
                                       'Header' => undef,
                                       'Line' => '1480',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2938'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '9969'
                                                          },
                                                   '10' => {
                                                             'name' => 'status',
                                                             'offset' => '132',
                                                             'type' => '5426'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '136',
                                                             'type' => '2028'
                                                           },
                                                   '12' => {
                                                             'name' => 'start_poll',
                                                             'offset' => '144',
                                                             'type' => '10519'
                                                           },
                                                   '13' => {
                                                             'name' => 'next_poll',
                                                             'offset' => '152',
                                                             'type' => '10540'
                                                           },
                                                   '14' => {
                                                             'name' => 'end_poll',
                                                             'offset' => '160',
                                                             'type' => '10557'
                                                           },
                                                   '15' => {
                                                             'name' => 'read_opcode',
                                                             'offset' => '168',
                                                             'type' => '10578'
                                                           },
                                                   '16' => {
                                                             'name' => 'read_vendor_err',
                                                             'offset' => '176',
                                                             'type' => '10599'
                                                           },
                                                   '17' => {
                                                             'name' => 'read_byte_len',
                                                             'offset' => '184',
                                                             'type' => '10599'
                                                           },
                                                   '18' => {
                                                             'name' => 'read_imm_data',
                                                             'offset' => '192',
                                                             'type' => '10620'
                                                           },
                                                   '19' => {
                                                             'name' => 'read_qp_num',
                                                             'offset' => '200',
                                                             'type' => '10599'
                                                           },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '16',
                                                            'type' => '267'
                                                          },
                                                   '20' => {
                                                             'name' => 'read_src_qp',
                                                             'offset' => '208',
                                                             'type' => '10599'
                                                           },
                                                   '21' => {
                                                             'name' => 'read_wc_flags',
                                                             'offset' => '216',
                                                             'type' => '10641'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_slid',
                                                             'offset' => '224',
                                                             'type' => '10599'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_sl',
                                                             'offset' => '232',
                                                             'type' => '10662'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_dlid_path_bits',
                                                             'offset' => '240',
                                                             'type' => '10662'
                                                           },
                                                   '25' => {
                                                             'name' => 'read_completion_ts',
                                                             'offset' => '248',
                                                             'type' => '10683'
                                                           },
                                                   '26' => {
                                                             'name' => 'read_cvlan',
                                                             'offset' => '256',
                                                             'type' => '10704'
                                                           },
                                                   '27' => {
                                                             'name' => 'read_flow_tag',
                                                             'offset' => '264',
                                                             'type' => '10599'
                                                           },
                                                   '28' => {
                                                             'name' => 'read_tm_info',
                                                             'offset' => '272',
                                                             'type' => '10732'
                                                           },
                                                   '29' => {
                                                             'name' => 'read_completion_wallclock_ns',
                                                             'offset' => '280',
                                                             'type' => '10683'
                                                           },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '24',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '28',
                                                            'type' => '128'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '32',
                                                            'type' => '897'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '72',
                                                            'type' => '971'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '120',
                                                            'type' => '2011'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '124',
                                                            'type' => '2011'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '128',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_ex',
                                       'Size' => '288',
                                       'Type' => 'Struct'
                                     },
                          '10507' => {
                                       'BaseType' => '10047',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10513' => {
                                       'BaseType' => '9975',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10519' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           },
                                                    '1' => {
                                                             'type' => '10513'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10540' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10557' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10578' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '5590',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10599' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '2011',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10620' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '2165',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10641' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '59',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10662' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '1987',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10683' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '2028',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10704' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           }
                                                  },
                                       'Return' => '1999',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10726' => {
                                       'BaseType' => '10004',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10732' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10507'
                                                           },
                                                    '1' => {
                                                             'type' => '10726'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10824' => {
                                       'Header' => undef,
                                       'Line' => '1657',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10868' => {
                                       'BaseType' => '1987',
                                       'Name' => 'uint8_t[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '10884' => {
                                       'Header' => undef,
                                       'Line' => '1889',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2938'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10913' => {
                                       'Header' => undef,
                                       'Line' => '2054',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2938'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10942' => {
                                       'BaseType' => '10913',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11061' => {
                                       'Header' => undef,
                                       'Line' => '1883',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2938'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11118' => {
                                       'Header' => undef,
                                       'Line' => '1897',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '11273'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '2205'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '12',
                                                            'type' => '1999'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '16',
                                                            'type' => '267'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '24',
                                                            'type' => '2230'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '28',
                                                            'type' => '1999'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '32',
                                                            'type' => '267'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '40',
                                                            'type' => '2388'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '2011'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '52',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '11273' => {
                                       'BaseType' => '2394',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11279' => {
                                       'Header' => undef,
                                       'Line' => '1918',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '11463'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '11480'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11342' => {
                                       'BaseType' => '11348',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11348' => {
                                       'Header' => undef,
                                       'Line' => '1928',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '11279'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '16',
                                                            'type' => '2528'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '20',
                                                            'type' => '2595'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '24',
                                                            'type' => '3556'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '88',
                                                            'type' => '3556'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '152',
                                                            'type' => '11486'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '408',
                                                            'type' => '11486'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '11463' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11342'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           }
                                                  },
                                       'Return' => '2938',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11480' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2938'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11486' => {
                                       'BaseType' => '316',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '11502' => {
                                       'Header' => undef,
                                       'Line' => '1943',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '11992'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '12034'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '80',
                                                             'type' => '12045'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '88',
                                                             'type' => '12166'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '96',
                                                             'type' => '12192'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '104',
                                                             'type' => '12045'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '112',
                                                             'type' => '12045'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '120',
                                                             'type' => '12045'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '128',
                                                             'type' => '12045'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '136',
                                                             'type' => '12045'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '144',
                                                             'type' => '12045'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '152',
                                                             'type' => '12045'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '16',
                                                            'type' => '12045'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '160',
                                                             'type' => '12223'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '168',
                                                             'type' => '12045'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '176',
                                                             'type' => '12045'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '184',
                                                             'type' => '12045'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '192',
                                                             'type' => '12045'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '200',
                                                             'type' => '12260'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '208',
                                                             'type' => '12291'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '216',
                                                             'type' => '12045'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '224',
                                                             'type' => '12045'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '232',
                                                             'type' => '12045'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '24',
                                                            'type' => '12045'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '240',
                                                             'type' => '12045'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '248',
                                                             'type' => '12045'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '32',
                                                            'type' => '12045'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '40',
                                                            'type' => '12045'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '48',
                                                            'type' => '12045'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '56',
                                                            'type' => '12071'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '64',
                                                            'type' => '12108'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '72',
                                                            'type' => '12129'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '116' => {
                                     'BaseType' => '52',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '11986' => {
                                       'BaseType' => '3022',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11992' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2938'
                                                           },
                                                    '1' => {
                                                             'type' => '11986'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12023' => {
                                       'BaseType' => '12029',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12029' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '12034' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2938'
                                                           },
                                                    '1' => {
                                                             'type' => '1987'
                                                           },
                                                    '2' => {
                                                             'type' => '12023'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12045' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '267',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12071' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6322'
                                                           },
                                                    '1' => {
                                                             'type' => '6328'
                                                           }
                                                  },
                                       'Return' => '8428',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12102' => {
                                       'BaseType' => '9013',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12108' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5101'
                                                           },
                                                    '1' => {
                                                             'type' => '8428'
                                                           },
                                                    '2' => {
                                                             'type' => '12102'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12129' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '8428'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12160' => {
                                       'BaseType' => '5755',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12166' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4899'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           },
                                                    '2' => {
                                                             'type' => '12160'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12192' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4899'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12223' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5219'
                                                           },
                                                    '1' => {
                                                             'type' => '8745'
                                                           },
                                                    '2' => {
                                                             'type' => '9095'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12254' => {
                                       'BaseType' => '8662',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12260' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5101'
                                                           },
                                                    '1' => {
                                                             'type' => '8662'
                                                           },
                                                    '2' => {
                                                             'type' => '12254'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12291' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5101'
                                                           },
                                                    '1' => {
                                                             'type' => '8745'
                                                           },
                                                    '2' => {
                                                             'type' => '9095'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12297' => {
                                       'Header' => undef,
                                       'Line' => '2006',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '267'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '16',
                                                            'type' => '9969'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '24',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '32',
                                                            'type' => '2028'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '2011'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '44',
                                                            'type' => '2011'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '48',
                                                            'type' => '6322'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '12562' => {
                                       'Name' => 'void*(*)(struct ibv_pd*, void*, size_t, size_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6322'
                                                           },
                                                    '1' => {
                                                             'type' => '267'
                                                           },
                                                    '2' => {
                                                             'type' => '386'
                                                           },
                                                    '3' => {
                                                             'type' => '386'
                                                           },
                                                    '4' => {
                                                             'type' => '2028'
                                                           }
                                                  },
                                       'Return' => '267',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12594' => {
                                       'Name' => 'void(*)(struct ibv_pd*, void*, void*, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6322'
                                                           },
                                                    '1' => {
                                                             'type' => '267'
                                                           },
                                                    '2' => {
                                                             'type' => '267'
                                                           },
                                                    '3' => {
                                                             'type' => '2028'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '128' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1294147' => {
                                         'Header' => undef,
                                         'Line' => '9',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_1',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MIN',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_2',
                                                              'value' => '1'
                                                            },
                                                     '3' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MAX',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum dr_arg_chunk_size',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1294190' => {
                                         'Header' => undef,
                                         'Line' => '17',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'log_chunk_size',
                                                              'offset' => '0',
                                                              'type' => '1294147'
                                                            },
                                                     '1' => {
                                                              'name' => 'dmn',
                                                              'offset' => '8',
                                                              'type' => '310467'
                                                            },
                                                     '2' => {
                                                              'name' => 'free_list',
                                                              'offset' => '16',
                                                              'type' => '14507'
                                                            },
                                                     '3' => {
                                                              'name' => 'used_list',
                                                              'offset' => '32',
                                                              'type' => '14507'
                                                            },
                                                     '4' => {
                                                              'name' => 'mutex',
                                                              'offset' => '48',
                                                              'type' => '1261736'
                                                            }
                                                   },
                                         'Name' => 'struct dr_arg_pool',
                                         'Size' => '88',
                                         'Type' => 'Struct'
                                       },
                          '1294269' => {
                                         'BaseType' => '1294285',
                                         'Name' => 'struct dr_arg_pool*[2]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1294285' => {
                                         'BaseType' => '1294190',
                                         'Name' => 'struct dr_arg_pool*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1329596' => {
                                         'Header' => undef,
                                         'Line' => '1682',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'flags',
                                                              'offset' => '0',
                                                              'type' => '2011'
                                                            },
                                                     '1' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '8',
                                                              'type' => '2028'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_context_attr',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '13493' => {
                                       'BaseType' => '2028',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '135' => {
                                     'BaseType' => '128',
                                     'Name' => 'int volatile',
                                     'Size' => '4',
                                     'Type' => 'Volatile'
                                   },
                          '13536' => {
                                       'BaseType' => '11061',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13662' => {
                                       'BaseType' => '2687',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1368046' => {
                                         'BaseType' => '1329596',
                                         'Name' => 'struct mlx5dv_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '13715' => {
                                       'BaseType' => '10884',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13721' => {
                                       'BaseType' => '11118',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '140' => {
                                     'BaseType' => '59',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '14092' => {
                                       'BaseType' => '6739',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14156' => {
                                       'BaseType' => '12297',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1421' => {
                                      'Header' => undef,
                                      'Line' => '49',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '128'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '305'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '80',
                                                            'type' => '305'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '88',
                                                            'type' => '305'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '96',
                                                            'type' => '1837'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '104',
                                                            'type' => '1843'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '112',
                                                            'type' => '128'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '116',
                                                            'type' => '128'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '120',
                                                            'type' => '207'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '128',
                                                            'type' => '52'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '130',
                                                            'type' => '90'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '131',
                                                            'type' => '1849'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '16',
                                                           'type' => '305'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '136',
                                                            'type' => '1865'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '144',
                                                            'type' => '219'
                                                          },
                                                  '22' => {
                                                            'name' => '_codecvt',
                                                            'offset' => '152',
                                                            'type' => '1876'
                                                          },
                                                  '23' => {
                                                            'name' => '_wide_data',
                                                            'offset' => '160',
                                                            'type' => '1887'
                                                          },
                                                  '24' => {
                                                            'name' => '_freeres_list',
                                                            'offset' => '168',
                                                            'type' => '1843'
                                                          },
                                                  '25' => {
                                                            'name' => '_freeres_buf',
                                                            'offset' => '176',
                                                            'type' => '267'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '184',
                                                            'type' => '386'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '192',
                                                            'type' => '128'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '196',
                                                            'type' => '1893'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '24',
                                                           'type' => '305'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '32',
                                                           'type' => '305'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '40',
                                                           'type' => '305'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '48',
                                                           'type' => '305'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '56',
                                                           'type' => '305'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '64',
                                                           'type' => '305'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '72',
                                                           'type' => '305'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '1429565' => {
                                         'Header' => undef,
                                         'Line' => '1693',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pci_name',
                                                              'offset' => '0',
                                                              'type' => '375'
                                                            },
                                                     '1' => {
                                                              'name' => 'flags',
                                                              'offset' => '8',
                                                              'type' => '2011'
                                                            },
                                                     '2' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '16',
                                                              'type' => '2028'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_vfio_context_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '14332' => {
                                       'BaseType' => '7351',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14364' => {
                                       'BaseType' => '2011',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14461' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '14501'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '14501'
                                                          }
                                                 },
                                       'Name' => 'struct list_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14501' => {
                                       'BaseType' => '14461',
                                       'Name' => 'struct list_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14507' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'n',
                                                            'offset' => '0',
                                                            'type' => '14461'
                                                          }
                                                 },
                                       'Name' => 'struct list_head',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1467982' => {
                                         'BaseType' => '11342',
                                         'Name' => 'struct ibv_device**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1467988' => {
                                         'BaseType' => '1429565',
                                         'Name' => 'struct mlx5dv_vfio_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '14752' => {
                                       'Name' => 'atomic_int',
                                       'Size' => '4',
                                       'Type' => 'Intrinsic'
                                     },
                          '152' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '15413' => {
                                       'Header' => undef,
                                       'Line' => '42',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_RX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_TX',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_FDB',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_RX',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TX',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_table_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15462' => {
                                       'Header' => undef,
                                       'Line' => '50',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TUNNEL_TO_L2',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L2_TUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L3_TUNNEL_TO_L2',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L3_TUNNEL',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_action_packet_reformat_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15505' => {
                                       'Header' => undef,
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2141'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15547'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_cmd_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15547' => {
                                       'BaseType' => '2105',
                                       'Name' => '__u8[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '15562' => {
                                       'Header' => undef,
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_MEMIC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_STEERING_SW_ICM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_SW_ICM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_PATTERN_SW_ICM',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_dm_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15605' => {
                                       'Header' => undef,
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DEVX_CR_EV_CH_FLAGS_OMIT_DATA',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_devx_create_event_channel_flags',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15630' => {
                                       'Header' => undef,
                                       'Line' => '73',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '2141'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15547'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_event_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15672' => {
                                       'Header' => undef,
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '2129'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '4',
                                                            'type' => '2129'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_reg',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15712' => {
                                       'Header' => undef,
                                       'Line' => '101',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '2141'
                                                          },
                                                   '1' => {
                                                            'name' => 'vport',
                                                            'offset' => '8',
                                                            'type' => '2117'
                                                          },
                                                   '2' => {
                                                            'name' => 'vport_vhca_id',
                                                            'offset' => '10',
                                                            'type' => '2117'
                                                          },
                                                   '3' => {
                                                            'name' => 'esw_owner_vhca_id',
                                                            'offset' => '12',
                                                            'type' => '2117'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsvd0',
                                                            'offset' => '14',
                                                            'type' => '2117'
                                                          },
                                                   '5' => {
                                                            'name' => 'vport_steering_icm_rx',
                                                            'offset' => '16',
                                                            'type' => '2141'
                                                          },
                                                   '6' => {
                                                            'name' => 'vport_steering_icm_tx',
                                                            'offset' => '24',
                                                            'type' => '2141'
                                                          },
                                                   '7' => {
                                                            'name' => 'reg_c0',
                                                            'offset' => '32',
                                                            'type' => '15672'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_query_port',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '15834' => {
                                       'Header' => undef,
                                       'Line' => '91',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_num',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_format',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cqe_comp_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15874' => {
                                       'Header' => undef,
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sw_parsing_offloads',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sw_parsing_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '159' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '15914' => {
                                       'Header' => undef,
                                       'Line' => '101',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'min_single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_single_stride_log_num_of_bytes',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'min_single_wqe_log_num_of_strides',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_single_wqe_log_num_of_strides',
                                                            'offset' => '12',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '15993' => {
                                       'Header' => undef,
                                       'Line' => '109',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1987'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1987'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams_caps',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '16033' => {
                                       'Header' => undef,
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_T10DIF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_CRC',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16064' => {
                                       'Header' => undef,
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CRC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CSUM',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_t10dif_bg_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16095' => {
                                       'Header' => undef,
                                       'Line' => '150',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32C',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC64_XP10',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_crc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16132' => {
                                       'Header' => undef,
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_512',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_520',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4048',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4096',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4160',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_block_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16181' => {
                                       'Header' => undef,
                                       'Line' => '178',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'block_size',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_prot',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 't10dif_bg',
                                                            'offset' => '12',
                                                            'type' => '1999'
                                                          },
                                                   '3' => {
                                                            'name' => 'crc_type',
                                                            'offset' => '14',
                                                            'type' => '1999'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_caps',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16247' => {
                                       'Header' => undef,
                                       'Line' => '200',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'failed_selftests',
                                                            'offset' => '0',
                                                            'type' => '1999'
                                                          },
                                                   '1' => {
                                                            'name' => 'crypto_engines',
                                                            'offset' => '2',
                                                            'type' => '1987'
                                                          },
                                                   '2' => {
                                                            'name' => 'wrapped_import_method',
                                                            'offset' => '3',
                                                            'type' => '1987'
                                                          },
                                                   '3' => {
                                                            'name' => 'log_max_num_deks',
                                                            'offset' => '4',
                                                            'type' => '1987'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '16326' => {
                                       'Header' => undef,
                                       'Line' => '216',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '1987'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          },
                                                   '10' => {
                                                             'name' => 'dc_odp_caps',
                                                             'offset' => '84',
                                                             'type' => '2011'
                                                           },
                                                   '11' => {
                                                             'name' => 'hca_core_clock',
                                                             'offset' => '88',
                                                             'type' => '267'
                                                           },
                                                   '12' => {
                                                             'name' => 'num_lag_ports',
                                                             'offset' => '96',
                                                             'type' => '1987'
                                                           },
                                                   '13' => {
                                                             'name' => 'sig_caps',
                                                             'offset' => '104',
                                                             'type' => '16181'
                                                           },
                                                   '14' => {
                                                             'name' => 'dci_streams_caps',
                                                             'offset' => '120',
                                                             'type' => '15993'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_wr_memcpy_length',
                                                             'offset' => '128',
                                                             'type' => '386'
                                                           },
                                                   '16' => {
                                                             'name' => 'crypto_caps',
                                                             'offset' => '136',
                                                             'type' => '16247'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '2028'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_comp_caps',
                                                            'offset' => '24',
                                                            'type' => '15834'
                                                          },
                                                   '4' => {
                                                            'name' => 'sw_parsing_caps',
                                                            'offset' => '32',
                                                            'type' => '15874'
                                                          },
                                                   '5' => {
                                                            'name' => 'striding_rq_caps',
                                                            'offset' => '40',
                                                            'type' => '15914'
                                                          },
                                                   '6' => {
                                                            'name' => 'tunnel_offloads_caps',
                                                            'offset' => '60',
                                                            'type' => '2011'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_dynamic_bfregs',
                                                            'offset' => '64',
                                                            'type' => '2011'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_clock_info_update_nsec',
                                                            'offset' => '72',
                                                            'type' => '2028'
                                                          },
                                                   '9' => {
                                                            'name' => 'flow_action_flags',
                                                            'offset' => '80',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_context',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '16561' => {
                                       'Header' => undef,
                                       'Line' => '261',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_comp_res_format',
                                                            'offset' => '8',
                                                            'type' => '1987'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '16',
                                                            'type' => '1999'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16632' => {
                                       'Header' => undef,
                                       'Line' => '288',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pd',
                                                            'offset' => '0',
                                                            'type' => '6322'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_entries',
                                                            'offset' => '12',
                                                            'type' => '1999'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16688' => {
                                       'Header' => undef,
                                       'Line' => '294',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '16731' => {
                                       'Header' => undef,
                                       'Line' => '309',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCT',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCI',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16763' => {
                                       'Header' => undef,
                                       'Line' => '314',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1987'
                                                          },
                                                   '1' => {
                                                            'name' => 'log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1987'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '16806' => {
                                       'Header' => undef,
                                       'Line' => '321',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dct_access_key',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'dci_streams',
                                                            'offset' => '0',
                                                            'type' => '16763'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '16843' => {
                                       'Header' => undef,
                                       'Line' => '319',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dc_type',
                                                            'offset' => '0',
                                                            'type' => '16731'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '16806'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dc_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16878' => {
                                       'Header' => undef,
                                       'Line' => '335',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'dc_init_attr',
                                                            'offset' => '16',
                                                            'type' => '16843'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '32',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_init_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '16949' => {
                                       'Header' => undef,
                                       'Line' => '346',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'bytes_count',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes_skip',
                                                            'offset' => '12',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'lkey',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mr_interleaved',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '17020' => {
                                       'BaseType' => '16949',
                                       'Name' => 'struct mlx5dv_mr_interleaved const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '17025' => {
                                       'Header' => undef,
                                       'Line' => '359',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bg_type',
                                                            'offset' => '0',
                                                            'type' => '16064'
                                                          },
                                                   '1' => {
                                                            'name' => 'bg',
                                                            'offset' => '4',
                                                            'type' => '1999'
                                                          },
                                                   '2' => {
                                                            'name' => 'app_tag',
                                                            'offset' => '6',
                                                            'type' => '1999'
                                                          },
                                                   '3' => {
                                                            'name' => 'ref_tag',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '1999'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_t10dif',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17109' => {
                                       'BaseType' => '17025',
                                       'Name' => 'struct mlx5dv_sig_t10dif const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '17114' => {
                                       'Header' => undef,
                                       'Line' => '367',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '16095'
                                                          },
                                                   '1' => {
                                                            'name' => 'seed',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_crc',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17157' => {
                                       'BaseType' => '17114',
                                       'Name' => 'struct mlx5dv_sig_crc const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '17162' => {
                                       'Header' => undef,
                                       'Line' => '374',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dif',
                                                            'offset' => '0',
                                                            'type' => '17199'
                                                          },
                                                   '1' => {
                                                            'name' => 'crc',
                                                            'offset' => '0',
                                                            'type' => '17205'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '17199' => {
                                       'BaseType' => '17109',
                                       'Name' => 'struct mlx5dv_sig_t10dif const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17205' => {
                                       'BaseType' => '17157',
                                       'Name' => 'struct mlx5dv_sig_crc const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17211' => {
                                       'Header' => undef,
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sig_type',
                                                            'offset' => '0',
                                                            'type' => '16033'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig',
                                                            'offset' => '8',
                                                            'type' => '17162'
                                                          },
                                                   '2' => {
                                                            'name' => 'block_size',
                                                            'offset' => '16',
                                                            'type' => '16132'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_domain',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '17282' => {
                                       'BaseType' => '17211',
                                       'Name' => 'struct mlx5dv_sig_block_domain const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17287' => {
                                       'Header' => undef,
                                       'Line' => '395',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem',
                                                            'offset' => '0',
                                                            'type' => '17391'
                                                          },
                                                   '1' => {
                                                            'name' => 'wire',
                                                            'offset' => '8',
                                                            'type' => '17391'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'check_mask',
                                                            'offset' => '20',
                                                            'type' => '1987'
                                                          },
                                                   '4' => {
                                                            'name' => 'copy_mask',
                                                            'offset' => '21',
                                                            'type' => '1987'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1738371' => {
                                         'Header' => undef,
                                         'Line' => '579',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MLX5DV_MKEY_NO_ERR',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_GUARD',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_REFTAG',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_APPTAG',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum mlx5dv_mkey_err_type',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1738415' => {
                                         'Header' => undef,
                                         'Line' => '586',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'actual_value',
                                                              'offset' => '0',
                                                              'type' => '2028'
                                                            },
                                                     '1' => {
                                                              'name' => 'expected_value',
                                                              'offset' => '8',
                                                              'type' => '2028'
                                                            },
                                                     '2' => {
                                                              'name' => 'offset',
                                                              'offset' => '16',
                                                              'type' => '2028'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_sig_err',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1738472' => {
                                         'Header' => undef,
                                         'Line' => '594',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'sig',
                                                              'offset' => '0',
                                                              'type' => '1738415'
                                                            }
                                                   },
                                         'Size' => '24',
                                         'Type' => 'Union'
                                       },
                          '1738496' => {
                                         'Header' => undef,
                                         'Line' => '592',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'err_type',
                                                              'offset' => '0',
                                                              'type' => '1738371'
                                                            },
                                                     '1' => {
                                                              'name' => 'err',
                                                              'offset' => '8',
                                                              'type' => '1738472'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_mkey_err',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '17386' => {
                                       'BaseType' => '17287',
                                       'Name' => 'struct mlx5dv_sig_block_attr const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17391' => {
                                       'BaseType' => '17282',
                                       'Name' => 'struct mlx5dv_sig_block_domain const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17397' => {
                                       'Header' => undef,
                                       'Line' => '404',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_STANDARD_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_standard',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17423' => {
                                       'Header' => undef,
                                       'Line' => '408',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_AFTER_CRYPTO_ON_TX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_BEFORE_CRYPTO_ON_TX',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_signature_crypto_order',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17455' => {
                                       'Header' => undef,
                                       'Line' => '413',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crypto_standard',
                                                            'offset' => '0',
                                                            'type' => '17397'
                                                          },
                                                   '1' => {
                                                            'name' => 'encrypt_on_tx',
                                                            'offset' => '4',
                                                            'type' => '2098'
                                                          },
                                                   '2' => {
                                                            'name' => 'signature_crypto_order',
                                                            'offset' => '8',
                                                            'type' => '17423'
                                                          },
                                                   '3' => {
                                                            'name' => 'data_unit_size',
                                                            'offset' => '12',
                                                            'type' => '16132'
                                                          },
                                                   '4' => {
                                                            'name' => 'initial_tweak',
                                                            'offset' => '16',
                                                            'type' => '17587'
                                                          },
                                                   '5' => {
                                                            'name' => 'dek',
                                                            'offset' => '32',
                                                            'type' => '17632'
                                                          },
                                                   '6' => {
                                                            'name' => 'keytag',
                                                            'offset' => '40',
                                                            'type' => '983'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '17582' => {
                                       'BaseType' => '17455',
                                       'Name' => 'struct mlx5dv_crypto_attr const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '17587' => {
                                       'BaseType' => '316',
                                       'Name' => 'char[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '17603' => {
                                       'Header' => undef,
                                       'Line' => '905',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19411'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '17632' => {
                                       'BaseType' => '17603',
                                       'Name' => 'struct mlx5dv_dek*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17638' => {
                                       'Header' => undef,
                                       'Line' => '428',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conf_flags',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_conf_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17681' => {
                                       'Header' => undef,
                                       'Line' => '439',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'wr_set_dc_addr',
                                                            'offset' => '8',
                                                            'type' => '17910'
                                                          },
                                                   '10' => {
                                                             'name' => 'wr_set_dc_addr_stream',
                                                             'offset' => '80',
                                                             'type' => '18213'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_memcpy',
                                                             'offset' => '88',
                                                             'type' => '18255'
                                                           },
                                                   '12' => {
                                                             'name' => 'wr_set_mkey_crypto',
                                                             'offset' => '96',
                                                             'type' => '18283'
                                                           },
                                                   '2' => {
                                                            'name' => 'wr_mr_interleaved',
                                                            'offset' => '16',
                                                            'type' => '17964'
                                                          },
                                                   '3' => {
                                                            'name' => 'wr_mr_list',
                                                            'offset' => '24',
                                                            'type' => '18001'
                                                          },
                                                   '4' => {
                                                            'name' => 'wr_mkey_configure',
                                                            'offset' => '32',
                                                            'type' => '18039'
                                                          },
                                                   '5' => {
                                                            'name' => 'wr_set_mkey_access_flags',
                                                            'offset' => '40',
                                                            'type' => '18061'
                                                          },
                                                   '6' => {
                                                            'name' => 'wr_set_mkey_layout_list',
                                                            'offset' => '48',
                                                            'type' => '18088'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr_set_mkey_layout_interleaved',
                                                            'offset' => '56',
                                                            'type' => '18126'
                                                          },
                                                   '8' => {
                                                            'name' => 'wr_set_mkey_sig_block',
                                                            'offset' => '64',
                                                            'type' => '18154'
                                                          },
                                                   '9' => {
                                                            'name' => 'wr_raw_wqe',
                                                            'offset' => '72',
                                                            'type' => '18176'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_ex',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '17904' => {
                                       'BaseType' => '17681',
                                       'Name' => 'struct mlx5dv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17910' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '8272'
                                                           },
                                                    '2' => {
                                                             'type' => '2011'
                                                           },
                                                    '3' => {
                                                             'type' => '2028'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1791829' => {
                                         'BaseType' => '1738496',
                                         'Name' => 'struct mlx5dv_mkey_err*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '17952' => {
                                       'BaseType' => '16688',
                                       'Name' => 'struct mlx5dv_mkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17958' => {
                                       'BaseType' => '16949',
                                       'Name' => 'struct mlx5dv_mr_interleaved*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17964' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint32_t, uint16_t, struct mlx5dv_mr_interleaved*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '17952'
                                                           },
                                                    '2' => {
                                                             'type' => '2011'
                                                           },
                                                    '3' => {
                                                             'type' => '2011'
                                                           },
                                                    '4' => {
                                                             'type' => '1999'
                                                           },
                                                    '5' => {
                                                             'type' => '17958'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18001' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint16_t, struct ibv_sge*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '17952'
                                                           },
                                                    '2' => {
                                                             'type' => '2011'
                                                           },
                                                    '3' => {
                                                             'type' => '1999'
                                                           },
                                                    '4' => {
                                                             'type' => '8668'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18033' => {
                                       'BaseType' => '17638',
                                       'Name' => 'struct mlx5dv_mkey_conf_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18039' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint8_t, struct mlx5dv_mkey_conf_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '17952'
                                                           },
                                                    '2' => {
                                                             'type' => '1987'
                                                           },
                                                    '3' => {
                                                             'type' => '18033'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18061' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '2011'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18088' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint16_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '1999'
                                                           },
                                                    '2' => {
                                                             'type' => '9880'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1812' => {
                                      'BaseType' => '1421',
                                      'Header' => undef,
                                      'Line' => '7',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '18120' => {
                                       'BaseType' => '17020',
                                       'Name' => 'struct mlx5dv_mr_interleaved const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18126' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint16_t, struct mlx5dv_mr_interleaved const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '2011'
                                                           },
                                                    '2' => {
                                                             'type' => '1999'
                                                           },
                                                    '3' => {
                                                             'type' => '18120'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18148' => {
                                       'BaseType' => '17386',
                                       'Name' => 'struct mlx5dv_sig_block_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18154' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_sig_block_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '18148'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18176' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '1980'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18213' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t, uint16_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '8272'
                                                           },
                                                    '2' => {
                                                             'type' => '2011'
                                                           },
                                                    '3' => {
                                                             'type' => '2028'
                                                           },
                                                    '4' => {
                                                             'type' => '1999'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1824' => {
                                      'BaseType' => '1',
                                      'Header' => undef,
                                      'Line' => '43',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '18255' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint64_t, uint32_t, uint64_t, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '2011'
                                                           },
                                                    '2' => {
                                                             'type' => '2028'
                                                           },
                                                    '3' => {
                                                             'type' => '2011'
                                                           },
                                                    '4' => {
                                                             'type' => '2028'
                                                           },
                                                    '5' => {
                                                             'type' => '386'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18277' => {
                                       'BaseType' => '17582',
                                       'Name' => 'struct mlx5dv_crypto_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18283' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_crypto_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17904'
                                                           },
                                                    '1' => {
                                                             'type' => '18277'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18289' => {
                                       'Header' => undef,
                                       'Line' => '618',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '955'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '56',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1832' => {
                                      'Name' => 'struct _IO_marker',
                                      'Type' => 'Struct'
                                    },
                          '18360' => {
                                       'Header' => undef,
                                       'Line' => '625',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '1980'
                                                          },
                                                   '3' => {
                                                            'name' => 'credential_len',
                                                            'offset' => '16',
                                                            'type' => '386'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1837' => {
                                      'BaseType' => '1832',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1843' => {
                                      'BaseType' => '1421',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18445' => {
                                       'Header' => undef,
                                       'Line' => '632',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_VALID',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_NO_LOGIN',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_INVALID',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_login_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18483' => {
                                       'Header' => undef,
                                       'Line' => '638',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18445'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_query_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1849' => {
                                      'BaseType' => '316',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '18526' => {
                                       'Header' => undef,
                                       'Line' => '660',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_128',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_256',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18558' => {
                                       'Header' => undef,
                                       'Line' => '665',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_PURPOSE_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_purpose',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18584' => {
                                       'Header' => undef,
                                       'Line' => '669',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DEK_STATE_READY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DEK_STATE_ERROR',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dek_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18616' => {
                                       'Header' => undef,
                                       'Line' => '678',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key_size',
                                                            'offset' => '0',
                                                            'type' => '18526'
                                                          },
                                                   '1' => {
                                                            'name' => 'has_keytag',
                                                            'offset' => '4',
                                                            'type' => '2098'
                                                          },
                                                   '2' => {
                                                            'name' => 'key_purpose',
                                                            'offset' => '8',
                                                            'type' => '18558'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd',
                                                            'offset' => '16',
                                                            'type' => '6322'
                                                          },
                                                   '4' => {
                                                            'name' => 'opaque',
                                                            'offset' => '24',
                                                            'type' => '983'
                                                          },
                                                   '5' => {
                                                            'name' => 'key',
                                                            'offset' => '32',
                                                            'type' => '18742'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '160',
                                                            'type' => '2028'
                                                          },
                                                   '7' => {
                                                            'name' => 'crypto_login',
                                                            'offset' => '168',
                                                            'type' => '18787'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_init_attr',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '1865' => {
                                      'BaseType' => '1824',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1871' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'Type' => 'Struct'
                                    },
                          '18742' => {
                                       'BaseType' => '316',
                                       'Name' => 'char[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '18758' => {
                                       'Header' => undef,
                                       'Line' => '901',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19411'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_obj',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1876' => {
                                      'BaseType' => '1871',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18787' => {
                                       'BaseType' => '18758',
                                       'Name' => 'struct mlx5dv_crypto_login_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18793' => {
                                       'Header' => undef,
                                       'Line' => '689',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18584'
                                                          },
                                                   '1' => {
                                                            'name' => 'opaque',
                                                            'offset' => '4',
                                                            'type' => '983'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1882' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'Type' => 'Struct'
                                    },
                          '18850' => {
                                       'Header' => undef,
                                       'Line' => '708',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'action_flags',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_esp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1887' => {
                                      'BaseType' => '1882',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18893' => {
                                       'Header' => undef,
                                       'Line' => '713',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'match_sz',
                                                            'offset' => '0',
                                                            'type' => '386'
                                                          },
                                                   '1' => {
                                                            'name' => 'match_buf',
                                                            'offset' => '8',
                                                            'type' => '18936'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_match_parameters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1893' => {
                                      'BaseType' => '316',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '18936' => {
                                       'BaseType' => '2028',
                                       'Name' => 'uint64_t[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '18951' => {
                                       'Header' => undef,
                                       'Line' => '722',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '10824'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'priority',
                                                            'offset' => '8',
                                                            'type' => '1999'
                                                          },
                                                   '3' => {
                                                            'name' => 'match_criteria_enable',
                                                            'offset' => '10',
                                                            'type' => '1987'
                                                          },
                                                   '4' => {
                                                            'name' => 'match_mask',
                                                            'offset' => '16',
                                                            'type' => '19064'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          },
                                                   '6' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '32',
                                                            'type' => '15413'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_matcher_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '19064' => {
                                       'BaseType' => '18893',
                                       'Name' => 'struct mlx5dv_flow_match_parameters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19070' => {
                                       'Header' => undef,
                                       'Line' => '740',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '0',
                                                            'type' => '15413'
                                                          },
                                                   '1' => {
                                                            'name' => 'priority',
                                                            'offset' => '4',
                                                            'type' => '1999'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19127' => {
                                       'Header' => undef,
                                       'Line' => '746',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'id',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '19155' => {
                                       'Header' => undef,
                                       'Line' => '755',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_IBV_QP',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DROP',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_COUNTER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_FLOW_ACTION',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_TAG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_DEVX',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEFAULT_MISS',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_flow_action_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1921' => {
                                      'BaseType' => '207',
                                      'Header' => undef,
                                      'Line' => '63',
                                      'Name' => 'off_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19223' => {
                                       'Header' => undef,
                                       'Line' => '768',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '5101'
                                                          },
                                                   '1' => {
                                                            'name' => 'counter',
                                                            'offset' => '0',
                                                            'type' => '10942'
                                                          },
                                                   '2' => {
                                                            'name' => 'action',
                                                            'offset' => '0',
                                                            'type' => '13715'
                                                          },
                                                   '3' => {
                                                            'name' => 'tag_value',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'obj',
                                                            'offset' => '0',
                                                            'type' => '19411'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '19298' => {
                                       'Header' => undef,
                                       'Line' => '780',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2938'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '12',
                                                            'type' => '28291'
                                                          },
                                                   '3' => {
                                                            'name' => 'object_id',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'rx_icm_addr',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          },
                                                   '5' => {
                                                            'name' => 'log_obj_range',
                                                            'offset' => '32',
                                                            'type' => '1987'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv',
                                                            'offset' => '40',
                                                            'type' => '267'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_obj',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1933' => {
                                      'BaseType' => '269',
                                      'Header' => undef,
                                      'Line' => '77',
                                      'Name' => 'ssize_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19411' => {
                                       'BaseType' => '19298',
                                       'Name' => 'struct mlx5dv_devx_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19417' => {
                                       'Header' => undef,
                                       'Line' => '766',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '19155'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '19223'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1945' => {
                                      'BaseType' => '1812',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19452' => {
                                       'Header' => undef,
                                       'Line' => '837',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '12',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19505' => {
                                       'Header' => undef,
                                       'Line' => '842',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '12',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19558' => {
                                       'Header' => undef,
                                       'Line' => '847',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19597' => {
                                       'Header' => undef,
                                       'Line' => '835',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '0',
                                                            'type' => '19763'
                                                          },
                                                   '1' => {
                                                            'name' => 'sq',
                                                            'offset' => '8',
                                                            'type' => '19452'
                                                          },
                                                   '10' => {
                                                             'name' => 'tir_icm_addr',
                                                             'offset' => '88',
                                                             'type' => '2028'
                                                           },
                                                   '2' => {
                                                            'name' => 'rq',
                                                            'offset' => '24',
                                                            'type' => '19505'
                                                          },
                                                   '3' => {
                                                            'name' => 'bf',
                                                            'offset' => '40',
                                                            'type' => '19558'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '56',
                                                            'type' => '2028'
                                                          },
                                                   '5' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '64',
                                                            'type' => '1921'
                                                          },
                                                   '6' => {
                                                            'name' => 'tirn',
                                                            'offset' => '72',
                                                            'type' => '2011'
                                                          },
                                                   '7' => {
                                                            'name' => 'tisn',
                                                            'offset' => '76',
                                                            'type' => '2011'
                                                          },
                                                   '8' => {
                                                            'name' => 'rqn',
                                                            'offset' => '80',
                                                            'type' => '2011'
                                                          },
                                                   '9' => {
                                                            'name' => 'sqn',
                                                            'offset' => '84',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp',
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '19763' => {
                                       'BaseType' => '2165',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19769' => {
                                       'Header' => undef,
                                       'Line' => '860',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19763'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '20',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '24',
                                                            'type' => '267'
                                                          },
                                                   '5' => {
                                                            'name' => 'cqn',
                                                            'offset' => '32',
                                                            'type' => '2011'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1980' => {
                                      'BaseType' => '1986',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1986' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1987' => {
                                      'BaseType' => '97',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '19882' => {
                                       'Header' => undef,
                                       'Line' => '874',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19763'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'head',
                                                            'offset' => '20',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'tail',
                                                            'offset' => '24',
                                                            'type' => '2011'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '2028'
                                                          },
                                                   '6' => {
                                                            'name' => 'srqn',
                                                            'offset' => '40',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1999' => {
                                      'BaseType' => '116',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '19995' => {
                                       'Header' => undef,
                                       'Line' => '884',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19763'
                                                          },
                                                   '2' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'stride',
                                                            'offset' => '20',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_rwq',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '20080' => {
                                       'Header' => undef,
                                       'Line' => '892',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '15562'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_alloc_dm_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '2011' => {
                                      'BaseType' => '140',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '20123' => {
                                       'Header' => undef,
                                       'Line' => '901',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '2028'
                                                          },
                                                   '3' => {
                                                            'name' => 'remote_va',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dm',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '20194' => {
                                       'Header' => undef,
                                       'Line' => '916',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'av',
                                                            'offset' => '0',
                                                            'type' => '20405'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_ah',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20236' => {
                                       'Header' => undef,
                                       'Line' => '1261',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '21141'
                                                          },
                                                   '1' => {
                                                            'name' => 'dqp_dct',
                                                            'offset' => '8',
                                                            'type' => '2165'
                                                          },
                                                   '10' => {
                                                             'name' => 'rgid',
                                                             'offset' => '32',
                                                             'type' => '2512'
                                                           },
                                                   '2' => {
                                                            'name' => 'stat_rate_sl',
                                                            'offset' => '12',
                                                            'type' => '1987'
                                                          },
                                                   '3' => {
                                                            'name' => 'fl_mlid',
                                                            'offset' => '13',
                                                            'type' => '1987'
                                                          },
                                                   '4' => {
                                                            'name' => 'rlid',
                                                            'offset' => '14',
                                                            'type' => '2153'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved0',
                                                            'offset' => '16',
                                                            'type' => '20986'
                                                          },
                                                   '6' => {
                                                            'name' => 'rmac',
                                                            'offset' => '20',
                                                            'type' => '10868'
                                                          },
                                                   '7' => {
                                                            'name' => 'tclass',
                                                            'offset' => '26',
                                                            'type' => '1987'
                                                          },
                                                   '8' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '27',
                                                            'type' => '1987'
                                                          },
                                                   '9' => {
                                                            'name' => 'grh_gid_fl',
                                                            'offset' => '28',
                                                            'type' => '2165'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_wqe_av',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '2028' => {
                                      'BaseType' => '159',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20405' => {
                                       'BaseType' => '20236',
                                       'Name' => 'struct mlx5_wqe_av*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20411' => {
                                       'Header' => undef,
                                       'Line' => '921',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdn',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20454' => {
                                       'Header' => undef,
                                       'Line' => '927',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5101'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20492'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20492' => {
                                       'BaseType' => '19597',
                                       'Name' => 'struct mlx5dv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20498' => {
                                       'Header' => undef,
                                       'Line' => '931',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4899'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20536'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20536' => {
                                       'BaseType' => '19769',
                                       'Name' => 'struct mlx5dv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20542' => {
                                       'Header' => undef,
                                       'Line' => '935',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5219'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20580'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20580' => {
                                       'BaseType' => '19882',
                                       'Name' => 'struct mlx5dv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20586' => {
                                       'Header' => undef,
                                       'Line' => '939',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5420'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20624'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20624' => {
                                       'BaseType' => '19995',
                                       'Name' => 'struct mlx5dv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20630' => {
                                       'Header' => undef,
                                       'Line' => '943',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '2974'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20668'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20668' => {
                                       'BaseType' => '20123',
                                       'Name' => 'struct mlx5dv_dm*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20674' => {
                                       'Header' => undef,
                                       'Line' => '947',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '8272'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20712'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '207' => {
                                     'BaseType' => '152',
                                     'Header' => undef,
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '20712' => {
                                       'BaseType' => '20194',
                                       'Name' => 'struct mlx5dv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20718' => {
                                       'Header' => undef,
                                       'Line' => '951',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6322'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20756'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20756' => {
                                       'BaseType' => '20411',
                                       'Name' => 'struct mlx5dv_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20762' => {
                                       'Header' => undef,
                                       'Line' => '926',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '20454'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '16',
                                                            'type' => '20498'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '32',
                                                            'type' => '20542'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '48',
                                                            'type' => '20586'
                                                          },
                                                   '4' => {
                                                            'name' => 'dm',
                                                            'offset' => '64',
                                                            'type' => '20630'
                                                          },
                                                   '5' => {
                                                            'name' => 'ah',
                                                            'offset' => '80',
                                                            'type' => '20674'
                                                          },
                                                   '6' => {
                                                            'name' => 'pd',
                                                            'offset' => '96',
                                                            'type' => '20718'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_obj',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '20870' => {
                                       'Header' => undef,
                                       'Line' => '971',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'single_wqe_log_num_of_strides',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'two_byte_shift_en',
                                                            'offset' => '8',
                                                            'type' => '1987'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_init_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '20927' => {
                                       'Header' => undef,
                                       'Line' => '977',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'striding_rq_attrs',
                                                            'offset' => '8',
                                                            'type' => '20870'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_wq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2098' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '20986' => {
                                       'BaseType' => '1987',
                                       'Name' => 'uint8_t[4]',
                                       'Size' => '4',
                                       'Type' => 'Array'
                                     },
                          '2105' => {
                                      'BaseType' => '45',
                                      'Header' => undef,
                                      'Line' => '21',
                                      'Name' => '__u8',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '21102' => {
                                       'Header' => undef,
                                       'Line' => '1263',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qkey',
                                                            'offset' => '0',
                                                            'type' => '2165'
                                                          },
                                                   '1' => {
                                                            'name' => 'reserved',
                                                            'offset' => '4',
                                                            'type' => '2165'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21141' => {
                                       'Header' => undef,
                                       'Line' => '1262',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qkey',
                                                            'offset' => '0',
                                                            'type' => '21102'
                                                          },
                                                   '1' => {
                                                            'name' => 'dc_key',
                                                            'offset' => '0',
                                                            'type' => '2177'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '2117' => {
                                      'BaseType' => '52',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => '__u16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '21178' => {
                                       'Header' => undef,
                                       'Line' => '1592',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '2129' => {
                                      'BaseType' => '59',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '21309' => {
                                       'Header' => undef,
                                       'Line' => '1616',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nsec',
                                                            'offset' => '0',
                                                            'type' => '2028'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_cycles',
                                                            'offset' => '8',
                                                            'type' => '2028'
                                                          },
                                                   '2' => {
                                                            'name' => 'frac',
                                                            'offset' => '16',
                                                            'type' => '2028'
                                                          },
                                                   '3' => {
                                                            'name' => 'mult',
                                                            'offset' => '24',
                                                            'type' => '2011'
                                                          },
                                                   '4' => {
                                                            'name' => 'shift',
                                                            'offset' => '28',
                                                            'type' => '2011'
                                                          },
                                                   '5' => {
                                                            'name' => 'mask',
                                                            'offset' => '32',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_clock_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '21408' => {
                                       'Header' => undef,
                                       'Line' => '1738',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'umem_id',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_umem',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '2141' => {
                                      'BaseType' => '405',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '21437' => {
                                       'Header' => undef,
                                       'Line' => '1745',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '386'
                                                          },
                                                   '2' => {
                                                            'name' => 'access',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'pgsz_bitmap',
                                                            'offset' => '24',
                                                            'type' => '2028'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_umem_in',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '21522' => {
                                       'Header' => undef,
                                       'Line' => '1758',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg_addr',
                                                            'offset' => '0',
                                                            'type' => '267'
                                                          },
                                                   '1' => {
                                                            'name' => 'base_addr',
                                                            'offset' => '8',
                                                            'type' => '267'
                                                          },
                                                   '2' => {
                                                            'name' => 'page_id',
                                                            'offset' => '16',
                                                            'type' => '2011'
                                                          },
                                                   '3' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '24',
                                                            'type' => '1921'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_uar',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '2153' => {
                                      'BaseType' => '2117',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => '__be16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '21607' => {
                                       'Header' => undef,
                                       'Line' => '1771',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'page_id',
                                                            'offset' => '0',
                                                            'type' => '2011'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '2011'
                                                          },
                                                   '2' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '8',
                                                            'type' => '1921'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '16',
                                                            'type' => '2028'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_var',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2165' => {
                                      'BaseType' => '2129',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '21678' => {
                                       'Header' => undef,
                                       'Line' => '1808',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '128'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_cmd_comp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21706' => {
                                       'Header' => undef,
                                       'Line' => '1824',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '128'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_event_channel',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21734' => {
                                       'Header' => undef,
                                       'Line' => '2118',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'index',
                                                            'offset' => '0',
                                                            'type' => '1999'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_pp',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '21763' => {
                                       'Header' => undef,
                                       'Line' => '2144',
