$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.3.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx5.so.1.24.53.0',
          'LibraryVersion' => 'mlx5',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '1172030' => {
                                           'Header' => undef,
                                           'Line' => '5675',
                                           'Param' => {
                                                        '0' => {
                                                                 'name' => 'context',
                                                                 'type' => '2944'
                                                               },
                                                        '1' => {
                                                                 'name' => 'addr',
                                                                 'type' => '308'
                                                               },
                                                        '2' => {

                                                     'mlx5dv_dump_dr_matcher@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_rule@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_table@@MLX5_1.12' => 1,
                                                     'mlx5dv_free_var@@MLX5_1.12' => 1,
                                                     'mlx5dv_get_clock_info@@MLX5_1.4' => 1,
                                                     'mlx5dv_get_vfio_device_list@@MLX5_1.21' => 1,
                                                     'mlx5dv_init_obj@@MLX5_1.2' => 1,
                                                     'mlx5dv_init_obj@MLX5_1.0' => 1,
                                                     'mlx5dv_is_supported@@MLX5_1.8' => 1,
                                                     'mlx5dv_map_ah_to_qp@@MLX5_1.20' => 1,
                                                     'mlx5dv_modify_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_modify_qp_sched_elem@@MLX5_1.17' => 1,
                                                     'mlx5dv_modify_qp_udp_sport@@MLX5_1.17' => 1,
                                                     'mlx5dv_open_device@@MLX5_1.7' => 1,
                                                     'mlx5dv_pp_alloc@@MLX5_1.13' => 1,
                                                     'mlx5dv_pp_free@@MLX5_1.13' => 1,
                                                     'mlx5dv_qp_cancel_posted_send_wrs@@MLX5_1.20' => 1,
                                                     'mlx5dv_qp_ex_from_ibv_qp_ex@@MLX5_1.10' => 1,
                                                     'mlx5dv_query_device@@MLX5_1.0' => 1,
                                                     'mlx5dv_query_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_reserved_qpn_alloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_reserved_qpn_dealloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_sched_leaf_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_set_context_attr@@MLX5_1.2' => 1,
                                                     'mlx5dv_vfio_get_events_fd@@MLX5_1.21' => 1,
                                                     'mlx5dv_vfio_process_events@@MLX5_1.21' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10025' => {
                                       'Header' => undef,
                                       'Line' => '1525',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tag',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_wc_tm_info',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10067' => {
                                       'Header' => undef,
                                       'Line' => '1530',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          },
                                                   '1' => {
                                                            'name' => 'channel',
                                                            'offset' => '8',
                                                            'type' => '9992'
                                                          },
                                                   '10' => {
                                                             'name' => 'status',
                                                             'offset' => '306',
                                                             'type' => '5421'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_id',
                                                             'offset' => '310',
                                                             'type' => '2023'
                                                           },
                                                   '12' => {
                                                             'name' => 'start_poll',
                                                             'offset' => '324',
                                                             'type' => '10536'
                                                           },
                                                   '13' => {
                                                             'name' => 'next_poll',
                                                             'offset' => '338',
                                                             'type' => '10556'
                                                           },
                                                   '14' => {
                                                             'name' => 'end_poll',
                                                             'offset' => '352',
                                                             'type' => '10572'
                                                           },
                                                   '15' => {
                                                             'name' => 'read_opcode',
                                                             'offset' => '360',
                                                             'type' => '10592'
                                                           },
                                                   '16' => {
                                                             'name' => 'read_vendor_err',
                                                             'offset' => '374',
                                                             'type' => '10612'
                                                           },
                                                   '17' => {
                                                             'name' => 'read_byte_len',
                                                             'offset' => '388',
                                                             'type' => '10612'
                                                           },
                                                   '18' => {
                                                             'name' => 'read_imm_data',
                                                             'offset' => '402',
                                                             'type' => '10632'
                                                           },
                                                   '19' => {
                                                             'name' => 'read_qp_num',
                                                             'offset' => '512',
                                                             'type' => '10612'
                                                           },
                                                   '2' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '22',
                                                            'type' => '308'
                                                          },
                                                   '20' => {
                                                             'name' => 'read_src_qp',
                                                             'offset' => '520',
                                                             'type' => '10612'
                                                           },
                                                   '21' => {
                                                             'name' => 'read_wc_flags',
                                                             'offset' => '534',
                                                             'type' => '10652'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_slid',
                                                             'offset' => '548',
                                                             'type' => '10612'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_sl',
                                                             'offset' => '562',
                                                             'type' => '10672'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_dlid_path_bits',
                                                             'offset' => '576',
                                                             'type' => '10672'
                                                           },
                                                   '25' => {
                                                             'name' => 'read_completion_ts',
                                                             'offset' => '584',
                                                             'type' => '10692'
                                                           },
                                                   '26' => {
                                                             'name' => 'read_cvlan',
                                                             'offset' => '598',
                                                             'type' => '10712'
                                                           },
                                                   '27' => {
                                                             'name' => 'read_flow_tag',
                                                             'offset' => '612',
                                                             'type' => '10612'
                                                           },
                                                   '28' => {
                                                             'name' => 'read_tm_info',
                                                             'offset' => '626',
                                                             'type' => '10738'
                                                           },
                                                   '29' => {
                                                             'name' => 'read_completion_wallclock_ns',
                                                             'offset' => '640',
                                                             'type' => '10692'
                                                           },
                                                   '3' => {
                                                            'name' => 'handle',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'cqe',
                                                            'offset' => '40',
                                                            'type' => '159'
                                                          },
                                                   '5' => {
                                                            'name' => 'mutex',
                                                            'offset' => '50',
                                                            'type' => '893'
                                                          },
                                                   '6' => {
                                                            'name' => 'cond',
                                                            'offset' => '114',
                                                            'type' => '966'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_events_completed',
                                                            'offset' => '288',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'async_events_completed',
                                                            'offset' => '292',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '296',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_ex',
                                       'Size' => '288',
                                       'Type' => 'Struct'
                                     },
                          '10526' => {
                                       'BaseType' => '10067',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10531' => {
                                       'BaseType' => '9997',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10536' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           },
                                                    '1' => {
                                                             'type' => '10531'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10556' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10572' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10592' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '5582',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10612' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '2001',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10632' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '2203',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10652' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10672' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '1977',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10692' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '2023',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10712' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           }
                                                  },
                                       'Return' => '1989',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10733' => {
                                       'BaseType' => '10025',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10738' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10526'
                                                           },
                                                    '1' => {
                                                             'type' => '10733'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10827' => {
                                       'Header' => undef,
                                       'Line' => '1707',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10868' => {
                                       'BaseType' => '1977',
                                       'Name' => 'uint8_t[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '10884' => {
                                       'Header' => undef,
                                       'Line' => '1940',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10912' => {
                                       'Header' => undef,
                                       'Line' => '2105',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10940' => {
                                       'BaseType' => '10912',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11057' => {
                                       'Header' => undef,
                                       'Line' => '1934',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2944'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '111' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11113' => {
                                       'Header' => undef,
                                       'Line' => '1948',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '11267'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '2243'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '22',
                                                            'type' => '308'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '36',
                                                            'type' => '2267'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '40',
                                                            'type' => '1989'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '50',
                                                            'type' => '308'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '64',
                                                            'type' => '2406'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '82',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '11267' => {
                                       'BaseType' => '2411',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11272' => {
                                       'Header' => undef,
                                       'Line' => '1969',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '11453'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '11469'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11334' => {
                                       'BaseType' => '11339',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11339' => {
                                       'Header' => undef,
                                       'Line' => '1979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '11272'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '2540'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '2605'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '3558'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '3558'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '11474'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '11474'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '11453' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11334'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '2944',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11469' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11474' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '11490' => {
                                       'Header' => undef,
                                       'Line' => '1994',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '11978'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '12018'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '12028'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '12143'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '12168'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '12028'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '12028'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '12028'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '12028'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '12028'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '12028'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '12028'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '12028'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '12198'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '12028'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '12028'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '12028'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '12028'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '12233'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '12263'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '12028'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '12028'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '12028'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '12028'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '12028'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '12028'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '12028'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '12028'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '12028'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '12053'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '12088'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '12108'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '11973' => {
                                       'BaseType' => '3024',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11978' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           },
                                                    '1' => {
                                                             'type' => '11973'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12008' => {
                                       'BaseType' => '12013',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12013' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '12018' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           },
                                                    '1' => {
                                                             'type' => '1977'
                                                           },
                                                    '2' => {
                                                             'type' => '12008'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12028' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '308',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12053' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6313'
                                                           },
                                                    '1' => {
                                                             'type' => '6318'
                                                           }
                                                  },
                                       'Return' => '8385',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12083' => {
                                       'BaseType' => '8958',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12088' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5101'
                                                           },
                                                    '1' => {
                                                             'type' => '8385'
                                                           },
                                                    '2' => {
                                                             'type' => '12083'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12108' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '8385'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12138' => {
                                       'BaseType' => '5755',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12143' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4901'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           },
                                                    '2' => {
                                                             'type' => '12138'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12168' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4901'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12198' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5217'
                                                           },
                                                    '1' => {
                                                             'type' => '8696'
                                                           },
                                                    '2' => {
                                                             'type' => '9039'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12228' => {
                                       'BaseType' => '8616',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12233' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5101'
                                                           },
                                                    '1' => {
                                                             'type' => '8616'
                                                           },
                                                    '2' => {
                                                             'type' => '12228'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12263' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5101'
                                                           },
                                                    '1' => {
                                                             'type' => '8696'
                                                           },
                                                    '2' => {
                                                             'type' => '9039'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12268' => {
                                       'Header' => undef,
                                       'Line' => '2057',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '308'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '22',
                                                            'type' => '9992'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2001'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '68',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '72',
                                                            'type' => '6313'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '123' => {
                                     'BaseType' => '46',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '12530' => {
                                       'Name' => 'void*(*)(struct ibv_pd*, void*, size_t, size_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6313'
                                                           },
                                                    '1' => {
                                                             'type' => '308'
                                                           },
                                                    '2' => {
                                                             'type' => '419'
                                                           },
                                                    '3' => {
                                                             'type' => '419'
                                                           },
                                                    '4' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '308',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12561' => {
                                       'Name' => 'void(*)(struct ibv_pd*, void*, void*, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6313'
                                                           },
                                                    '1' => {
                                                             'type' => '308'
                                                           },
                                                    '2' => {
                                                             'type' => '308'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1279237' => {
                                         'Header' => undef,
                                         'Line' => '9',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_1',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MIN',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_2',
                                                              'value' => '1'
                                                            },
                                                     '3' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_3',
                                                              'value' => '2'
                                                            },
                                                     '4' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_4',
                                                              'value' => '3'
                                                            },
                                                     '5' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MAX',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum dr_arg_chunk_size',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1279291' => {
                                         'Header' => undef,
                                         'Line' => '19',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'log_chunk_size',
                                                              'offset' => '0',
                                                              'type' => '1279237'
                                                            },
                                                     '1' => {
                                                              'name' => 'dmn',
                                                              'offset' => '8',
                                                              'type' => '298007'
                                                            },
                                                     '2' => {
                                                              'name' => 'free_list',
                                                              'offset' => '22',
                                                              'type' => '14403'
                                                            },
                                                     '3' => {
                                                              'name' => 'mutex',
                                                              'offset' => '50',
                                                              'type' => '1247229'
                                                            }
                                                   },
                                         'Name' => 'struct dr_arg_pool',
                                         'Size' => '72',
                                         'Type' => 'Struct'
                                       },
                          '1279357' => {
                                         'BaseType' => '1279373',
                                         'Name' => 'struct dr_arg_pool*[4]',
                                         'Size' => '32',
                                         'Type' => 'Array'
                                       },
                          '1279373' => {
                                         'BaseType' => '1279291',
                                         'Name' => 'struct dr_arg_pool*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1314212' => {
                                         'Header' => undef,
                                         'Line' => '1690',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'flags',
                                                              'offset' => '0',
                                                              'type' => '2001'
                                                            },
                                                     '1' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '8',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_context_attr',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '13448' => {
                                       'BaseType' => '2023',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13488' => {
                                       'BaseType' => '11057',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1352337' => {
                                         'BaseType' => '1314212',
                                         'Name' => 'struct mlx5dv_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '13608' => {
                                       'BaseType' => '2694',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13658' => {
                                       'BaseType' => '10884',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13663' => {
                                       'BaseType' => '11113',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14013' => {
                                       'BaseType' => '6715',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14073' => {
                                       'BaseType' => '12268',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1408' => {
                                      'Header' => undef,
                                      'Line' => '49',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '159'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '346'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '128',
                                                            'type' => '346'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '136',
                                                            'type' => '346'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '150',
                                                            'type' => '1824'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '260',
                                                            'type' => '1829'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '274',
                                                            'type' => '159'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '278',
                                                            'type' => '159'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '288',
                                                            'type' => '248'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '296',
                                                            'type' => '58'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '304',
                                                            'type' => '111'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '305',
                                                            'type' => '1834'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '22',
                                                           'type' => '346'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '310',
                                                            'type' => '1850'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '324',
                                                            'type' => '260'
                                                          },
                                                  '22' => {
                                                            'name' => '_codecvt',
                                                            'offset' => '338',
                                                            'type' => '1860'
                                                          },
                                                  '23' => {
                                                            'name' => '_wide_data',
                                                            'offset' => '352',
                                                            'type' => '1870'
                                                          },
                                                  '24' => {
                                                            'name' => '_freeres_list',
                                                            'offset' => '360',
                                                            'type' => '1829'
                                                          },
                                                  '25' => {
                                                            'name' => '_freeres_buf',
                                                            'offset' => '374',
                                                            'type' => '308'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '388',
                                                            'type' => '419'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '402',
                                                            'type' => '159'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '406',
                                                            'type' => '1875'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '36',
                                                           'type' => '346'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '50',
                                                           'type' => '346'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '64',
                                                           'type' => '346'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '72',
                                                           'type' => '346'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '86',
                                                           'type' => '346'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '100',
                                                           'type' => '346'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '114',
                                                           'type' => '346'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '1412053' => {
                                         'Header' => undef,
                                         'Line' => '1701',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pci_name',
                                                              'offset' => '0',
                                                              'type' => '1967'
                                                            },
                                                     '1' => {
                                                              'name' => 'flags',
                                                              'offset' => '8',
                                                              'type' => '2001'
                                                            },
                                                     '2' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '22',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_vfio_context_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '14238' => {
                                       'BaseType' => '7313',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14268' => {
                                       'BaseType' => '2001',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14358' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '14398'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '14398'
                                                          }
                                                 },
                                       'Name' => 'struct list_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '14398' => {
                                       'BaseType' => '14358',
                                       'Name' => 'struct list_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14403' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'n',
                                                            'offset' => '0',
                                                            'type' => '14358'
                                                          }
                                                 },
                                       'Name' => 'struct list_head',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1450071' => {
                                         'BaseType' => '11334',
                                         'Name' => 'struct ibv_device**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1450076' => {
                                         'BaseType' => '1412053',
                                         'Name' => 'struct mlx5dv_vfio_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '147' => {
                                     'BaseType' => '58',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '14957' => {
                                       'Header' => undef,
                                       'Line' => '42',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_RX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_TX',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_FDB',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_RX',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TX',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_table_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15005' => {
                                       'Header' => undef,
                                       'Line' => '50',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TUNNEL_TO_L2',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L2_TUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L3_TUNNEL_TO_L2',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L3_TUNNEL',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_action_packet_reformat_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15047' => {
                                       'Header' => undef,
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15085'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_cmd_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15085' => {
                                       'BaseType' => '2143',
                                       'Name' => '__u8[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '15100' => {
                                       'Header' => undef,
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_MEMIC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_STEERING_SW_ICM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_SW_ICM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_PATTERN_SW_ICM',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_ENCAP_SW_ICM',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_dm_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15148' => {
                                       'Header' => undef,
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DEVX_CR_EV_CH_FLAGS_OMIT_DATA',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_devx_create_event_channel_flags',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15172' => {
                                       'Header' => undef,
                                       'Line' => '74',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15085'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_event_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15210' => {
                                       'Header' => undef,
                                       'Line' => '97',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '2167'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '4',
                                                            'type' => '2167'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_reg',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15250' => {
                                       'Header' => undef,
                                       'Line' => '102',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'vport',
                                                            'offset' => '8',
                                                            'type' => '2155'
                                                          },
                                                   '2' => {
                                                            'name' => 'vport_vhca_id',
                                                            'offset' => '16',
                                                            'type' => '2155'
                                                          },
                                                   '3' => {
                                                            'name' => 'esw_owner_vhca_id',
                                                            'offset' => '18',
                                                            'type' => '2155'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsvd0',
                                                            'offset' => '20',
                                                            'type' => '2155'
                                                          },
                                                   '5' => {
                                                            'name' => 'vport_steering_icm_rx',
                                                            'offset' => '22',
                                                            'type' => '2179'
                                                          },
                                                   '6' => {
                                                            'name' => 'vport_steering_icm_tx',
                                                            'offset' => '36',
                                                            'type' => '2179'
                                                          },
                                                   '7' => {
                                                            'name' => 'reg_c0',
                                                            'offset' => '50',
                                                            'type' => '15210'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_query_port',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '15684' => {
                                       'Header' => undef,
                                       'Line' => '93',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_num',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_format',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cqe_comp_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15724' => {
                                       'Header' => undef,
                                       'Line' => '98',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sw_parsing_offloads',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sw_parsing_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15764' => {
                                       'Header' => undef,
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'min_single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_single_stride_log_num_of_bytes',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'min_single_wqe_log_num_of_strides',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_single_wqe_log_num_of_strides',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '15843' => {
                                       'Header' => undef,
                                       'Line' => '111',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams_caps',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '15883' => {
                                       'Header' => undef,
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_T10DIF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_CRC',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '159' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '15913' => {
                                       'Header' => undef,
                                       'Line' => '142',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CRC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CSUM',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_t10dif_bg_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15943' => {
                                       'Header' => undef,
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32C',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC64_XP10',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_crc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15979' => {
                                       'Header' => undef,
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_512',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_520',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4048',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4096',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4160',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_block_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16027' => {
                                       'Header' => undef,
                                       'Line' => '180',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'block_size',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_prot',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 't10dif_bg',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'crc_type',
                                                            'offset' => '20',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_caps',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16093' => {
                                       'Header' => undef,
                                       'Line' => '203',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'failed_selftests',
                                                            'offset' => '0',
                                                            'type' => '1989'
                                                          },
                                                   '1' => {
                                                            'name' => 'crypto_engines',
                                                            'offset' => '2',
                                                            'type' => '1977'
                                                          },
                                                   '2' => {
                                                            'name' => 'wrapped_import_method',
                                                            'offset' => '3',
                                                            'type' => '1977'
                                                          },
                                                   '3' => {
                                                            'name' => 'log_max_num_deks',
                                                            'offset' => '4',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '16172' => {
                                       'Header' => undef,
                                       'Line' => '219',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '10' => {
                                                             'name' => 'dc_odp_caps',
                                                             'offset' => '132',
                                                             'type' => '2001'
                                                           },
                                                   '11' => {
                                                             'name' => 'hca_core_clock',
                                                             'offset' => '136',
                                                             'type' => '308'
                                                           },
                                                   '12' => {
                                                             'name' => 'num_lag_ports',
                                                             'offset' => '150',
                                                             'type' => '1977'
                                                           },
                                                   '13' => {
                                                             'name' => 'sig_caps',
                                                             'offset' => '260',
                                                             'type' => '16027'
                                                           },
                                                   '14' => {
                                                             'name' => 'dci_streams_caps',
                                                             'offset' => '288',
                                                             'type' => '15843'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_wr_memcpy_length',
                                                             'offset' => '296',
                                                             'type' => '419'
                                                           },
                                                   '16' => {
                                                             'name' => 'crypto_caps',
                                                             'offset' => '310',
                                                             'type' => '16093'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_dc_rd_atom',
                                                             'offset' => '338',
                                                             'type' => '2023'
                                                           },
                                                   '18' => {
                                                             'name' => 'max_dc_init_rd_atom',
                                                             'offset' => '352',
                                                             'type' => '2023'
                                                           },
                                                   '19' => {
                                                             'name' => 'reg_c0',
                                                             'offset' => '360',
                                                             'type' => '15210'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_comp_caps',
                                                            'offset' => '36',
                                                            'type' => '15684'
                                                          },
                                                   '4' => {
                                                            'name' => 'sw_parsing_caps',
                                                            'offset' => '50',
                                                            'type' => '15724'
                                                          },
                                                   '5' => {
                                                            'name' => 'striding_rq_caps',
                                                            'offset' => '64',
                                                            'type' => '15764'
                                                          },
                                                   '6' => {
                                                            'name' => 'tunnel_offloads_caps',
                                                            'offset' => '96',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_dynamic_bfregs',
                                                            'offset' => '100',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_clock_info_update_nsec',
                                                            'offset' => '114',
                                                            'type' => '2023'
                                                          },
                                                   '9' => {
                                                            'name' => 'flow_action_flags',
                                                            'offset' => '128',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_context',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '16446' => {
                                       'Header' => undef,
                                       'Line' => '267',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_comp_res_format',
                                                            'offset' => '8',
                                                            'type' => '1977'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '22',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16516' => {
                                       'Header' => undef,
                                       'Line' => '296',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pd',
                                                            'offset' => '0',
                                                            'type' => '6313'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_entries',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16571' => {
                                       'Header' => undef,
                                       'Line' => '302',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '166' => {
                                     'BaseType' => '159',
                                     'Name' => 'int volatile',
                                     'Size' => '4',
                                     'Type' => 'Volatile'
                                   },
                          '16613' => {
                                       'Header' => undef,
                                       'Line' => '317',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCT',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCI',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16642' => {
                                       'Header' => undef,
                                       'Line' => '322',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '16684' => {
                                       'Header' => undef,
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dct_access_key',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'dci_streams',
                                                            'offset' => '0',
                                                            'type' => '16642'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '16720' => {
                                       'Header' => undef,
                                       'Line' => '327',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dc_type',
                                                            'offset' => '0',
                                                            'type' => '16613'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '16684'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dc_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16754' => {
                                       'Header' => undef,
                                       'Line' => '343',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'dc_init_attr',
                                                            'offset' => '22',
                                                            'type' => '16720'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_init_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '16824' => {
                                       'Header' => undef,
                                       'Line' => '354',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'bytes_count',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes_skip',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'lkey',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mr_interleaved',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16894' => {
                                       'BaseType' => '16824',
                                       'Name' => 'struct mlx5dv_mr_interleaved const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '16899' => {
                                       'Header' => undef,
                                       'Line' => '367',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bg_type',
                                                            'offset' => '0',
                                                            'type' => '15913'
                                                          },
                                                   '1' => {
                                                            'name' => 'bg',
                                                            'offset' => '4',
                                                            'type' => '1989'
                                                          },
                                                   '2' => {
                                                            'name' => 'app_tag',
                                                            'offset' => '6',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'ref_tag',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_t10dif',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16982' => {
                                       'BaseType' => '16899',
                                       'Name' => 'struct mlx5dv_sig_t10dif const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '16987' => {
                                       'Header' => undef,
                                       'Line' => '375',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '15943'
                                                          },
                                                   '1' => {
                                                            'name' => 'seed',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_crc',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17029' => {
                                       'BaseType' => '16987',
                                       'Name' => 'struct mlx5dv_sig_crc const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '17034' => {
                                       'Header' => undef,
                                       'Line' => '382',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dif',
                                                            'offset' => '0',
                                                            'type' => '17070'
                                                          },
                                                   '1' => {
                                                            'name' => 'crc',
                                                            'offset' => '0',
                                                            'type' => '17075'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '17070' => {
                                       'BaseType' => '16982',
                                       'Name' => 'struct mlx5dv_sig_t10dif const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17075' => {
                                       'BaseType' => '17029',
                                       'Name' => 'struct mlx5dv_sig_crc const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17080' => {
                                       'Header' => undef,
                                       'Line' => '380',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sig_type',
                                                            'offset' => '0',
                                                            'type' => '15883'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig',
                                                            'offset' => '8',
                                                            'type' => '17034'
                                                          },
                                                   '2' => {
                                                            'name' => 'block_size',
                                                            'offset' => '22',
                                                            'type' => '15979'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_domain',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '17150' => {
                                       'BaseType' => '17080',
                                       'Name' => 'struct mlx5dv_sig_block_domain const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17155' => {
                                       'Header' => undef,
                                       'Line' => '403',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem',
                                                            'offset' => '0',
                                                            'type' => '17258'
                                                          },
                                                   '1' => {
                                                            'name' => 'wire',
                                                            'offset' => '8',
                                                            'type' => '17258'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'check_mask',
                                                            'offset' => '32',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'copy_mask',
                                                            'offset' => '33',
                                                            'type' => '1977'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1716895' => {
                                         'Header' => undef,
                                         'Line' => '587',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MLX5DV_MKEY_NO_ERR',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_GUARD',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_REFTAG',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_APPTAG',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum mlx5dv_mkey_err_type',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1716937' => {
                                         'Header' => undef,
                                         'Line' => '594',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'actual_value',
                                                              'offset' => '0',
                                                              'type' => '2023'
                                                            },
                                                     '1' => {
                                                              'name' => 'expected_value',
                                                              'offset' => '8',
                                                              'type' => '2023'
                                                            },
                                                     '2' => {
                                                              'name' => 'offset',
                                                              'offset' => '22',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_sig_err',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1716993' => {
                                         'Header' => undef,
                                         'Line' => '602',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'sig',
                                                              'offset' => '0',
                                                              'type' => '1716937'
                                                            }
                                                   },
                                         'Size' => '24',
                                         'Type' => 'Union'
                                       },
                          '1717016' => {
                                         'Header' => undef,
                                         'Line' => '600',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'err_type',
                                                              'offset' => '0',
                                                              'type' => '1716895'
                                                            },
                                                     '1' => {
                                                              'name' => 'err',
                                                              'offset' => '8',
                                                              'type' => '1716993'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_mkey_err',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '17253' => {
                                       'BaseType' => '17155',
                                       'Name' => 'struct mlx5dv_sig_block_attr const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17258' => {
                                       'BaseType' => '17150',
                                       'Name' => 'struct mlx5dv_sig_block_domain const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17263' => {
                                       'Header' => undef,
                                       'Line' => '412',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_STANDARD_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_standard',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17286' => {
                                       'Header' => undef,
                                       'Line' => '416',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_AFTER_CRYPTO_ON_TX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_BEFORE_CRYPTO_ON_TX',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_signature_crypto_order',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17315' => {
                                       'Header' => undef,
                                       'Line' => '421',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crypto_standard',
                                                            'offset' => '0',
                                                            'type' => '17263'
                                                          },
                                                   '1' => {
                                                            'name' => 'encrypt_on_tx',
                                                            'offset' => '4',
                                                            'type' => '2091'
                                                          },
                                                   '2' => {
                                                            'name' => 'signature_crypto_order',
                                                            'offset' => '8',
                                                            'type' => '17286'
                                                          },
                                                   '3' => {
                                                            'name' => 'data_unit_size',
                                                            'offset' => '18',
                                                            'type' => '15979'
                                                          },
                                                   '4' => {
                                                            'name' => 'initial_tweak',
                                                            'offset' => '22',
                                                            'type' => '17446'
                                                          },
                                                   '5' => {
                                                            'name' => 'dek',
                                                            'offset' => '50',
                                                            'type' => '17490'
                                                          },
                                                   '6' => {
                                                            'name' => 'keytag',
                                                            'offset' => '64',
                                                            'type' => '978'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '17441' => {
                                       'BaseType' => '17315',
                                       'Name' => 'struct mlx5dv_crypto_attr const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '17446' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '17462' => {
                                       'Header' => undef,
                                       'Line' => '916',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19217'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '17490' => {
                                       'BaseType' => '17462',
                                       'Name' => 'struct mlx5dv_dek*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17495' => {
                                       'Header' => undef,
                                       'Line' => '436',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conf_flags',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_conf_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17537' => {
                                       'Header' => undef,
                                       'Line' => '447',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'wr_set_dc_addr',
                                                            'offset' => '8',
                                                            'type' => '17764'
                                                          },
                                                   '10' => {
                                                             'name' => 'wr_set_dc_addr_stream',
                                                             'offset' => '128',
                                                             'type' => '18053'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_memcpy',
                                                             'offset' => '136',
                                                             'type' => '18094'
                                                           },
                                                   '12' => {
                                                             'name' => 'wr_set_mkey_crypto',
                                                             'offset' => '150',
                                                             'type' => '18120'
                                                           },
                                                   '2' => {
                                                            'name' => 'wr_mr_interleaved',
                                                            'offset' => '22',
                                                            'type' => '17815'
                                                          },
                                                   '3' => {
                                                            'name' => 'wr_mr_list',
                                                            'offset' => '36',
                                                            'type' => '17851'
                                                          },
                                                   '4' => {
                                                            'name' => 'wr_mkey_configure',
                                                            'offset' => '50',
                                                            'type' => '17887'
                                                          },
                                                   '5' => {
                                                            'name' => 'wr_set_mkey_access_flags',
                                                            'offset' => '64',
                                                            'type' => '17908'
                                                          },
                                                   '6' => {
                                                            'name' => 'wr_set_mkey_layout_list',
                                                            'offset' => '72',
                                                            'type' => '17934'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr_set_mkey_layout_interleaved',
                                                            'offset' => '86',
                                                            'type' => '17970'
                                                          },
                                                   '8' => {
                                                            'name' => 'wr_set_mkey_sig_block',
                                                            'offset' => '100',
                                                            'type' => '17996'
                                                          },
                                                   '9' => {
                                                            'name' => 'wr_raw_wqe',
                                                            'offset' => '114',
                                                            'type' => '18017'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_ex',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '176' => {
                                     'BaseType' => '70',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1769839' => {
                                         'BaseType' => '1717016',
                                         'Name' => 'struct mlx5dv_mkey_err*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '17759' => {
                                       'BaseType' => '17537',
                                       'Name' => 'struct mlx5dv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17764' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '8232'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17805' => {
                                       'BaseType' => '16571',
                                       'Name' => 'struct mlx5dv_mkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17810' => {
                                       'BaseType' => '16824',
                                       'Name' => 'struct mlx5dv_mr_interleaved*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17815' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint32_t, uint16_t, struct mlx5dv_mr_interleaved*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '17805'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2001'
                                                           },
                                                    '4' => {
                                                             'type' => '1989'
                                                           },
                                                    '5' => {
                                                             'type' => '17810'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17851' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint16_t, struct ibv_sge*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '17805'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '1989'
                                                           },
                                                    '4' => {
                                                             'type' => '8621'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17882' => {
                                       'BaseType' => '17495',
                                       'Name' => 'struct mlx5dv_mkey_conf_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17887' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint8_t, struct mlx5dv_mkey_conf_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '17805'
                                                           },
                                                    '2' => {
                                                             'type' => '1977'
                                                           },
                                                    '3' => {
                                                             'type' => '17882'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17908' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17934' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint16_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '1989'
                                                           },
                                                    '2' => {
                                                             'type' => '9835'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17965' => {
                                       'BaseType' => '16894',
                                       'Name' => 'struct mlx5dv_mr_interleaved const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17970' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint16_t, struct mlx5dv_mr_interleaved const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '1989'
                                                           },
                                                    '3' => {
                                                             'type' => '17965'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1799' => {
                                      'BaseType' => '1408',
                                      'Header' => undef,
                                      'Line' => '7',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '17991' => {
                                       'BaseType' => '17253',
                                       'Name' => 'struct mlx5dv_sig_block_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17996' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_sig_block_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '17991'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18017' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '1961'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18053' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t, uint16_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '8232'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           },
                                                    '4' => {
                                                             'type' => '1989'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18094' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint64_t, uint32_t, uint64_t, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '2023'
                                                           },
                                                    '3' => {
                                                             'type' => '2001'
                                                           },
                                                    '4' => {
                                                             'type' => '2023'
                                                           },
                                                    '5' => {
                                                             'type' => '419'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1811' => {
                                      'BaseType' => '1',
                                      'Header' => undef,
                                      'Line' => '43',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '18115' => {
                                       'BaseType' => '17441',
                                       'Name' => 'struct mlx5dv_crypto_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18120' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_crypto_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17759'
                                                           },
                                                    '1' => {
                                                             'type' => '18115'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18125' => {
                                       'Header' => undef,
                                       'Line' => '626',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '950'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '86',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1819' => {
                                      'Name' => 'struct _IO_marker',
                                      'Type' => 'Struct'
                                    },
                          '18195' => {
                                       'Header' => undef,
                                       'Line' => '633',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '1961'
                                                          },
                                                   '3' => {
                                                            'name' => 'credential_len',
                                                            'offset' => '22',
                                                            'type' => '419'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1824' => {
                                      'BaseType' => '1819',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18279' => {
                                       'Header' => undef,
                                       'Line' => '640',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_VALID',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_NO_LOGIN',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_INVALID',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_login_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1829' => {
                                      'BaseType' => '1408',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18314' => {
                                       'Header' => undef,
                                       'Line' => '646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18279'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_query_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1834' => {
                                      'BaseType' => '356',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '18356' => {
                                       'Header' => undef,
                                       'Line' => '668',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_128',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_256',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18385' => {
                                       'Header' => undef,
                                       'Line' => '673',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_PURPOSE_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_purpose',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18408' => {
                                       'Header' => undef,
                                       'Line' => '677',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DEK_STATE_READY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DEK_STATE_ERROR',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dek_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18437' => {
                                       'Header' => undef,
                                       'Line' => '686',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key_size',
                                                            'offset' => '0',
                                                            'type' => '18356'
                                                          },
                                                   '1' => {
                                                            'name' => 'has_keytag',
                                                            'offset' => '4',
                                                            'type' => '2091'
                                                          },
                                                   '2' => {
                                                            'name' => 'key_purpose',
                                                            'offset' => '8',
                                                            'type' => '18385'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd',
                                                            'offset' => '22',
                                                            'type' => '6313'
                                                          },
                                                   '4' => {
                                                            'name' => 'opaque',
                                                            'offset' => '36',
                                                            'type' => '978'
                                                          },
                                                   '5' => {
                                                            'name' => 'key',
                                                            'offset' => '50',
                                                            'type' => '18562'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '352',
                                                            'type' => '2023'
                                                          },
                                                   '7' => {
                                                            'name' => 'crypto_login',
                                                            'offset' => '360',
                                                            'type' => '18606'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_init_attr',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '1850' => {
                                      'BaseType' => '1811',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1855' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'Type' => 'Struct'
                                    },
                          '18562' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '18578' => {
                                       'Header' => undef,
                                       'Line' => '912',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19217'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_obj',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1860' => {
                                      'BaseType' => '1855',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18606' => {
                                       'BaseType' => '18578',
                                       'Name' => 'struct mlx5dv_crypto_login_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18611' => {
                                       'Header' => undef,
                                       'Line' => '697',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18408'
                                                          },
                                                   '1' => {
                                                            'name' => 'opaque',
                                                            'offset' => '4',
                                                            'type' => '978'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1865' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'Type' => 'Struct'
                                    },
                          '18667' => {
                                       'Header' => undef,
                                       'Line' => '716',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'action_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_esp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1870' => {
                                      'BaseType' => '1865',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18709' => {
                                       'Header' => undef,
                                       'Line' => '721',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'match_sz',
                                                            'offset' => '0',
                                                            'type' => '419'
                                                          },
                                                   '1' => {
                                                            'name' => 'match_buf',
                                                            'offset' => '8',
                                                            'type' => '18751'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_match_parameters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1875' => {
                                      'BaseType' => '356',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '18751' => {
                                       'BaseType' => '2023',
                                       'Name' => 'uint64_t[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '18766' => {
                                       'Header' => undef,
                                       'Line' => '730',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '10827'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'priority',
                                                            'offset' => '8',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'match_criteria_enable',
                                                            'offset' => '16',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'match_mask',
                                                            'offset' => '22',
                                                            'type' => '18878'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '6' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '50',
                                                            'type' => '14957'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_matcher_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '188' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '18878' => {
                                       'BaseType' => '18709',
                                       'Name' => 'struct mlx5dv_flow_match_parameters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18883' => {
                                       'Header' => undef,
                                       'Line' => '748',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '0',
                                                            'type' => '14957'
                                                          },
                                                   '1' => {
                                                            'name' => 'priority',
                                                            'offset' => '4',
                                                            'type' => '1989'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '18939' => {
                                       'Header' => undef,
                                       'Line' => '754',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '18966' => {
                                       'Header' => undef,
                                       'Line' => '763',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_IBV_QP',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DROP',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_COUNTER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_FLOW_ACTION',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_TAG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_DEVX',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEFAULT_MISS',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_flow_action_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1903' => {
                                      'BaseType' => '248',
                                      'Header' => undef,
                                      'Line' => '63',
                                      'Name' => 'off_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19031' => {
                                       'Header' => undef,
                                       'Line' => '776',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '5101'
                                                          },
                                                   '1' => {
                                                            'name' => 'counter',
                                                            'offset' => '0',
                                                            'type' => '10940'
                                                          },
                                                   '2' => {
                                                            'name' => 'action',
                                                            'offset' => '0',
                                                            'type' => '13658'
                                                          },
                                                   '3' => {
                                                            'name' => 'tag_value',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'obj',
                                                            'offset' => '0',
                                                            'type' => '19217'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '19105' => {
                                       'Header' => undef,
                                       'Line' => '791',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '18',
                                                            'type' => '27946'
                                                          },
                                                   '3' => {
                                                            'name' => 'object_id',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'rx_icm_addr',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'log_obj_range',
                                                            'offset' => '50',
                                                            'type' => '1977'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv',
                                                            'offset' => '64',
                                                            'type' => '308'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_obj',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1915' => {
                                      'BaseType' => '310',
                                      'Header' => undef,
                                      'Line' => '77',
                                      'Name' => 'ssize_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19217' => {
                                       'BaseType' => '19105',
                                       'Name' => 'struct mlx5dv_devx_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19222' => {
                                       'Header' => undef,
                                       'Line' => '774',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '18966'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '19031'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19256' => {
                                       'Header' => undef,
                                       'Line' => '845',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1927' => {
                                      'BaseType' => '1799',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19309' => {
                                       'Header' => undef,
                                       'Line' => '850',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19362' => {
                                       'Header' => undef,
                                       'Line' => '855',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19401' => {
                                       'Header' => undef,
                                       'Line' => '843',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '0',
                                                            'type' => '19566'
                                                          },
                                                   '1' => {
                                                            'name' => 'sq',
                                                            'offset' => '8',
                                                            'type' => '19256'
                                                          },
                                                   '10' => {
                                                             'name' => 'tir_icm_addr',
                                                             'offset' => '136',
                                                             'type' => '2023'
                                                           },
                                                   '2' => {
                                                            'name' => 'rq',
                                                            'offset' => '36',
                                                            'type' => '19309'
                                                          },
                                                   '3' => {
                                                            'name' => 'bf',
                                                            'offset' => '64',
                                                            'type' => '19362'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '86',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '100',
                                                            'type' => '1903'
                                                          },
                                                   '6' => {
                                                            'name' => 'tirn',
                                                            'offset' => '114',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'tisn',
                                                            'offset' => '118',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'rqn',
                                                            'offset' => '128',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'sqn',
                                                            'offset' => '132',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp',
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '19566' => {
                                       'BaseType' => '2203',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19571' => {
                                       'Header' => undef,
                                       'Line' => '868',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19566'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '36',
                                                            'type' => '308'
                                                          },
                                                   '5' => {
                                                            'name' => 'cqn',
                                                            'offset' => '50',
                                                            'type' => '2001'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1961' => {
                                      'BaseType' => '1966',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1966' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1967' => {
                                      'BaseType' => '363',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19683' => {
                                       'Header' => undef,
                                       'Line' => '882',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19566'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'head',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'tail',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '6' => {
                                                            'name' => 'srqn',
                                                            'offset' => '64',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1977' => {
                                      'BaseType' => '123',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '19795' => {
                                       'Header' => undef,
                                       'Line' => '892',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19566'
                                                          },
                                                   '2' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'stride',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_rwq',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '19879' => {
                                       'Header' => undef,
                                       'Line' => '900',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '15100'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_alloc_dm_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1989' => {
                                      'BaseType' => '147',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '19921' => {
                                       'Header' => undef,
                                       'Line' => '909',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'remote_va',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dm',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '19991' => {
                                       'Header' => undef,
                                       'Line' => '924',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'av',
                                                            'offset' => '0',
                                                            'type' => '20200'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_ah',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '200' => {
                                     'BaseType' => '82',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2001' => {
                                      'BaseType' => '176',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '20032' => {
                                       'Header' => undef,
                                       'Line' => '1269',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '20923'
                                                          },
                                                   '1' => {
                                                            'name' => 'dqp_dct',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '10' => {
                                                             'name' => 'rgid',
                                                             'offset' => '50',
                                                             'type' => '2524'
                                                           },
                                                   '2' => {
                                                            'name' => 'stat_rate_sl',
                                                            'offset' => '18',
                                                            'type' => '1977'
                                                          },
                                                   '3' => {
                                                            'name' => 'fl_mlid',
                                                            'offset' => '19',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'rlid',
                                                            'offset' => '20',
                                                            'type' => '2191'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved0',
                                                            'offset' => '22',
                                                            'type' => '20769'
                                                          },
                                                   '6' => {
                                                            'name' => 'rmac',
                                                            'offset' => '32',
                                                            'type' => '10868'
                                                          },
                                                   '7' => {
                                                            'name' => 'tclass',
                                                            'offset' => '38',
                                                            'type' => '1977'
                                                          },
                                                   '8' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '39',
                                                            'type' => '1977'
                                                          },
                                                   '9' => {
                                                            'name' => 'grh_gid_fl',
                                                            'offset' => '40',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_wqe_av',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '20200' => {
                                       'BaseType' => '20032',
                                       'Name' => 'struct mlx5_wqe_av*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20205' => {
                                       'Header' => undef,
                                       'Line' => '929',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdn',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '2023' => {
                                      'BaseType' => '200',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20247' => {
                                       'Header' => undef,
                                       'Line' => '935',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5101'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20285'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20285' => {
                                       'BaseType' => '19401',
                                       'Name' => 'struct mlx5dv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20290' => {
                                       'Header' => undef,
                                       'Line' => '939',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4901'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20328'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20328' => {
                                       'BaseType' => '19571',
                                       'Name' => 'struct mlx5dv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20333' => {
                                       'Header' => undef,
                                       'Line' => '943',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5217'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20371'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20371' => {
                                       'BaseType' => '19683',
                                       'Name' => 'struct mlx5dv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20376' => {
                                       'Header' => undef,
                                       'Line' => '947',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5416'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20414'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20414' => {
                                       'BaseType' => '19795',
                                       'Name' => 'struct mlx5dv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20419' => {
                                       'Header' => undef,
                                       'Line' => '951',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '2979'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20457'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20457' => {
                                       'BaseType' => '19921',
                                       'Name' => 'struct mlx5dv_dm*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20462' => {
                                       'Header' => undef,
                                       'Line' => '955',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '8232'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20500'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20500' => {
                                       'BaseType' => '19991',
                                       'Name' => 'struct mlx5dv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20505' => {
                                       'Header' => undef,
                                       'Line' => '959',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6313'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20543'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20543' => {
                                       'BaseType' => '20205',
                                       'Name' => 'struct mlx5dv_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20548' => {
                                       'Header' => undef,
                                       'Line' => '934',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '20247'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '22',
                                                            'type' => '20290'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '50',
                                                            'type' => '20333'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '72',
                                                            'type' => '20376'
                                                          },
                                                   '4' => {
                                                            'name' => 'dm',
                                                            'offset' => '100',
                                                            'type' => '20419'
                                                          },
                                                   '5' => {
                                                            'name' => 'ah',
                                                            'offset' => '128',
                                                            'type' => '20462'
                                                          },
                                                   '6' => {
                                                            'name' => 'pd',
                                                            'offset' => '150',
                                                            'type' => '20505'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_obj',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '20655' => {
                                       'Header' => undef,
                                       'Line' => '979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'single_wqe_log_num_of_strides',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'two_byte_shift_en',
                                                            'offset' => '8',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_init_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '20711' => {
                                       'Header' => undef,
                                       'Line' => '985',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'striding_rq_attrs',
                                                            'offset' => '8',
                                                            'type' => '20655'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_wq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '20769' => {
                                       'BaseType' => '1977',
                                       'Name' => 'uint8_t[4]',
                                       'Size' => '4',
                                       'Type' => 'Array'
                                     },
                          '20884' => {
                                       'Header' => undef,
                                       'Line' => '1271',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qkey',
                                                            'offset' => '0',
                                                            'type' => '2203'
                                                          },
                                                   '1' => {
                                                            'name' => 'reserved',
                                                            'offset' => '4',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '2091' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '20923' => {
                                       'Header' => undef,
                                       'Line' => '1270',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qkey',
                                                            'offset' => '0',
                                                            'type' => '20884'
                                                          },
                                                   '1' => {
                                                            'name' => 'dc_key',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '20959' => {
                                       'Header' => undef,
                                       'Line' => '1600',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '2103' => {
                                      'BaseType' => '171',
                                      'Header' => undef,
                                      'Line' => '46',
                                      'Name' => 'atomic_int',
                                      'Type' => 'Typedef'
                                    },
                          '21084' => {
                                       'Header' => undef,
                                       'Line' => '1624',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nsec',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_cycles',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '2' => {
                                                            'name' => 'frac',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'mult',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'shift',
                                                            'offset' => '40',
                                                            'type' => '2001'
                                                          },
                                                   '5' => {
                                                            'name' => 'mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_clock_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '21182' => {
                                       'Header' => undef,
                                       'Line' => '1746',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'umem_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_umem',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21210' => {
                                       'Header' => undef,
                                       'Line' => '1757',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '419'
                                                          },
                                                   '2' => {
                                                            'name' => 'access',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'pgsz_bitmap',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'dmabuf_fd',
                                                            'offset' => '64',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_umem_in',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '21308' => {
                                       'Header' => undef,
                                       'Line' => '1771',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg_addr',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'base_addr',
                                                            'offset' => '8',
                                                            'type' => '308'
                                                          },
                                                   '2' => {
                                                            'name' => 'page_id',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '36',
                                                            'type' => '1903'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_uar',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '21392' => {
                                       'Header' => undef,
                                       'Line' => '1784',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'page_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '8',
                                                            'type' => '1903'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_var',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '2143' => {
                                      'BaseType' => '46',
                                      'Header' => undef,
                                      'Line' => '21',
                                      'Name' => '__u8',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '21462' => {
                                       'Header' => undef,
                                       'Line' => '1821',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_cmd_comp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21489' => {
                                       'Header' => undef,
                                       'Line' => '1837',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_event_channel',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21516' => {
                                       'Header' => undef,
                                       'Line' => '2131',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'index',
