$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.1.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx5.so.1.24.44.0',
          'LibraryVersion' => 'mlx5',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '1154613' => {
                                           'Header' => undef,
                                           'Line' => '5631',
                                           'Param' => {
                                                        '0' => {
                                                                 'name' => 'context',
                                                                 'type' => '2944'
                                                               },
                                                        '1' => {
                                                                 'name' => 'addr',
                                                                 'type' => '308'
                                                               },
                                                        '2' => {

                                                     'mlx5dv_dump_dr_matcher@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_rule@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_table@@MLX5_1.12' => 1,
                                                     'mlx5dv_free_var@@MLX5_1.12' => 1,
                                                     'mlx5dv_get_clock_info@@MLX5_1.4' => 1,
                                                     'mlx5dv_get_vfio_device_list@@MLX5_1.21' => 1,
                                                     'mlx5dv_init_obj@@MLX5_1.2' => 1,
                                                     'mlx5dv_init_obj@MLX5_1.0' => 1,
                                                     'mlx5dv_is_supported@@MLX5_1.8' => 1,
                                                     'mlx5dv_map_ah_to_qp@@MLX5_1.20' => 1,
                                                     'mlx5dv_modify_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_modify_qp_sched_elem@@MLX5_1.17' => 1,
                                                     'mlx5dv_modify_qp_udp_sport@@MLX5_1.17' => 1,
                                                     'mlx5dv_open_device@@MLX5_1.7' => 1,
                                                     'mlx5dv_pp_alloc@@MLX5_1.13' => 1,
                                                     'mlx5dv_pp_free@@MLX5_1.13' => 1,
                                                     'mlx5dv_qp_cancel_posted_send_wrs@@MLX5_1.20' => 1,
                                                     'mlx5dv_qp_ex_from_ibv_qp_ex@@MLX5_1.10' => 1,
                                                     'mlx5dv_query_device@@MLX5_1.0' => 1,
                                                     'mlx5dv_query_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_reserved_qpn_alloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_reserved_qpn_dealloc@@MLX5_1.18' => 1,
                                                     'mlx5dv_sched_leaf_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_set_context_attr@@MLX5_1.2' => 1,
                                                     'mlx5dv_vfio_get_events_fd@@MLX5_1.21' => 1,
                                                     'mlx5dv_vfio_process_events@@MLX5_1.21' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10444' => {
                                       'BaseType' => '9985',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10449' => {
                                       'BaseType' => '9915',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10454' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           },
                                                    '1' => {
                                                             'type' => '10449'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10474' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10490' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10510' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '5568',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10530' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '2001',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10550' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '2203',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10570' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10590' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '1977',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10610' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '2023',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10630' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           }
                                                  },
                                       'Return' => '1989',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10651' => {
                                       'BaseType' => '9943',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10656' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10444'
                                                           },
                                                    '1' => {
                                                             'type' => '10651'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10745' => {
                                       'Header' => undef,
                                       'Line' => '1669',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10786' => {
                                       'BaseType' => '1977',
                                       'Name' => 'uint8_t[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '10802' => {
                                       'Header' => undef,
                                       'Line' => '1901',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10830' => {
                                       'Header' => undef,
                                       'Line' => '2066',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10858' => {
                                       'BaseType' => '10830',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10975' => {
                                       'Header' => undef,
                                       'Line' => '1895',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2944'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '11031' => {
                                       'Header' => undef,
                                       'Line' => '1909',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '11185'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '2243'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '22',
                                                            'type' => '308'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '36',
                                                            'type' => '2267'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '40',
                                                            'type' => '1989'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '50',
                                                            'type' => '308'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '64',
                                                            'type' => '2406'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '82',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '111' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11185' => {
                                       'BaseType' => '2411',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11190' => {
                                       'Header' => undef,
                                       'Line' => '1930',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '11371'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '11387'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11252' => {
                                       'BaseType' => '11257',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11257' => {
                                       'Header' => undef,
                                       'Line' => '1940',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '11190'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '22',
                                                            'type' => '2540'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '32',
                                                            'type' => '2605'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '36',
                                                            'type' => '3558'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '136',
                                                            'type' => '3558'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '338',
                                                            'type' => '11392'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '1032',
                                                            'type' => '11392'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '11371' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11252'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '2944',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11387' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11392' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '11408' => {
                                       'Header' => undef,
                                       'Line' => '1955',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '11896'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '11936'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '128',
                                                             'type' => '11946'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '136',
                                                             'type' => '12061'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '150',
                                                             'type' => '12086'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '260',
                                                             'type' => '11946'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '274',
                                                             'type' => '11946'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '288',
                                                             'type' => '11946'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '296',
                                                             'type' => '11946'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '310',
                                                             'type' => '11946'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '324',
                                                             'type' => '11946'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '338',
                                                             'type' => '11946'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '22',
                                                            'type' => '11946'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '352',
                                                             'type' => '12116'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '360',
                                                             'type' => '11946'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '374',
                                                             'type' => '11946'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '388',
                                                             'type' => '11946'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '402',
                                                             'type' => '11946'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '512',
                                                             'type' => '12151'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '520',
                                                             'type' => '12181'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '534',
                                                             'type' => '11946'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '548',
                                                             'type' => '11946'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '562',
                                                             'type' => '11946'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '36',
                                                            'type' => '11946'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '576',
                                                             'type' => '11946'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '584',
                                                             'type' => '11946'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '50',
                                                            'type' => '11946'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '64',
                                                            'type' => '11946'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '72',
                                                            'type' => '11946'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '86',
                                                            'type' => '11971'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '100',
                                                            'type' => '12006'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '114',
                                                            'type' => '12026'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '11891' => {
                                       'BaseType' => '3024',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11896' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           },
                                                    '1' => {
                                                             'type' => '11891'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11926' => {
                                       'BaseType' => '11931',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11931' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '11936' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2944'
                                                           },
                                                    '1' => {
                                                             'type' => '1977'
                                                           },
                                                    '2' => {
                                                             'type' => '11926'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11946' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '308',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11971' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6293'
                                                           },
                                                    '1' => {
                                                             'type' => '6298'
                                                           }
                                                  },
                                       'Return' => '8359',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12001' => {
                                       'BaseType' => '8932',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12006' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5087'
                                                           },
                                                    '1' => {
                                                             'type' => '8359'
                                                           },
                                                    '2' => {
                                                             'type' => '12001'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12026' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '8359'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12056' => {
                                       'BaseType' => '5735',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12061' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4887'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           },
                                                    '2' => {
                                                             'type' => '12056'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12086' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4887'
                                                           },
                                                    '1' => {
                                                             'type' => '159'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12116' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5203'
                                                           },
                                                    '1' => {
                                                             'type' => '8670'
                                                           },
                                                    '2' => {
                                                             'type' => '9013'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12146' => {
                                       'BaseType' => '8590',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12151' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5087'
                                                           },
                                                    '1' => {
                                                             'type' => '8590'
                                                           },
                                                    '2' => {
                                                             'type' => '12146'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12181' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5087'
                                                           },
                                                    '1' => {
                                                             'type' => '8670'
                                                           },
                                                    '2' => {
                                                             'type' => '9013'
                                                           }
                                                  },
                                       'Return' => '159',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12186' => {
                                       'Header' => undef,
                                       'Line' => '2018',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '308'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '22',
                                                            'type' => '9910'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2001'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '68',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '72',
                                                            'type' => '6293'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '123' => {
                                     'BaseType' => '46',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '12448' => {
                                       'Name' => 'void*(*)(struct ibv_pd*, void*, size_t, size_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6293'
                                                           },
                                                    '1' => {
                                                             'type' => '308'
                                                           },
                                                    '2' => {
                                                             'type' => '419'
                                                           },
                                                    '3' => {
                                                             'type' => '419'
                                                           },
                                                    '4' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '308',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12479' => {
                                       'Name' => 'void(*)(struct ibv_pd*, void*, void*, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '6293'
                                                           },
                                                    '1' => {
                                                             'type' => '308'
                                                           },
                                                    '2' => {
                                                             'type' => '308'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1260361' => {
                                         'Header' => undef,
                                         'Line' => '9',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_1',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MIN',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_2',
                                                              'value' => '1'
                                                            },
                                                     '3' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_3',
                                                              'value' => '2'
                                                            },
                                                     '4' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_4',
                                                              'value' => '3'
                                                            },
                                                     '5' => {
                                                              'name' => 'DR_ARG_CHUNK_SIZE_MAX',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum dr_arg_chunk_size',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1260415' => {
                                         'Header' => undef,
                                         'Line' => '19',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'log_chunk_size',
                                                              'offset' => '0',
                                                              'type' => '1260361'
                                                            },
                                                     '1' => {
                                                              'name' => 'dmn',
                                                              'offset' => '8',
                                                              'type' => '296745'
                                                            },
                                                     '2' => {
                                                              'name' => 'free_list',
                                                              'offset' => '22',
                                                              'type' => '14321'
                                                            },
                                                     '3' => {
                                                              'name' => 'mutex',
                                                              'offset' => '50',
                                                              'type' => '1228659'
                                                            }
                                                   },
                                         'Name' => 'struct dr_arg_pool',
                                         'Size' => '72',
                                         'Type' => 'Struct'
                                       },
                          '1260481' => {
                                         'BaseType' => '1260497',
                                         'Name' => 'struct dr_arg_pool*[4]',
                                         'Size' => '32',
                                         'Type' => 'Array'
                                       },
                          '1260497' => {
                                         'BaseType' => '1260415',
                                         'Name' => 'struct dr_arg_pool*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1295141' => {
                                         'Header' => undef,
                                         'Line' => '1685',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'flags',
                                                              'offset' => '0',
                                                              'type' => '2001'
                                                            },
                                                     '1' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '8',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_context_attr',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1332995' => {
                                         'BaseType' => '1295141',
                                         'Name' => 'struct mlx5dv_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '13366' => {
                                       'BaseType' => '2023',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13406' => {
                                       'BaseType' => '10975',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13526' => {
                                       'BaseType' => '2694',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13576' => {
                                       'BaseType' => '10802',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13581' => {
                                       'BaseType' => '11031',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1392529' => {
                                         'Header' => undef,
                                         'Line' => '1696',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pci_name',
                                                              'offset' => '0',
                                                              'type' => '1967'
                                                            },
                                                     '1' => {
                                                              'name' => 'flags',
                                                              'offset' => '8',
                                                              'type' => '2001'
                                                            },
                                                     '2' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '22',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_vfio_context_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '13931' => {
                                       'BaseType' => '6695',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13991' => {
                                       'BaseType' => '12186',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1408' => {
                                      'Header' => undef,
                                      'Line' => '49',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '159'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '346'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '128',
                                                            'type' => '346'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '136',
                                                            'type' => '346'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '150',
                                                            'type' => '1824'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '260',
                                                            'type' => '1829'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '274',
                                                            'type' => '159'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '278',
                                                            'type' => '159'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '288',
                                                            'type' => '248'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '296',
                                                            'type' => '58'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '304',
                                                            'type' => '111'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '305',
                                                            'type' => '1834'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '22',
                                                           'type' => '346'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '310',
                                                            'type' => '1850'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '324',
                                                            'type' => '260'
                                                          },
                                                  '22' => {
                                                            'name' => '_codecvt',
                                                            'offset' => '338',
                                                            'type' => '1860'
                                                          },
                                                  '23' => {
                                                            'name' => '_wide_data',
                                                            'offset' => '352',
                                                            'type' => '1870'
                                                          },
                                                  '24' => {
                                                            'name' => '_freeres_list',
                                                            'offset' => '360',
                                                            'type' => '1829'
                                                          },
                                                  '25' => {
                                                            'name' => '_freeres_buf',
                                                            'offset' => '374',
                                                            'type' => '308'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '388',
                                                            'type' => '419'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '402',
                                                            'type' => '159'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '406',
                                                            'type' => '1875'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '36',
                                                           'type' => '346'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '50',
                                                           'type' => '346'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '64',
                                                           'type' => '346'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '72',
                                                           'type' => '346'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '86',
                                                           'type' => '346'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '100',
                                                           'type' => '346'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '114',
                                                           'type' => '346'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '14156' => {
                                       'BaseType' => '7293',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14186' => {
                                       'BaseType' => '2001',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14276' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '14316'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '14316'
                                                          }
                                                 },
                                       'Name' => 'struct list_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1430394' => {
                                         'BaseType' => '11252',
                                         'Name' => 'struct ibv_device**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1430399' => {
                                         'BaseType' => '1392529',
                                         'Name' => 'struct mlx5dv_vfio_context_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '14316' => {
                                       'BaseType' => '14276',
                                       'Name' => 'struct list_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14321' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'n',
                                                            'offset' => '0',
                                                            'type' => '14276'
                                                          }
                                                 },
                                       'Name' => 'struct list_head',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '147' => {
                                     'BaseType' => '58',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '15195' => {
                                       'Header' => undef,
                                       'Line' => '42',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_RX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_TX',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_FDB',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_RX',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TX',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_table_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15243' => {
                                       'Header' => undef,
                                       'Line' => '50',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TUNNEL_TO_L2',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L2_TUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L3_TUNNEL_TO_L2',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L3_TUNNEL',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_flow_action_packet_reformat_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15285' => {
                                       'Header' => undef,
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'wr_id',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15323'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_cmd_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15323' => {
                                       'BaseType' => '2143',
                                       'Name' => '__u8[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '15338' => {
                                       'Header' => undef,
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_MEMIC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_STEERING_SW_ICM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_SW_ICM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_IB_UAPI_DM_TYPE_HEADER_MODIFY_PATTERN_SW_ICM',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_dm_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15380' => {
                                       'Header' => undef,
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_IB_UAPI_DEVX_CR_EV_CH_FLAGS_OMIT_DATA',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_ib_uapi_devx_create_event_channel_flags',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15404' => {
                                       'Header' => undef,
                                       'Line' => '73',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_data',
                                                            'offset' => '8',
                                                            'type' => '15323'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_devx_async_event_hdr',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15442' => {
                                       'Header' => undef,
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '2167'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '4',
                                                            'type' => '2167'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_reg',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15482' => {
                                       'Header' => undef,
                                       'Line' => '101',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '2179'
                                                          },
                                                   '1' => {
                                                            'name' => 'vport',
                                                            'offset' => '8',
                                                            'type' => '2155'
                                                          },
                                                   '2' => {
                                                            'name' => 'vport_vhca_id',
                                                            'offset' => '16',
                                                            'type' => '2155'
                                                          },
                                                   '3' => {
                                                            'name' => 'esw_owner_vhca_id',
                                                            'offset' => '18',
                                                            'type' => '2155'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsvd0',
                                                            'offset' => '20',
                                                            'type' => '2155'
                                                          },
                                                   '5' => {
                                                            'name' => 'vport_steering_icm_rx',
                                                            'offset' => '22',
                                                            'type' => '2179'
                                                          },
                                                   '6' => {
                                                            'name' => 'vport_steering_icm_tx',
                                                            'offset' => '36',
                                                            'type' => '2179'
                                                          },
                                                   '7' => {
                                                            'name' => 'reg_c0',
                                                            'offset' => '50',
                                                            'type' => '15442'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_ib_uapi_query_port',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '15596' => {
                                       'Header' => undef,
                                       'Line' => '91',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_num',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_format',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cqe_comp_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15636' => {
                                       'Header' => undef,
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sw_parsing_offloads',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sw_parsing_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15676' => {
                                       'Header' => undef,
                                       'Line' => '101',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'min_single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_single_stride_log_num_of_bytes',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'min_single_wqe_log_num_of_strides',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_single_wqe_log_num_of_strides',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '15755' => {
                                       'Header' => undef,
                                       'Line' => '109',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams_caps',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '15795' => {
                                       'Header' => undef,
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_T10DIF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_TYPE_CRC',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15825' => {
                                       'Header' => undef,
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CRC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_T10DIF_CSUM',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_t10dif_bg_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15855' => {
                                       'Header' => undef,
                                       'Line' => '150',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC32C',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_SIG_CRC_TYPE_CRC64_XP10',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_sig_crc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15891' => {
                                       'Header' => undef,
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_512',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_520',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4048',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4096',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_BLOCK_SIZE_4160',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_block_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '159' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '15939' => {
                                       'Header' => undef,
                                       'Line' => '178',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'block_size',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_prot',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 't10dif_bg',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'crc_type',
                                                            'offset' => '20',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_caps',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16005' => {
                                       'Header' => undef,
                                       'Line' => '201',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'failed_selftests',
                                                            'offset' => '0',
                                                            'type' => '1989'
                                                          },
                                                   '1' => {
                                                            'name' => 'crypto_engines',
                                                            'offset' => '2',
                                                            'type' => '1977'
                                                          },
                                                   '2' => {
                                                            'name' => 'wrapped_import_method',
                                                            'offset' => '3',
                                                            'type' => '1977'
                                                          },
                                                   '3' => {
                                                            'name' => 'log_max_num_deks',
                                                            'offset' => '4',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_caps',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '16084' => {
                                       'Header' => undef,
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '10' => {
                                                             'name' => 'dc_odp_caps',
                                                             'offset' => '132',
                                                             'type' => '2001'
                                                           },
                                                   '11' => {
                                                             'name' => 'hca_core_clock',
                                                             'offset' => '136',
                                                             'type' => '308'
                                                           },
                                                   '12' => {
                                                             'name' => 'num_lag_ports',
                                                             'offset' => '150',
                                                             'type' => '1977'
                                                           },
                                                   '13' => {
                                                             'name' => 'sig_caps',
                                                             'offset' => '260',
                                                             'type' => '15939'
                                                           },
                                                   '14' => {
                                                             'name' => 'dci_streams_caps',
                                                             'offset' => '288',
                                                             'type' => '15755'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_wr_memcpy_length',
                                                             'offset' => '296',
                                                             'type' => '419'
                                                           },
                                                   '16' => {
                                                             'name' => 'crypto_caps',
                                                             'offset' => '310',
                                                             'type' => '16005'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_comp_caps',
                                                            'offset' => '36',
                                                            'type' => '15596'
                                                          },
                                                   '4' => {
                                                            'name' => 'sw_parsing_caps',
                                                            'offset' => '50',
                                                            'type' => '15636'
                                                          },
                                                   '5' => {
                                                            'name' => 'striding_rq_caps',
                                                            'offset' => '64',
                                                            'type' => '15676'
                                                          },
                                                   '6' => {
                                                            'name' => 'tunnel_offloads_caps',
                                                            'offset' => '96',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_dynamic_bfregs',
                                                            'offset' => '100',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_clock_info_update_nsec',
                                                            'offset' => '114',
                                                            'type' => '2023'
                                                          },
                                                   '9' => {
                                                            'name' => 'flow_action_flags',
                                                            'offset' => '128',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_context',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '16319' => {
                                       'Header' => undef,
                                       'Line' => '262',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'cqe_comp_res_format',
                                                            'offset' => '8',
                                                            'type' => '1977'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '22',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16389' => {
                                       'Header' => undef,
                                       'Line' => '291',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pd',
                                                            'offset' => '0',
                                                            'type' => '6293'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_entries',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16444' => {
                                       'Header' => undef,
                                       'Line' => '297',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '16486' => {
                                       'Header' => undef,
                                       'Line' => '312',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCT',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCI',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16515' => {
                                       'Header' => undef,
                                       'Line' => '317',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'log_num_concurent',
                                                            'offset' => '0',
                                                            'type' => '1977'
                                                          },
                                                   '1' => {
                                                            'name' => 'log_num_errored',
                                                            'offset' => '1',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dci_streams',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '16557' => {
                                       'Header' => undef,
                                       'Line' => '324',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dct_access_key',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'dci_streams',
                                                            'offset' => '0',
                                                            'type' => '16515'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '16593' => {
                                       'Header' => undef,
                                       'Line' => '322',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dc_type',
                                                            'offset' => '0',
                                                            'type' => '16486'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '16557'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dc_init_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '166' => {
                                     'BaseType' => '159',
                                     'Name' => 'int volatile',
                                     'Size' => '4',
                                     'Type' => 'Volatile'
                                   },
                          '16627' => {
                                       'Header' => undef,
                                       'Line' => '338',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'create_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'dc_init_attr',
                                                            'offset' => '22',
                                                            'type' => '16593'
                                                          },
                                                   '3' => {
                                                            'name' => 'send_ops_flags',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_init_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '16697' => {
                                       'Header' => undef,
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'bytes_count',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes_skip',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'lkey',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mr_interleaved',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '16767' => {
                                       'BaseType' => '16697',
                                       'Name' => 'struct mlx5dv_mr_interleaved const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '16772' => {
                                       'Header' => undef,
                                       'Line' => '362',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bg_type',
                                                            'offset' => '0',
                                                            'type' => '15825'
                                                          },
                                                   '1' => {
                                                            'name' => 'bg',
                                                            'offset' => '4',
                                                            'type' => '1989'
                                                          },
                                                   '2' => {
                                                            'name' => 'app_tag',
                                                            'offset' => '6',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'ref_tag',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '18',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_t10dif',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16855' => {
                                       'BaseType' => '16772',
                                       'Name' => 'struct mlx5dv_sig_t10dif const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '16860' => {
                                       'Header' => undef,
                                       'Line' => '370',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '15855'
                                                          },
                                                   '1' => {
                                                            'name' => 'seed',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_crc',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '16902' => {
                                       'BaseType' => '16860',
                                       'Name' => 'struct mlx5dv_sig_crc const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '16907' => {
                                       'Header' => undef,
                                       'Line' => '377',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dif',
                                                            'offset' => '0',
                                                            'type' => '16943'
                                                          },
                                                   '1' => {
                                                            'name' => 'crc',
                                                            'offset' => '0',
                                                            'type' => '16948'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '16943' => {
                                       'BaseType' => '16855',
                                       'Name' => 'struct mlx5dv_sig_t10dif const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1694322' => {
                                         'Header' => undef,
                                         'Line' => '582',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MLX5DV_MKEY_NO_ERR',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_GUARD',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_REFTAG',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MLX5DV_MKEY_SIG_BLOCK_BAD_APPTAG',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum mlx5dv_mkey_err_type',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1694364' => {
                                         'Header' => undef,
                                         'Line' => '589',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'actual_value',
                                                              'offset' => '0',
                                                              'type' => '2023'
                                                            },
                                                     '1' => {
                                                              'name' => 'expected_value',
                                                              'offset' => '8',
                                                              'type' => '2023'
                                                            },
                                                     '2' => {
                                                              'name' => 'offset',
                                                              'offset' => '22',
                                                              'type' => '2023'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_sig_err',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1694420' => {
                                         'Header' => undef,
                                         'Line' => '597',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'sig',
                                                              'offset' => '0',
                                                              'type' => '1694364'
                                                            }
                                                   },
                                         'Size' => '24',
                                         'Type' => 'Union'
                                       },
                          '1694443' => {
                                         'Header' => undef,
                                         'Line' => '595',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'err_type',
                                                              'offset' => '0',
                                                              'type' => '1694322'
                                                            },
                                                     '1' => {
                                                              'name' => 'err',
                                                              'offset' => '8',
                                                              'type' => '1694420'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_mkey_err',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '16948' => {
                                       'BaseType' => '16902',
                                       'Name' => 'struct mlx5dv_sig_crc const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16953' => {
                                       'Header' => undef,
                                       'Line' => '375',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sig_type',
                                                            'offset' => '0',
                                                            'type' => '15795'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig',
                                                            'offset' => '8',
                                                            'type' => '16907'
                                                          },
                                                   '2' => {
                                                            'name' => 'block_size',
                                                            'offset' => '22',
                                                            'type' => '15891'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_domain',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '17023' => {
                                       'BaseType' => '16953',
                                       'Name' => 'struct mlx5dv_sig_block_domain const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17028' => {
                                       'Header' => undef,
                                       'Line' => '398',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mem',
                                                            'offset' => '0',
                                                            'type' => '17131'
                                                          },
                                                   '1' => {
                                                            'name' => 'wire',
                                                            'offset' => '8',
                                                            'type' => '17131'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'check_mask',
                                                            'offset' => '32',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'copy_mask',
                                                            'offset' => '33',
                                                            'type' => '1977'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sig_block_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '17126' => {
                                       'BaseType' => '17028',
                                       'Name' => 'struct mlx5dv_sig_block_attr const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '17131' => {
                                       'BaseType' => '17023',
                                       'Name' => 'struct mlx5dv_sig_block_domain const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17136' => {
                                       'Header' => undef,
                                       'Line' => '407',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_STANDARD_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_standard',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17159' => {
                                       'Header' => undef,
                                       'Line' => '411',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_AFTER_CRYPTO_ON_TX',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_SIGNATURE_CRYPTO_ORDER_SIGNATURE_BEFORE_CRYPTO_ON_TX',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_signature_crypto_order',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '17188' => {
                                       'Header' => undef,
                                       'Line' => '416',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crypto_standard',
                                                            'offset' => '0',
                                                            'type' => '17136'
                                                          },
                                                   '1' => {
                                                            'name' => 'encrypt_on_tx',
                                                            'offset' => '4',
                                                            'type' => '2091'
                                                          },
                                                   '2' => {
                                                            'name' => 'signature_crypto_order',
                                                            'offset' => '8',
                                                            'type' => '17159'
                                                          },
                                                   '3' => {
                                                            'name' => 'data_unit_size',
                                                            'offset' => '18',
                                                            'type' => '15891'
                                                          },
                                                   '4' => {
                                                            'name' => 'initial_tweak',
                                                            'offset' => '22',
                                                            'type' => '17319'
                                                          },
                                                   '5' => {
                                                            'name' => 'dek',
                                                            'offset' => '50',
                                                            'type' => '17363'
                                                          },
                                                   '6' => {
                                                            'name' => 'keytag',
                                                            'offset' => '64',
                                                            'type' => '978'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '72',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '17314' => {
                                       'BaseType' => '17188',
                                       'Name' => 'struct mlx5dv_crypto_attr const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '17319' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '17335' => {
                                       'Header' => undef,
                                       'Line' => '906',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19090'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '17363' => {
                                       'BaseType' => '17335',
                                       'Name' => 'struct mlx5dv_dek*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17368' => {
                                       'Header' => undef,
                                       'Line' => '431',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conf_flags',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey_conf_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '17410' => {
                                       'Header' => undef,
                                       'Line' => '442',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'wr_set_dc_addr',
                                                            'offset' => '8',
                                                            'type' => '17637'
                                                          },
                                                   '10' => {
                                                             'name' => 'wr_set_dc_addr_stream',
                                                             'offset' => '128',
                                                             'type' => '17926'
                                                           },
                                                   '11' => {
                                                             'name' => 'wr_memcpy',
                                                             'offset' => '136',
                                                             'type' => '17967'
                                                           },
                                                   '12' => {
                                                             'name' => 'wr_set_mkey_crypto',
                                                             'offset' => '150',
                                                             'type' => '17993'
                                                           },
                                                   '2' => {
                                                            'name' => 'wr_mr_interleaved',
                                                            'offset' => '22',
                                                            'type' => '17688'
                                                          },
                                                   '3' => {
                                                            'name' => 'wr_mr_list',
                                                            'offset' => '36',
                                                            'type' => '17724'
                                                          },
                                                   '4' => {
                                                            'name' => 'wr_mkey_configure',
                                                            'offset' => '50',
                                                            'type' => '17760'
                                                          },
                                                   '5' => {
                                                            'name' => 'wr_set_mkey_access_flags',
                                                            'offset' => '64',
                                                            'type' => '17781'
                                                          },
                                                   '6' => {
                                                            'name' => 'wr_set_mkey_layout_list',
                                                            'offset' => '72',
                                                            'type' => '17807'
                                                          },
                                                   '7' => {
                                                            'name' => 'wr_set_mkey_layout_interleaved',
                                                            'offset' => '86',
                                                            'type' => '17843'
                                                          },
                                                   '8' => {
                                                            'name' => 'wr_set_mkey_sig_block',
                                                            'offset' => '100',
                                                            'type' => '17869'
                                                          },
                                                   '9' => {
                                                            'name' => 'wr_raw_wqe',
                                                            'offset' => '114',
                                                            'type' => '17890'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_ex',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '1746957' => {
                                         'BaseType' => '1694443',
                                         'Name' => 'struct mlx5dv_mkey_err*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '176' => {
                                     'BaseType' => '70',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '17632' => {
                                       'BaseType' => '17410',
                                       'Name' => 'struct mlx5dv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17637' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '8206'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17678' => {
                                       'BaseType' => '16444',
                                       'Name' => 'struct mlx5dv_mkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17683' => {
                                       'BaseType' => '16697',
                                       'Name' => 'struct mlx5dv_mr_interleaved*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17688' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint32_t, uint16_t, struct mlx5dv_mr_interleaved*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '17678'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2001'
                                                           },
                                                    '4' => {
                                                             'type' => '1989'
                                                           },
                                                    '5' => {
                                                             'type' => '17683'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17724' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint16_t, struct ibv_sge*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '17678'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '1989'
                                                           },
                                                    '4' => {
                                                             'type' => '8595'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17755' => {
                                       'BaseType' => '17368',
                                       'Name' => 'struct mlx5dv_mkey_conf_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17760' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint8_t, struct mlx5dv_mkey_conf_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '17678'
                                                           },
                                                    '2' => {
                                                             'type' => '1977'
                                                           },
                                                    '3' => {
                                                             'type' => '17755'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17781' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17807' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint16_t, struct ibv_sge const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '1989'
                                                           },
                                                    '2' => {
                                                             'type' => '9794'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17838' => {
                                       'BaseType' => '16767',
                                       'Name' => 'struct mlx5dv_mr_interleaved const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17843' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint16_t, struct mlx5dv_mr_interleaved const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '1989'
                                                           },
                                                    '3' => {
                                                             'type' => '17838'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17864' => {
                                       'BaseType' => '17126',
                                       'Name' => 'struct mlx5dv_sig_block_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17869' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_sig_block_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '17864'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17890' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '1961'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17926' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t, uint16_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '8206'
                                                           },
                                                    '2' => {
                                                             'type' => '2001'
                                                           },
                                                    '3' => {
                                                             'type' => '2023'
                                                           },
                                                    '4' => {
                                                             'type' => '1989'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17967' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, uint32_t, uint64_t, uint32_t, uint64_t, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '2001'
                                                           },
                                                    '2' => {
                                                             'type' => '2023'
                                                           },
                                                    '3' => {
                                                             'type' => '2001'
                                                           },
                                                    '4' => {
                                                             'type' => '2023'
                                                           },
                                                    '5' => {
                                                             'type' => '419'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17988' => {
                                       'BaseType' => '17314',
                                       'Name' => 'struct mlx5dv_crypto_attr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1799' => {
                                      'BaseType' => '1408',
                                      'Header' => undef,
                                      'Line' => '7',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '17993' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_crypto_attr const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17632'
                                                           },
                                                    '1' => {
                                                             'type' => '17988'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17998' => {
                                       'Header' => undef,
                                       'Line' => '621',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '950'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '86',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '18068' => {
                                       'Header' => undef,
                                       'Line' => '628',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'credential_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'import_kek_id',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'credential',
                                                            'offset' => '8',
                                                            'type' => '1961'
                                                          },
                                                   '3' => {
                                                            'name' => 'credential_len',
                                                            'offset' => '22',
                                                            'type' => '419'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_attr_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1811' => {
                                      'BaseType' => '1',
                                      'Header' => undef,
                                      'Line' => '43',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '18152' => {
                                       'Header' => undef,
                                       'Line' => '635',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_VALID',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_NO_LOGIN',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_CRYPTO_LOGIN_STATE_INVALID',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_login_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18187' => {
                                       'Header' => undef,
                                       'Line' => '641',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18152'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_query_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1819' => {
                                      'Name' => 'struct _IO_marker',
                                      'Type' => 'Struct'
                                    },
                          '18229' => {
                                       'Header' => undef,
                                       'Line' => '663',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_128',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_SIZE_256',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_size',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1824' => {
                                      'BaseType' => '1819',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18258' => {
                                       'Header' => undef,
                                       'Line' => '668',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CRYPTO_KEY_PURPOSE_AES_XTS',
                                                            'value' => '0'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_crypto_key_purpose',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18281' => {
                                       'Header' => undef,
                                       'Line' => '672',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DEK_STATE_READY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DEK_STATE_ERROR',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dek_state',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1829' => {
                                      'BaseType' => '1408',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18310' => {
                                       'Header' => undef,
                                       'Line' => '681',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key_size',
                                                            'offset' => '0',
                                                            'type' => '18229'
                                                          },
                                                   '1' => {
                                                            'name' => 'has_keytag',
                                                            'offset' => '4',
                                                            'type' => '2091'
                                                          },
                                                   '2' => {
                                                            'name' => 'key_purpose',
                                                            'offset' => '8',
                                                            'type' => '18258'
                                                          },
                                                   '3' => {
                                                            'name' => 'pd',
                                                            'offset' => '22',
                                                            'type' => '6293'
                                                          },
                                                   '4' => {
                                                            'name' => 'opaque',
                                                            'offset' => '36',
                                                            'type' => '978'
                                                          },
                                                   '5' => {
                                                            'name' => 'key',
                                                            'offset' => '50',
                                                            'type' => '18435'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '352',
                                                            'type' => '2023'
                                                          },
                                                   '7' => {
                                                            'name' => 'crypto_login',
                                                            'offset' => '360',
                                                            'type' => '18479'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_init_attr',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '1834' => {
                                      'BaseType' => '356',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '18435' => {
                                       'BaseType' => '356',
                                       'Name' => 'char[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '18451' => {
                                       'Header' => undef,
                                       'Line' => '902',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'devx_obj',
                                                            'offset' => '0',
                                                            'type' => '19090'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_crypto_login_obj',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '18479' => {
                                       'BaseType' => '18451',
                                       'Name' => 'struct mlx5dv_crypto_login_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18484' => {
                                       'Header' => undef,
                                       'Line' => '692',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '18281'
                                                          },
                                                   '1' => {
                                                            'name' => 'opaque',
                                                            'offset' => '4',
                                                            'type' => '978'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dek_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1850' => {
                                      'BaseType' => '1811',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18540' => {
                                       'Header' => undef,
                                       'Line' => '711',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'action_flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_esp',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1855' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'Type' => 'Struct'
                                    },
                          '18582' => {
                                       'Header' => undef,
                                       'Line' => '716',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'match_sz',
                                                            'offset' => '0',
                                                            'type' => '419'
                                                          },
                                                   '1' => {
                                                            'name' => 'match_buf',
                                                            'offset' => '8',
                                                            'type' => '18624'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_match_parameters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1860' => {
                                      'BaseType' => '1855',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18624' => {
                                       'BaseType' => '2023',
                                       'Name' => 'uint64_t[]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '18639' => {
                                       'Header' => undef,
                                       'Line' => '725',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '10745'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'priority',
                                                            'offset' => '8',
                                                            'type' => '1989'
                                                          },
                                                   '3' => {
                                                            'name' => 'match_criteria_enable',
                                                            'offset' => '16',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'match_mask',
                                                            'offset' => '22',
                                                            'type' => '18751'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '6' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '50',
                                                            'type' => '15195'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_matcher_attr',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '1865' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'Type' => 'Struct'
                                    },
                          '1870' => {
                                      'BaseType' => '1865',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1875' => {
                                      'BaseType' => '356',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '18751' => {
                                       'BaseType' => '18582',
                                       'Name' => 'struct mlx5dv_flow_match_parameters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18756' => {
                                       'Header' => undef,
                                       'Line' => '743',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ft_type',
                                                            'offset' => '0',
                                                            'type' => '15195'
                                                          },
                                                   '1' => {
                                                            'name' => 'priority',
                                                            'offset' => '4',
                                                            'type' => '1989'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '188' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '18812' => {
                                       'Header' => undef,
                                       'Line' => '749',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_steering_anchor',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '18839' => {
                                       'Header' => undef,
                                       'Line' => '758',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_IBV_QP',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DROP',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_COUNTER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_IBV_FLOW_ACTION',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_TAG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEST_DEVX',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5DV_FLOW_ACTION_DEFAULT_MISS',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_flow_action_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18904' => {
                                       'Header' => undef,
                                       'Line' => '771',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '5087'
                                                          },
                                                   '1' => {
                                                            'name' => 'counter',
                                                            'offset' => '0',
                                                            'type' => '10858'
                                                          },
                                                   '2' => {
                                                            'name' => 'action',
                                                            'offset' => '0',
                                                            'type' => '13576'
                                                          },
                                                   '3' => {
                                                            'name' => 'tag_value',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'obj',
                                                            'offset' => '0',
                                                            'type' => '19090'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '18978' => {
                                       'Header' => undef,
                                       'Line' => '781',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2944'
                                                          },
                                                   '1' => {
                                                            'name' => 'handle',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '18',
                                                            'type' => '27712'
                                                          },
                                                   '3' => {
                                                            'name' => 'object_id',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'rx_icm_addr',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'log_obj_range',
                                                            'offset' => '50',
                                                            'type' => '1977'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv',
                                                            'offset' => '64',
                                                            'type' => '308'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_obj',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1903' => {
                                      'BaseType' => '248',
                                      'Header' => undef,
                                      'Line' => '63',
                                      'Name' => 'off_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19090' => {
                                       'BaseType' => '18978',
                                       'Name' => 'struct mlx5dv_devx_obj*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19095' => {
                                       'Header' => undef,
                                       'Line' => '769',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '18839'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '18904'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_flow_action_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19129' => {
                                       'Header' => undef,
                                       'Line' => '840',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1915' => {
                                      'BaseType' => '310',
                                      'Header' => undef,
                                      'Line' => '77',
                                      'Name' => 'ssize_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19182' => {
                                       'Header' => undef,
                                       'Line' => '845',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '19235' => {
                                       'Header' => undef,
                                       'Line' => '850',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1927' => {
                                      'BaseType' => '1799',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19274' => {
                                       'Header' => undef,
                                       'Line' => '838',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '0',
                                                            'type' => '19439'
                                                          },
                                                   '1' => {
                                                            'name' => 'sq',
                                                            'offset' => '8',
                                                            'type' => '19129'
                                                          },
                                                   '10' => {
                                                             'name' => 'tir_icm_addr',
                                                             'offset' => '136',
                                                             'type' => '2023'
                                                           },
                                                   '2' => {
                                                            'name' => 'rq',
                                                            'offset' => '36',
                                                            'type' => '19182'
                                                          },
                                                   '3' => {
                                                            'name' => 'bf',
                                                            'offset' => '64',
                                                            'type' => '19235'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '86',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '100',
                                                            'type' => '1903'
                                                          },
                                                   '6' => {
                                                            'name' => 'tirn',
                                                            'offset' => '114',
                                                            'type' => '2001'
                                                          },
                                                   '7' => {
                                                            'name' => 'tisn',
                                                            'offset' => '118',
                                                            'type' => '2001'
                                                          },
                                                   '8' => {
                                                            'name' => 'rqn',
                                                            'offset' => '128',
                                                            'type' => '2001'
                                                          },
                                                   '9' => {
                                                            'name' => 'sqn',
                                                            'offset' => '132',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp',
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '19439' => {
                                       'BaseType' => '2203',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19444' => {
                                       'Header' => undef,
                                       'Line' => '863',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19439'
                                                          },
                                                   '2' => {
                                                            'name' => 'cqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'cqe_size',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'cq_uar',
                                                            'offset' => '36',
                                                            'type' => '308'
                                                          },
                                                   '5' => {
                                                            'name' => 'cqn',
                                                            'offset' => '50',
                                                            'type' => '2001'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '64',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '19556' => {
                                       'Header' => undef,
                                       'Line' => '877',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19439'
                                                          },
                                                   '2' => {
                                                            'name' => 'stride',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'head',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'tail',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '6' => {
                                                            'name' => 'srqn',
                                                            'offset' => '64',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_srq',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1961' => {
                                      'BaseType' => '1966',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1966' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '19668' => {
                                       'Header' => undef,
                                       'Line' => '887',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'dbrec',
                                                            'offset' => '8',
                                                            'type' => '19439'
                                                          },
                                                   '2' => {
                                                            'name' => 'wqe_cnt',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'stride',
                                                            'offset' => '32',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_rwq',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1967' => {
                                      'BaseType' => '363',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19752' => {
                                       'Header' => undef,
                                       'Line' => '895',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '15338'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_alloc_dm_attr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1977' => {
                                      'BaseType' => '123',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '19794' => {
                                       'Header' => undef,
                                       'Line' => '904',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'remote_va',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_dm',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '19864' => {
                                       'Header' => undef,
                                       'Line' => '919',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'av',
                                                            'offset' => '0',
                                                            'type' => '20073'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_ah',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1989' => {
                                      'BaseType' => '147',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '19905' => {
                                       'Header' => undef,
                                       'Line' => '1264',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '20796'
                                                          },
                                                   '1' => {
                                                            'name' => 'dqp_dct',
                                                            'offset' => '8',
                                                            'type' => '2203'
                                                          },
                                                   '10' => {
                                                             'name' => 'rgid',
                                                             'offset' => '50',
                                                             'type' => '2524'
                                                           },
                                                   '2' => {
                                                            'name' => 'stat_rate_sl',
                                                            'offset' => '18',
                                                            'type' => '1977'
                                                          },
                                                   '3' => {
                                                            'name' => 'fl_mlid',
                                                            'offset' => '19',
                                                            'type' => '1977'
                                                          },
                                                   '4' => {
                                                            'name' => 'rlid',
                                                            'offset' => '20',
                                                            'type' => '2191'
                                                          },
                                                   '5' => {
                                                            'name' => 'reserved0',
                                                            'offset' => '22',
                                                            'type' => '20642'
                                                          },
                                                   '6' => {
                                                            'name' => 'rmac',
                                                            'offset' => '32',
                                                            'type' => '10786'
                                                          },
                                                   '7' => {
                                                            'name' => 'tclass',
                                                            'offset' => '38',
                                                            'type' => '1977'
                                                          },
                                                   '8' => {
                                                            'name' => 'hop_limit',
                                                            'offset' => '39',
                                                            'type' => '1977'
                                                          },
                                                   '9' => {
                                                            'name' => 'grh_gid_fl',
                                                            'offset' => '40',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_wqe_av',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '200' => {
                                     'BaseType' => '82',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2001' => {
                                      'BaseType' => '176',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '20073' => {
                                       'BaseType' => '19905',
                                       'Name' => 'struct mlx5_wqe_av*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20078' => {
                                       'Header' => undef,
                                       'Line' => '924',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdn',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_pd',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20120' => {
                                       'Header' => undef,
                                       'Line' => '930',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5087'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20158'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20158' => {
                                       'BaseType' => '19274',
                                       'Name' => 'struct mlx5dv_qp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20163' => {
                                       'Header' => undef,
                                       'Line' => '934',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '4887'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20201'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20201' => {
                                       'BaseType' => '19444',
                                       'Name' => 'struct mlx5dv_cq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20206' => {
                                       'Header' => undef,
                                       'Line' => '938',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5203'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20244'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '2023' => {
                                      'BaseType' => '200',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20244' => {
                                       'BaseType' => '19556',
                                       'Name' => 'struct mlx5dv_srq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20249' => {
                                       'Header' => undef,
                                       'Line' => '942',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '5402'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20287'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20287' => {
                                       'BaseType' => '19668',
                                       'Name' => 'struct mlx5dv_rwq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20292' => {
                                       'Header' => undef,
                                       'Line' => '946',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '2979'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20330'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20330' => {
                                       'BaseType' => '19794',
                                       'Name' => 'struct mlx5dv_dm*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20335' => {
                                       'Header' => undef,
                                       'Line' => '950',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '8206'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20373'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20373' => {
                                       'BaseType' => '19864',
                                       'Name' => 'struct mlx5dv_ah*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20378' => {
                                       'Header' => undef,
                                       'Line' => '954',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '6293'
                                                          },
                                                   '1' => {
                                                            'name' => 'out',
                                                            'offset' => '8',
                                                            'type' => '20416'
                                                          }
                                                 },
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '20416' => {
                                       'BaseType' => '20078',
                                       'Name' => 'struct mlx5dv_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20421' => {
                                       'Header' => undef,
                                       'Line' => '929',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qp',
                                                            'offset' => '0',
                                                            'type' => '20120'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq',
                                                            'offset' => '22',
                                                            'type' => '20163'
                                                          },
                                                   '2' => {
                                                            'name' => 'srq',
                                                            'offset' => '50',
                                                            'type' => '20206'
                                                          },
                                                   '3' => {
                                                            'name' => 'rwq',
                                                            'offset' => '72',
                                                            'type' => '20249'
                                                          },
                                                   '4' => {
                                                            'name' => 'dm',
                                                            'offset' => '100',
                                                            'type' => '20292'
                                                          },
                                                   '5' => {
                                                            'name' => 'ah',
                                                            'offset' => '128',
                                                            'type' => '20335'
                                                          },
                                                   '6' => {
                                                            'name' => 'pd',
                                                            'offset' => '150',
                                                            'type' => '20378'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_obj',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '20528' => {
                                       'Header' => undef,
                                       'Line' => '974',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'single_wqe_log_num_of_strides',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'two_byte_shift_en',
                                                            'offset' => '8',
                                                            'type' => '1977'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_init_attr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '20584' => {
                                       'Header' => undef,
                                       'Line' => '980',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'striding_rq_attrs',
                                                            'offset' => '8',
                                                            'type' => '20528'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_wq_init_attr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '20642' => {
                                       'BaseType' => '1977',
                                       'Name' => 'uint8_t[4]',
                                       'Size' => '4',
                                       'Type' => 'Array'
                                     },
                          '20757' => {
                                       'Header' => undef,
                                       'Line' => '1266',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qkey',
                                                            'offset' => '0',
                                                            'type' => '2203'
                                                          },
                                                   '1' => {
                                                            'name' => 'reserved',
                                                            'offset' => '4',
                                                            'type' => '2203'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '20796' => {
                                       'Header' => undef,
                                       'Line' => '1265',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qkey',
                                                            'offset' => '0',
                                                            'type' => '20757'
                                                          },
                                                   '1' => {
                                                            'name' => 'dc_key',
                                                            'offset' => '0',
                                                            'type' => '2215'
                                                          }
                                                 },
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '20832' => {
                                       'Header' => undef,
                                       'Line' => '1595',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_CTX_ATTR_BUF_ALLOCATORS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_set_ctx_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '2091' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '20957' => {
                                       'Header' => undef,
                                       'Line' => '1619',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nsec',
                                                            'offset' => '0',
                                                            'type' => '2023'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_cycles',
                                                            'offset' => '8',
                                                            'type' => '2023'
                                                          },
                                                   '2' => {
                                                            'name' => 'frac',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          },
                                                   '3' => {
                                                            'name' => 'mult',
                                                            'offset' => '36',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'shift',
                                                            'offset' => '40',
                                                            'type' => '2001'
                                                          },
                                                   '5' => {
                                                            'name' => 'mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_clock_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '2103' => {
                                      'BaseType' => '171',
                                      'Header' => undef,
                                      'Line' => '46',
                                      'Name' => 'atomic_int',
                                      'Type' => 'Typedef'
                                    },
                          '21055' => {
                                       'Header' => undef,
                                       'Line' => '1741',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'umem_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_umem',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21083' => {
                                       'Header' => undef,
                                       'Line' => '1752',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '419'
                                                          },
                                                   '2' => {
                                                            'name' => 'access',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'pgsz_bitmap',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          },
                                                   '5' => {
                                                            'name' => 'dmabuf_fd',
                                                            'offset' => '64',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_umem_in',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '21181' => {
                                       'Header' => undef,
                                       'Line' => '1766',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg_addr',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          },
                                                   '1' => {
                                                            'name' => 'base_addr',
                                                            'offset' => '8',
                                                            'type' => '308'
                                                          },
                                                   '2' => {
                                                            'name' => 'page_id',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '36',
                                                            'type' => '1903'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '50',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_uar',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '21265' => {
                                       'Header' => undef,
                                       'Line' => '1779',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'page_id',
                                                            'offset' => '0',
                                                            'type' => '2001'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '8',
                                                            'type' => '1903'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '22',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_var',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21335' => {
                                       'Header' => undef,
                                       'Line' => '1816',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_cmd_comp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21362' => {
                                       'Header' => undef,
                                       'Line' => '1832',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_event_channel',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21389' => {
                                       'Header' => undef,
                                       'Line' => '2126',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'index',
                                                            'offset' => '0',
                                                            'type' => '1989'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_pp',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '21417' => {
                                       'Header' => undef,
                                       'Line' => '2152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '21548'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '8',
                                                            'type' => '2001'
                                                          },
                                                   '2' => {
                                                            'name' => 'bw_share',
                                                            'offset' => '18',
                                                            'type' => '2001'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_avg_bw',
                                                            'offset' => '22',
                                                            'type' => '2001'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '36',
                                                            'type' => '2023'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sched_attr',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '2143' => {
                                      'BaseType' => '46',
                                      'Header' => undef,
                                      'Line' => '21',
                                      'Name' => '__u8',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '21501' => {
                                       'BaseType' => '21417',
                                       'Name' => 'struct mlx5dv_sched_attr const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '21506' => {
                                       'Header' => undef,
                                       'Line' => '924',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '21548'
                                                          },
                                                   '1' => {
                                                            'name' => 'obj',
                                                            'offset' => '8',
                                                            'type' => '19090'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sched_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '21548' => {
                                       'BaseType' => '21506',
                                       'Name' => 'struct mlx5dv_sched_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2155' => {
                                      'BaseType' => '58',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => '__u16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '21553' => {
                                       'Header' => undef,
                                       'Line' => '2195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'vector',
                                                            'offset' => '0',
                                                            'type' => '159'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '4',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_msi_vector',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '21594' => {
                                       'Header' => undef,
                                       'Line' => '2205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'vaddr',
                                                            'offset' => '0',
                                                            'type' => '308'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_eq',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '2167' => {
                                      'BaseType' => '70',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '21702' => {
                                       'Header' => undef,
                                       'Line' => '197',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_ANON',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_HUGE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_CONTIG',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_PREFER_HUGE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_PREFER_CONTIG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_EXTERNAL',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_CUSTOM',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_ALL',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_alloc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '2179' => {
                                      'BaseType' => '443',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '21856' => {
                                       'Header' => undef,
                                       'Line' => '243',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lock',
                                                            'offset' => '0',
                                                            'type' => '994'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_use',
                                                            'offset' => '4',
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'name' => 'need_lock',
                                                            'offset' => '8',
                                                            'type' => '159'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_spinlock',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '2191' => {
                                      'BaseType' => '2155',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => '__be16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2203' => {
                                      'BaseType' => '2167',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2215' => {
                                      'BaseType' => '2179',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '22184' => {
                                       'BaseType' => '82',
                                       'Name' => 'unsigned long*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2243' => {
                                      'Header' => undef,
                                      'Line' => '144',
                                      'Memb' => {
