$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.0.1',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx5.so.1.15.31.0',
          'LibraryVersion' => 'mlx5',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '202573' => {
                                          'Header' => undef,
                                          'Line' => '1240',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'ctx_in',
                                                                'type' => '2369'
                                                              },
                                                       '1' => {
                                                                'name' => 'clock_info',
                                                                'type' => '200269'
                                                              }

                                                     'mlx5dv_dr_action_create_packet_reformat@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_action_create_tag@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_action_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_action_modify_flow_meter@@MLX5_1.12' => 1,
                                                     'mlx5dv_dr_domain_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_domain_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_domain_set_reclaim_device_memory@@MLX5_1.14' => 1,
                                                     'mlx5dv_dr_domain_sync@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_matcher_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_matcher_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_rule_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_rule_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_table_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_table_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dump_dr_domain@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_matcher@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_rule@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_table@@MLX5_1.12' => 1,
                                                     'mlx5dv_free_var@@MLX5_1.12' => 1,
                                                     'mlx5dv_get_clock_info@@MLX5_1.4' => 1,
                                                     'mlx5dv_init_obj@@MLX5_1.2' => 1,
                                                     'mlx5dv_init_obj@MLX5_1.0' => 1,
                                                     'mlx5dv_is_supported@@MLX5_1.8' => 1,
                                                     'mlx5dv_modify_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_open_device@@MLX5_1.7' => 1,
                                                     'mlx5dv_pp_alloc@@MLX5_1.13' => 1,
                                                     'mlx5dv_pp_free@@MLX5_1.13' => 1,
                                                     'mlx5dv_qp_ex_from_ibv_qp_ex@@MLX5_1.10' => 1,
                                                     'mlx5dv_query_device@@MLX5_1.0' => 1,
                                                     'mlx5dv_query_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_set_context_attr@@MLX5_1.2' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10002' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           }
                                                  },
                                       'Return' => '1554',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10023' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           }
                                                  },
                                       'Return' => '1631',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10044' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           }
                                                  },
                                       'Return' => '59',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10065' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           }
                                                  },
                                       'Return' => '1530',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10086' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           }
                                                  },
                                       'Return' => '1571',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10107' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           }
                                                  },
                                       'Return' => '1542',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10129' => {
                                       'BaseType' => '9407',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10135' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9910'
                                                           },
                                                    '1' => {
                                                             'type' => '10129'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10227' => {
                                       'Header' => undef,
                                       'Line' => '1624',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10271' => {
                                       'Header' => undef,
                                       'Line' => '1856',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2369'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10300' => {
                                       'Header' => undef,
                                       'Line' => '2020',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2369'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10329' => {
                                       'BaseType' => '10300',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10448' => {
                                       'Header' => undef,
                                       'Line' => '1850',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2369'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10505' => {
                                       'Header' => undef,
                                       'Line' => '1864',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '10660'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '1671'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '12',
                                                            'type' => '1542'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '16',
                                                            'type' => '219'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '24',
                                                            'type' => '1696'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '28',
                                                            'type' => '1542'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '32',
                                                            'type' => '219'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '40',
                                                            'type' => '1854'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '1554'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '52',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10660' => {
                                       'BaseType' => '1860',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10666' => {
                                       'Header' => undef,
                                       'Line' => '1885',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '10850'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '10867'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10729' => {
                                       'BaseType' => '10735',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10735' => {
                                       'Header' => undef,
                                       'Line' => '1895',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '10666'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '16',
                                                            'type' => '1972'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '20',
                                                            'type' => '2039'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '24',
                                                            'type' => '2987'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '88',
                                                            'type' => '2987'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '152',
                                                            'type' => '10873'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '408',
                                                            'type' => '10873'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '10850' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10729'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           }
                                                  },
                                       'Return' => '2369',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10867' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2369'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10873' => {
                                       'BaseType' => '244',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '10889' => {
                                       'Header' => undef,
                                       'Line' => '1910',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '11358'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '11400'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '80',
                                                             'type' => '11358'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '88',
                                                             'type' => '11521'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '96',
                                                             'type' => '11547'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '104',
                                                             'type' => '11358'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '112',
                                                             'type' => '11358'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '120',
                                                             'type' => '11358'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '128',
                                                             'type' => '11358'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '136',
                                                             'type' => '11358'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '144',
                                                             'type' => '11358'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '152',
                                                             'type' => '11358'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '16',
                                                            'type' => '11358'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '160',
                                                             'type' => '11578'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '168',
                                                             'type' => '11358'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '176',
                                                             'type' => '11358'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '184',
                                                             'type' => '11358'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '192',
                                                             'type' => '11358'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '200',
                                                             'type' => '11615'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '208',
                                                             'type' => '11646'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '216',
                                                             'type' => '11358'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '224',
                                                             'type' => '11358'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '232',
                                                             'type' => '11358'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '24',
                                                            'type' => '11358'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '240',
                                                             'type' => '11358'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '248',
                                                             'type' => '11358'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '32',
                                                            'type' => '11358'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '40',
                                                            'type' => '11358'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '48',
                                                            'type' => '11358'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '56',
                                                            'type' => '11426'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '64',
                                                            'type' => '11463'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '72',
                                                            'type' => '11484'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '11358' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '219',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11389' => {
                                       'BaseType' => '11395',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11395' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '11400' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2369'
                                                           },
                                                    '1' => {
                                                             'type' => '1530'
                                                           },
                                                    '2' => {
                                                             'type' => '11389'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11426' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5725'
                                                           },
                                                    '1' => {
                                                             'type' => '5731'
                                                           }
                                                  },
                                       'Return' => '7831',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11457' => {
                                       'BaseType' => '8416',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11463' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4516'
                                                           },
                                                    '1' => {
                                                             'type' => '7831'
                                                           },
                                                    '2' => {
                                                             'type' => '11457'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11484' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7831'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11515' => {
                                       'BaseType' => '5158',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11521' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4314'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           },
                                                    '2' => {
                                                             'type' => '11515'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11547' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4314'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11578' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4634'
                                                           },
                                                    '1' => {
                                                             'type' => '8148'
                                                           },
                                                    '2' => {
                                                             'type' => '8498'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '116' => {
                                     'BaseType' => '52',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '11609' => {
                                       'BaseType' => '8065',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11615' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4516'
                                                           },
                                                    '1' => {
                                                             'type' => '8065'
                                                           },
                                                    '2' => {
                                                             'type' => '11609'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11646' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4516'
                                                           },
                                                    '1' => {
                                                             'type' => '8148'
                                                           },
                                                    '2' => {
                                                             'type' => '8498'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11652' => {
                                       'Header' => undef,
                                       'Line' => '1972',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '219'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '16',
                                                            'type' => '9372'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '24',
                                                            'type' => '1554'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '32',
                                                            'type' => '1571'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '1554'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '44',
                                                            'type' => '1554'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '48',
                                                            'type' => '5725'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '11917' => {
                                       'Name' => 'void*(*)(struct ibv_pd*, void*, size_t, size_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5725'
                                                           },
                                                    '1' => {
                                                             'type' => '219'
                                                           },
                                                    '2' => {
                                                             'type' => '314'
                                                           },
                                                    '3' => {
                                                             'type' => '314'
                                                           },
                                                    '4' => {
                                                             'type' => '1571'
                                                           }
                                                  },
                                       'Return' => '219',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11949' => {
                                       'Name' => 'void(*)(struct ibv_pd*, void*, void*, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5725'
                                                           },
                                                    '1' => {
                                                             'type' => '219'
                                                           },
                                                    '2' => {
                                                             'type' => '219'
                                                           },
                                                    '3' => {
                                                             'type' => '1571'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '128' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12848' => {
                                       'BaseType' => '1571',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12891' => {
                                       'BaseType' => '10448',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13017' => {
                                       'BaseType' => '2131',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13070' => {
                                       'BaseType' => '10271',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13076' => {
                                       'BaseType' => '10505',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1314' => {
                                      'BaseType' => '923',
                                      'Header' => undef,
                                      'Line' => '7',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '1326' => {
                                      'BaseType' => '1',
                                      'Header' => undef,
                                      'Line' => '43',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '1334' => {
                                      'Name' => 'struct _IO_marker',
                                      'Type' => 'Struct'
                                    },
                          '1339' => {
                                      'BaseType' => '1334',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '13447' => {
                                       'BaseType' => '6142',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1345' => {
                                      'BaseType' => '923',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '135' => {
                                     'BaseType' => '128',
                                     'Name' => 'int volatile',
                                     'Size' => '4',
                                     'Type' => 'Volatile'
                                   },
                          '1351' => {
                                      'BaseType' => '244',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '13511' => {
                                       'BaseType' => '11652',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1367' => {
                                      'BaseType' => '1326',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '13687' => {
                                       'BaseType' => '6754',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13719' => {
                                       'BaseType' => '1554',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1373' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'Type' => 'Struct'
                                    },
                          '1378' => {
                                      'BaseType' => '1373',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '13816' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '13856'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '13856'
                                                          }
                                                 },
                                       'Name' => 'struct list_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1384' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'Type' => 'Struct'
                                    },
                          '13856' => {
                                       'BaseType' => '13816',
                                       'Name' => 'struct list_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13862' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'n',
                                                            'offset' => '0',
                                                            'type' => '13816'
                                                          }
                                                 },
                                       'Name' => 'struct list_head',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1389' => {
                                      'BaseType' => '1384',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1395' => {
                                      'BaseType' => '244',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '140' => {
                                     'BaseType' => '59',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '14107' => {
                                       'Name' => 'atomic_int',
                                       'Size' => '4',
                                       'Type' => 'Intrinsic'
                                     },
                          '1411' => {
                                      'BaseType' => '171',
                                      'Header' => undef,
                                      'Line' => '63',
                                      'Name' => 'off_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1423' => {
                                      'BaseType' => '1314',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14413' => {
                                       'Header' => undef,
                                       'Line' => '87',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_num',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_format',
                                                            'offset' => '4',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cqe_comp_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '14453' => {
                                       'Header' => undef,
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sw_parsing_offloads',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sw_parsing_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '14493' => {
                                       'Header' => undef,
                                       'Line' => '97',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'min_single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_single_stride_log_num_of_bytes',
                                                            'offset' => '4',
                                                            'type' => '1554'
                                                          },
                                                   '2' => {
                                                            'name' => 'min_single_wqe_log_num_of_strides',
                                                            'offset' => '8',
                                                            'type' => '1554'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_single_wqe_log_num_of_strides',
                                                            'offset' => '12',
                                                            'type' => '1554'
                                                          },
                                                   '4' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '16',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '14572' => {
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1458' => {
                                      'BaseType' => '1464',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14612' => {
                                       'Header' => undef,
                                       'Line' => '208',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCT',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCI',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1464' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '14643' => {
                                       'Header' => undef,
                                       'Line' => '234',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '1571'
                                                          },
                                                   '1' => {
                                                            'name' => 'bytes_count',
                                                            'offset' => '8',
                                                            'type' => '1554'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes_skip',
                                                            'offset' => '12',
                                                            'type' => '1554'
                                                          },
                                                   '3' => {
                                                            'name' => 'lkey',
                                                            'offset' => '16',
                                                            'type' => '1554'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mr_interleaved',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14709' => {
                                       'Header' => undef,
                                       'Line' => '245',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '1571'
                                                          },
                                                   '1' => {
                                                            'name' => 'wr_set_dc_addr',
                                                            'offset' => '8',
                                                            'type' => '14808'
                                                          },
                                                   '2' => {
                                                            'name' => 'wr_mr_interleaved',
                                                            'offset' => '16',
                                                            'type' => '14862'
                                                          },
                                                   '3' => {
                                                            'name' => 'wr_mr_list',
                                                            'offset' => '24',
                                                            'type' => '14899'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '14802' => {
                                       'BaseType' => '14709',
                                       'Name' => 'struct mlx5dv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14808' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14802'
                                                           },
                                                    '1' => {
                                                             'type' => '7675'
                                                           },
                                                    '2' => {
                                                             'type' => '1554'
                                                           },
                                                    '3' => {
                                                             'type' => '1571'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14850' => {
                                       'BaseType' => '14572',
                                       'Name' => 'struct mlx5dv_mkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14856' => {
                                       'BaseType' => '14643',
                                       'Name' => 'struct mlx5dv_mr_interleaved*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14862' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint32_t, uint16_t, struct mlx5dv_mr_interleaved*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14802'
                                                           },
                                                    '1' => {
                                                             'type' => '14850'
                                                           },
                                                    '2' => {
                                                             'type' => '1554'
                                                           },
                                                    '3' => {
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'type' => '1542'
                                                           },
                                                    '5' => {
                                                             'type' => '14856'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14899' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint16_t, struct ibv_sge*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14802'
                                                           },
                                                    '1' => {
                                                             'type' => '14850'
                                                           },
                                                    '2' => {
                                                             'type' => '1554'
                                                           },
                                                    '3' => {
                                                             'type' => '1542'
                                                           },
                                                    '4' => {
                                                             'type' => '8071'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14905' => {
                                       'BaseType' => '1631',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15131' => {
                                       'Header' => undef,
                                       'Line' => '1277',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg_addr',
                                                            'offset' => '0',
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'name' => 'base_addr',
                                                            'offset' => '8',
                                                            'type' => '219'
                                                          },
                                                   '2' => {
                                                            'name' => 'page_id',
                                                            'offset' => '16',
                                                            'type' => '1554'
                                                          },
                                                   '3' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '24',
                                                            'type' => '1411'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '1571'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_uar',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '152' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1523' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '1530' => {
                                      'BaseType' => '97',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '15300' => {
                                       'Header' => undef,
                                       'Line' => '174',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_ANON',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_HUGE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_CONTIG',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_PREFER_HUGE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_PREFER_CONTIG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_EXTERNAL',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_CUSTOM',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_ALL',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_alloc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1542' => {
                                      'BaseType' => '116',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '15456' => {
                                       'Header' => undef,
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lock',
                                                            'offset' => '0',
                                                            'type' => '911'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_use',
                                                            'offset' => '4',
                                                            'type' => '128'
                                                          },
                                                   '2' => {
                                                            'name' => 'need_lock',
                                                            'offset' => '8',
                                                            'type' => '128'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_spinlock',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '1554' => {
                                      'BaseType' => '140',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1571' => {
                                      'BaseType' => '159',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1583' => {
                                      'BaseType' => '45',
                                      'Header' => undef,
                                      'Line' => '21',
                                      'Name' => '__u8',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '159' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1595' => {
                                      'BaseType' => '52',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => '__u16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1607' => {
                                      'BaseType' => '59',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1619' => {
                                      'BaseType' => '333',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1631' => {
                                      'BaseType' => '1607',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1643' => {
                                      'BaseType' => '1619',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1671' => {
                                      'Header' => undef,
                                      'Line' => '144',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IB_UVERBS_FLOW_ACTION_ESP_KEYMAT_AES_GCM',
                                                           'value' => '0'
                                                         }
                                                },
                                      'Name' => 'enum ib_uverbs_flow_action_esp_keymat',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1696' => {
                                      'Header' => undef,
                                      'Line' => '163',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IB_UVERBS_FLOW_ACTION_ESP_REPLAY_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IB_UVERBS_FLOW_ACTION_ESP_REPLAY_BMP',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum ib_uverbs_flow_action_esp_replay',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '171' => {
                                     'BaseType' => '152',
                                     'Header' => undef,
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1727' => {
                                      'Header' => undef,
                                      'Line' => '189',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'val_ptr',
                                                           'offset' => '0',
                                                           'type' => '219'
                                                         },
                                                  '1' => {
                                                           'name' => 'val_ptr_data_u64',
                                                           'offset' => '0',
                                                           'type' => '1619'
                                                         }
                                                },
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '1763' => {
                                      'Header' => undef,
                                      'Line' => '190',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_ptr',
                                                           'offset' => '0',
                                                           'type' => '1854'
                                                         },
                                                  '1' => {
                                                           'name' => 'next_ptr_data_u64',
                                                           'offset' => '0',
                                                           'type' => '1619'
                                                         }
                                                },
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '1799' => {
                                      'Header' => undef,
                                      'Line' => '185',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '0',
                                                           'type' => '1727'
                                                         },
                                                  '1' => {
                                                           'name' => 'unnamed1',
                                                           'offset' => '8',
                                                           'type' => '1763'
                                                         },
                                                  '2' => {
                                                           'name' => 'len',
                                                           'offset' => '16',
                                                           'type' => '1595'
                                                         },
                                                  '3' => {
                                                           'name' => 'type',
                                                           'offset' => '18',
                                                           'type' => '1595'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_flow_action_esp_encap',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '18163' => {
                                       'Header' => undef,
                                       'Line' => '516',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg',
                                                            'offset' => '0',
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'name' => 'need_lock',
                                                            'offset' => '8',
                                                            'type' => '128'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dyn_alloc_uar',
                                                             'offset' => '112',
                                                             'type' => '1530'
                                                           },
                                                   '11' => {
                                                             'bitfield' => '1',
                                                             'name' => 'mmaped_entry',
                                                             'offset' => '112',
                                                             'type' => '1530'
                                                           },
                                                   '12' => {
                                                             'bitfield' => '1',
                                                             'name' => 'nc_mode',
                                                             'offset' => '112',
                                                             'type' => '1530'
                                                           },
                                                   '13' => {
                                                             'bitfield' => '1',
                                                             'name' => 'qp_dedicated',
                                                             'offset' => '112',
                                                             'type' => '1530'
                                                           },
                                                   '14' => {
                                                             'bitfield' => '1',
                                                             'name' => 'qp_shared',
                                                             'offset' => '112',
                                                             'type' => '1530'
                                                           },
                                                   '15' => {
                                                             'name' => 'count',
                                                             'offset' => '116',
                                                             'type' => '1554'
                                                           },
                                                   '16' => {
                                                             'name' => 'uar_entry',
                                                             'offset' => '120',
                                                             'type' => '13816'
                                                           },
                                                   '17' => {
                                                             'name' => 'uar_handle',
                                                             'offset' => '136',
                                                             'type' => '1554'
                                                           },
                                                   '18' => {
                                                             'name' => 'length',
                                                             'offset' => '140',
                                                             'type' => '1554'
                                                           },
                                                   '19' => {
                                                             'name' => 'page_id',
                                                             'offset' => '144',
                                                             'type' => '1554'
                                                           },
                                                   '2' => {
                                                            'name' => 'lock',
                                                            'offset' => '12',
                                                            'type' => '15456'
                                                          },
                                                   '3' => {
                                                            'name' => 'offset',
                                                            'offset' => '24',
                                                            'type' => '59'
                                                          },
                                                   '4' => {
                                                            'name' => 'buf_size',
                                                            'offset' => '28',
                                                            'type' => '59'
                                                          },
                                                   '5' => {
                                                            'name' => 'uuarn',
                                                            'offset' => '32',
                                                            'type' => '59'
                                                          },
                                                   '6' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '40',
                                                            'type' => '1411'
                                                          },
                                                   '7' => {
                                                            'name' => 'uar',
                                                            'offset' => '48',
                                                            'type' => '219'
                                                          },
                                                   '8' => {
                                                            'name' => 'bfreg_dyn_index',
                                                            'offset' => '56',
                                                            'type' => '1554'
                                                          },
                                                   '9' => {
                                                            'name' => 'devx_uar',
                                                            'offset' => '64',
                                                            'type' => '19415'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_bf',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '183' => {
                                     'BaseType' => '152',
                                     'Header' => undef,
                                     'Line' => '153',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '18473' => {
                                       'BaseType' => '18163',
                                       'Name' => 'struct mlx5_bf*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18485' => {
                                       'Header' => undef,
                                       'Line' => '339',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'last',
                                                            'offset' => '0',
                                                            'type' => '1554'
                                                          },
                                                   '1' => {
                                                            'name' => 'top',
                                                            'offset' => '4',
                                                            'type' => '1554'
                                                          },
                                                   '2' => {
                                                            'name' => 'max',
                                                            'offset' => '8',
                                                            'type' => '1554'
                                                          },
                                                   '3' => {
                                                            'name' => 'avail',
                                                            'offset' => '12',
                                                            'type' => '1554'
                                                          },
                                                   '4' => {
                                                            'name' => 'mask',
                                                            'offset' => '16',
                                                            'type' => '1554'
                                                          },
                                                   '5' => {
                                                            'name' => 'table',
                                                            'offset' => '24',
                                                            'type' => '18584'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_bitmap',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1854' => {
                                      'BaseType' => '1799',
                                      'Name' => 'struct ib_uverbs_flow_action_esp_encap*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18584' => {
                                       'BaseType' => '66',
                                       'Name' => 'unsigned long*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18590' => {
                                       'Header' => undef,
                                       'Line' => '348',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'shmid',
                                                            'offset' => '0',
                                                            'type' => '128'
                                                          },
                                                   '1' => {
                                                            'name' => 'shmaddr',
                                                            'offset' => '8',
                                                            'type' => '219'
                                                          },
                                                   '2' => {
                                                            'name' => 'bitmap',
                                                            'offset' => '16',
                                                            'type' => '18485'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry',
                                                            'offset' => '48',
                                                            'type' => '13816'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_hugetlb_mem',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1860' => {
                                      'Header' => undef,
                                      'Line' => '195',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'spi',
                                                           'offset' => '0',
                                                           'type' => '1607'
                                                         },
                                                  '1' => {
                                                           'name' => 'seq',
                                                           'offset' => '4',
                                                           'type' => '1607'
                                                         },
                                                  '2' => {
                                                           'name' => 'tfc_pad',
                                                           'offset' => '8',
                                                           'type' => '1607'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '12',
                                                           'type' => '1607'
                                                         },
                                                  '4' => {
                                                           'name' => 'hard_limit_pkts',
                                                           'offset' => '16',
                                                           'type' => '1619'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_flow_action_esp',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '18661' => {
                                       'Header' => undef,
                                       'Line' => '355',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '314'
                                                          },
                                                   '2' => {
                                                            'name' => 'base',
                                                            'offset' => '16',
                                                            'type' => '128'
                                                          },
                                                   '3' => {
                                                            'name' => 'hmem',
                                                            'offset' => '24',
                                                            'type' => '18788'
                                                          },
                                                   '4' => {
                                                            'name' => 'type',
                                                            'offset' => '32',
                                                            'type' => '15300'
                                                          },
                                                   '5' => {
                                                            'name' => 'resource_type',
                                                            'offset' => '40',
                                                            'type' => '1571'
                                                          },
                                                   '6' => {
                                                            'name' => 'req_alignment',
                                                            'offset' => '48',
                                                            'type' => '314'
                                                          },
                                                   '7' => {
                                                            'name' => 'mparent_domain',
                                                            'offset' => '56',
                                                            'type' => '18879'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_buf',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '18788' => {
                                       'BaseType' => '18590',
                                       'Name' => 'struct mlx5_hugetlb_mem*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18794' => {
                                       'Header' => undef,
                                       'Line' => '379',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mpd',
                                                            'offset' => '0',
                                                            'type' => '18948'
                                                          },
                                                   '1' => {
                                                            'name' => 'mtd',
                                                            'offset' => '32',
                                                            'type' => '19032'
                                                          },
                                                   '2' => {
                                                            'name' => 'alloc',
                                                            'offset' => '40',
                                                            'type' => '11917'
                                                          },
                                                   '3' => {
                                                            'name' => 'free',
                                                            'offset' => '48',
                                                            'type' => '11949'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd_context',
                                                            'offset' => '56',
                                                            'type' => '219'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_parent_domain',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '18879' => {
                                       'BaseType' => '18794',
                                       'Name' => 'struct mlx5_parent_domain*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18885' => {
                                       'Header' => undef,
                                       'Line' => '366',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ibv_td',
                                                            'offset' => '0',
                                                            'type' => '5611'
                                                          },
                                                   '1' => {
                                                            'name' => 'bf',
                                                            'offset' => '8',
                                                            'type' => '18473'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcount',
                                                            'offset' => '16',
                                                            'type' => '14107'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_td',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '18948' => {
                                       'Header' => undef,
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ibv_pd',
                                                            'offset' => '0',
                                                            'type' => '5539'
                                                          },
                                                   '1' => {
                                                            'name' => 'pdn',
                                                            'offset' => '16',
                                                            'type' => '1554'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcount',
                                                            'offset' => '20',
                                                            'type' => '14107'
                                                          },
                                                   '3' => {
                                                            'name' => 'mprotection_domain',
                                                            'offset' => '24',
                                                            'type' => '19026'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_pd',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '19026' => {
                                       'BaseType' => '18948',
                                       'Name' => 'struct mlx5_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19032' => {
                                       'BaseType' => '18885',
                                       'Name' => 'struct mlx5_td*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19409' => {
                                       'BaseType' => '59',
                                       'Name' => 'unsigned int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19415' => {
                                       'Header' => undef,
                                       'Line' => '511',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dv_devx_uar',
                                                            'offset' => '0',
                                                            'type' => '15131'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '40',
                                                            'type' => '2369'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_devx_uar',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '1972' => {
                                      'Header' => undef,
                                      'Line' => '79',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '200269' => {
                                        'BaseType' => '48127',
                                        'Name' => 'struct mlx5dv_clock_info*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2039' => {
                                      'Header' => undef,
                                      'Line' => '90',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2094' => {
                                      'Header' => undef,
                                      'Line' => '133',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2131' => {
                                      'Header' => undef,
                                      'Line' => '139',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '314'
                                                         },
                                                  '1' => {
                                                           'name' => 'log_align_req',
                                                           'offset' => '8',
                                                           'type' => '1554'
                                                         },
                                                  '2' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '12',
                                                           'type' => '1554'
                                                         }
                                                },
                                      'Name' => 'struct ibv_alloc_dm_attr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2184' => {
                                      'Header' => undef,
                                      'Line' => '145',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2369'
                                                         },
                                                  '1' => {
                                                           'name' => 'memcpy_to_dm',
                                                           'offset' => '8',
                                                           'type' => '2411'
                                                         },
                                                  '2' => {
                                                           'name' => 'memcpy_from_dm',
                                                           'offset' => '16',
                                                           'type' => '2447'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '24',
                                                           'type' => '1554'
                                                         }
                                                },
                                      'Name' => 'struct ibv_dm',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '219' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2250' => {
                                      'Header' => undef,
                                      'Line' => '1952',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '10729'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '10889'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '264',
                                                           'type' => '128'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '268',
                                                           'type' => '128'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '272',
                                                           'type' => '128'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '280',
                                                           'type' => '825'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '320',
                                                           'type' => '219'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '225337' => {
                                        'BaseType' => '1530',
                                        'Name' => 'uint8_t[16]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '233' => {
                                     'BaseType' => '244',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '235201' => {
                                        'BaseType' => '1530',
                                        'Name' => 'uint8_t[6]',
                                        'Size' => '6',
                                        'Type' => 'Array'
                                      },
                          '2369' => {
                                      'BaseType' => '2250',
                                      'Name' => 'struct ibv_context*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '238814' => {
                                        'Header' => undef,
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_RX',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_TX',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_FDB',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_RX',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TX',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5_ib_uapi_flow_table_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '238863' => {
                                        'Header' => undef,
                                        'Line' => '50',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TUNNEL_TO_L2',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L2_TUNNEL',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L3_TUNNEL_TO_L2',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L3_TUNNEL',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5_ib_uapi_flow_action_packet_reformat_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '239398' => {
                                        'Header' => undef,
                                        'Line' => '332',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DEST_IBV_QP',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DROP',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_IBV_COUNTER',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_IBV_FLOW_ACTION',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_TAG',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DEST_DEVX',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DEFAULT_MISS',
                                                             'value' => '7'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5dv_flow_action_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '239466' => {
                                        'Header' => undef,
                                        'Line' => '345',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp',
                                                             'offset' => '0',
                                                             'type' => '4516'
                                                           },
                                                    '1' => {
                                                             'name' => 'counter',
                                                             'offset' => '0',
                                                             'type' => '10329'
                                                           },
                                                    '2' => {
                                                             'name' => 'action',
                                                             'offset' => '0',
                                                             'type' => '13070'
                                                           },
                                                    '3' => {
                                                             'name' => 'tag_value',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'name' => 'obj',
                                                             'offset' => '0',
                                                             'type' => '239626'
                                                           }
                                                  },
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '239541' => {
                                        'Header' => undef,
                                        'Line' => '673',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '2369'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           },
                                                    '2' => {
                                                             'name' => 'type',
                                                             'offset' => '12',
                                                             'type' => '247046'
                                                           },
                                                    '3' => {
                                                             'name' => 'object_id',
                                                             'offset' => '16',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'name' => 'rx_icm_addr',
                                                             'offset' => '24',
                                                             'type' => '1571'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_devx_obj',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '239626' => {
                                        'BaseType' => '239541',
                                        'Name' => 'struct mlx5dv_devx_obj*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '239632' => {
                                        'Header' => undef,
                                        'Line' => '343',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '239398'
                                                           },
                                                    '1' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '239466'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_flow_action_attr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '239973' => {
                                        'Header' => undef,
                                        'Line' => '1269',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'umem_id',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_devx_umem',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '240087' => {
                                        'Header' => undef,
                                        'Line' => '1435',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5DV_DR_DOMAIN_TYPE_NIC_RX',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5DV_DR_DOMAIN_TYPE_NIC_TX',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5DV_DR_DOMAIN_TYPE_FDB',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5dv_dr_domain_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '240125' => {
                                        'Header' => undef,
                                        'Line' => '1446',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next_table',
                                                             'offset' => '0',
                                                             'type' => '240349'
                                                           },
                                                    '1' => {
                                                             'name' => 'active',
                                                             'offset' => '8',
                                                             'type' => '1530'
                                                           },
                                                    '2' => {
                                                             'name' => 'reg_c_index',
                                                             'offset' => '9',
                                                             'type' => '1530'
                                                           },
                                                    '3' => {
                                                             'name' => 'flow_meter_parameter_sz',
                                                             'offset' => '16',
                                                             'type' => '314'
                                                           },
                                                    '4' => {
                                                             'name' => 'flow_meter_parameter',
                                                             'offset' => '24',
                                                             'type' => '219'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_flow_meter_attr',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '240210' => {
                                        'Header' => undef,
                                        'Line' => '652',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dmn',
                                                             'offset' => '0',
                                                             'type' => '251252'
                                                           },
                                                    '1' => {
                                                             'name' => 'rx',
                                                             'offset' => '8',
                                                             'type' => '251203'
                                                           },
                                                    '2' => {
                                                             'name' => 'tx',
                                                             'offset' => '24',
                                                             'type' => '251203'
                                                           },
                                                    '3' => {
                                                             'name' => 'level',
                                                             'offset' => '40',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'name' => 'table_type',
                                                             'offset' => '44',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'name' => 'matcher_list',
                                                             'offset' => '48',
                                                             'type' => '13862'
                                                           },
                                                    '6' => {
                                                             'name' => 'devx_obj',
                                                             'offset' => '64',
                                                             'type' => '239626'
                                                           },
                                                    '7' => {
                                                             'name' => 'refcount',
                                                             'offset' => '72',
                                                             'type' => '128'
                                                           },
                                                    '8' => {
                                                             'name' => 'tbl_list',
                                                             'offset' => '80',
                                                             'type' => '13816'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_table',
                                        'Size' => '96',
                                        'Type' => 'Struct'
                                      },
                          '240349' => {
                                        'BaseType' => '240210',
                                        'Name' => 'struct mlx5dv_dr_table*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '240381' => {
                                        'BaseType' => '1530',
                                        'Name' => 'uint8_t[64]',
                                        'Size' => '64',
                                        'Type' => 'Array'
                                      },
                          '2405' => {
                                      'BaseType' => '2184',
                                      'Name' => 'struct ibv_dm*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2411' => {
                                      'Name' => 'int(*)(struct ibv_dm*, uint64_t, void const*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2405'
                                                          },
                                                   '1' => {
                                                            'type' => '1571'
                                                          },
                                                   '2' => {
                                                            'type' => '1458'
                                                          },
                                                   '3' => {
                                                            'type' => '314'
                                                          }
                                                 },
                                      'Return' => '128',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '244' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '2447' => {
                                      'Name' => 'int(*)(void*, struct ibv_dm*, uint64_t, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'type' => '2405'
                                                          },
                                                   '2' => {
                                                            'type' => '1571'
                                                          },
                                                   '3' => {
                                                            'type' => '314'
                                                          }
                                                 },
                                      'Return' => '128',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2453' => {
                                      'Header' => undef,
                                      'Line' => '154',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fw_ver',
                                                           'offset' => '0',
                                                           'type' => '2987'
                                                         },
                                                  '1' => {
                                                           'name' => 'node_guid',
                                                           'offset' => '64',
                                                           'type' => '1643'
                                                         },
                                                  '10' => {
                                                            'name' => 'device_cap_flags',
                                                            'offset' => '116',
                                                            'type' => '59'
                                                          },
                                                  '11' => {
                                                            'name' => 'max_sge',
                                                            'offset' => '120',
                                                            'type' => '128'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_sge_rd',
                                                            'offset' => '124',
                                                            'type' => '128'
                                                          },
                                                  '13' => {
                                                            'name' => 'max_cq',
                                                            'offset' => '128',
                                                            'type' => '128'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_cqe',
                                                            'offset' => '132',
                                                            'type' => '128'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_mr',
                                                            'offset' => '136',
                                                            'type' => '128'
                                                          },
                                                  '16' => {
                                                            'name' => 'max_pd',
                                                            'offset' => '140',
                                                            'type' => '128'
                                                          },
                                                  '17' => {
                                                            'name' => 'max_qp_rd_atom',
                                                            'offset' => '144',
                                                            'type' => '128'
                                                          },
                                                  '18' => {
                                                            'name' => 'max_ee_rd_atom',
                                                            'offset' => '148',
                                                            'type' => '128'
                                                          },
                                                  '19' => {
                                                            'name' => 'max_res_rd_atom',
                                                            'offset' => '152',
                                                            'type' => '128'
                                                          },
                                                  '2' => {
                                                           'name' => 'sys_image_guid',
                                                           'offset' => '72',
                                                           'type' => '1643'
                                                         },
                                                  '20' => {
                                                            'name' => 'max_qp_init_rd_atom',
                                                            'offset' => '156',
                                                            'type' => '128'
                                                          },
                                                  '21' => {
                                                            'name' => 'max_ee_init_rd_atom',
                                                            'offset' => '160',
                                                            'type' => '128'
                                                          },
                                                  '22' => {
                                                            'name' => 'atomic_cap',
                                                            'offset' => '164',
                                                            'type' => '2094'
                                                          },
                                                  '23' => {
                                                            'name' => 'max_ee',
                                                            'offset' => '168',
                                                            'type' => '128'
                                                          },
                                                  '24' => {
                                                            'name' => 'max_rdd',
                                                            'offset' => '172',
                                                            'type' => '128'
                                                          },
                                                  '25' => {
                                                            'name' => 'max_mw',
                                                            'offset' => '176',
                                                            'type' => '128'
                                                          },
                                                  '26' => {
                                                            'name' => 'max_raw_ipv6_qp',
                                                            'offset' => '180',
                                                            'type' => '128'
                                                          },
                                                  '27' => {
                                                            'name' => 'max_raw_ethy_qp',
                                                            'offset' => '184',
                                                            'type' => '128'
                                                          },
                                                  '28' => {
                                                            'name' => 'max_mcast_grp',
                                                            'offset' => '188',
                                                            'type' => '128'
                                                          },
                                                  '29' => {
                                                            'name' => 'max_mcast_qp_attach',
                                                            'offset' => '192',
                                                            'type' => '128'
                                                          },
                                                  '3' => {
                                                           'name' => 'max_mr_size',
                                                           'offset' => '80',
                                                           'type' => '1571'
                                                         },
                                                  '30' => {
                                                            'name' => 'max_total_mcast_qp_attach',
                                                            'offset' => '196',
                                                            'type' => '128'
                                                          },
                                                  '31' => {
                                                            'name' => 'max_ah',
                                                            'offset' => '200',
                                                            'type' => '128'
                                                          },
                                                  '32' => {
                                                            'name' => 'max_fmr',
                                                            'offset' => '204',
                                                            'type' => '128'
                                                          },
                                                  '33' => {
                                                            'name' => 'max_map_per_fmr',
                                                            'offset' => '208',
                                                            'type' => '128'
                                                          },
                                                  '34' => {
                                                            'name' => 'max_srq',
                                                            'offset' => '212',
                                                            'type' => '128'
                                                          },
                                                  '35' => {
                                                            'name' => 'max_srq_wr',
                                                            'offset' => '216',
                                                            'type' => '128'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_srq_sge',
                                                            'offset' => '220',
                                                            'type' => '128'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_pkeys',
                                                            'offset' => '224',
                                                            'type' => '1542'
                                                          },
                                                  '38' => {
                                                            'name' => 'local_ca_ack_delay',
                                                            'offset' => '226',
                                                            'type' => '1530'
                                                          },
                                                  '39' => {
                                                            'name' => 'phys_port_cnt',
                                                            'offset' => '227',
                                                            'type' => '1530'
                                                          },
                                                  '4' => {
                                                           'name' => 'page_size_cap',
                                                           'offset' => '88',
                                                           'type' => '1571'
                                                         },
                                                  '5' => {
                                                           'name' => 'vendor_id',
                                                           'offset' => '96',
                                                           'type' => '1554'
                                                         },
                                                  '6' => {
                                                           'name' => 'vendor_part_id',
                                                           'offset' => '100',
                                                           'type' => '1554'
                                                         },
                                                  '7' => {
                                                           'name' => 'hw_ver',
                                                           'offset' => '104',
                                                           'type' => '1554'
                                                         },
                                                  '8' => {
                                                           'name' => 'max_qp',
                                                           'offset' => '108',
                                                           'type' => '128'
                                                         },
                                                  '9' => {
                                                           'name' => 'max_qp_wr',
                                                           'offset' => '112',
                                                           'type' => '128'
                                                         }
                                                },
                                      'Name' => 'struct ibv_device_attr',
                                      'Size' => '232',
                                      'Type' => 'Struct'
                                    },
                          '247003' => {
                                        'Header' => undef,
                                        'Line' => '659',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '2369'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_flow_matcher',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '247046' => {
                                        'Header' => undef,
                                        'Line' => '664',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5_DEVX_FLOW_TABLE',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5_DEVX_FLOW_COUNTER',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5_DEVX_FLOW_METER',
                                                             'value' => '3'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5_DEVX_QP',
                                                             'value' => '4'
                                                           },
                                                    '4' => {
                                                             'name' => 'MLX5_DEVX_PKT_REFORMAT_CTX',
                                                             'value' => '5'
                                                           },
                                                    '5' => {
                                                             'name' => 'MLX5_DEVX_TIR',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5_devx_obj_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '247171' => {
                                        'Header' => undef,
                                        'Line' => '55',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'DR_CHUNK_SIZE_1',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'DR_CHUNK_SIZE_MIN',
                                                             'value' => '0'
                                                           },
                                                    '10' => {
                                                              'name' => 'DR_CHUNK_SIZE_512',
                                                              'value' => '9'
                                                            },
                                                    '11' => {
                                                              'name' => 'DR_CHUNK_SIZE_1K',
                                                              'value' => '10'
                                                            },
                                                    '12' => {
                                                              'name' => 'DR_CHUNK_SIZE_2K',
                                                              'value' => '11'
                                                            },
                                                    '13' => {
                                                              'name' => 'DR_CHUNK_SIZE_4K',
                                                              'value' => '12'
                                                            },
                                                    '14' => {
                                                              'name' => 'DR_CHUNK_SIZE_8K',
                                                              'value' => '13'
                                                            },
                                                    '15' => {
                                                              'name' => 'DR_CHUNK_SIZE_16K',
                                                              'value' => '14'
                                                            },
                                                    '16' => {
                                                              'name' => 'DR_CHUNK_SIZE_32K',
                                                              'value' => '15'
                                                            },
                                                    '17' => {
                                                              'name' => 'DR_CHUNK_SIZE_64K',
                                                              'value' => '16'
                                                            },
                                                    '18' => {
                                                              'name' => 'DR_CHUNK_SIZE_128K',
                                                              'value' => '17'
                                                            },
                                                    '19' => {
                                                              'name' => 'DR_CHUNK_SIZE_256K',
                                                              'value' => '18'
                                                            },
                                                    '2' => {
                                                             'name' => 'DR_CHUNK_SIZE_2',
                                                             'value' => '1'
                                                           },
                                                    '20' => {
                                                              'name' => 'DR_CHUNK_SIZE_512K',
                                                              'value' => '19'
                                                            },
                                                    '21' => {
                                                              'name' => 'DR_CHUNK_SIZE_1024K',
                                                              'value' => '20'
                                                            },
                                                    '22' => {
                                                              'name' => 'DR_CHUNK_SIZE_2048K',
                                                              'value' => '21'
                                                            },
                                                    '23' => {
                                                              'name' => 'DR_CHUNK_SIZE_MAX',
                                                              'value' => '22'
                                                            },
                                                    '3' => {
                                                             'name' => 'DR_CHUNK_SIZE_4',
                                                             'value' => '2'
                                                           },
                                                    '4' => {
                                                             'name' => 'DR_CHUNK_SIZE_8',
                                                             'value' => '3'
                                                           },
                                                    '5' => {
                                                             'name' => 'DR_CHUNK_SIZE_16',
                                                             'value' => '4'
                                                           },
                                                    '6' => {
                                                             'name' => 'DR_CHUNK_SIZE_32',
                                                             'value' => '5'
                                                           },
                                                    '7' => {
                                                             'name' => 'DR_CHUNK_SIZE_64',
                                                             'value' => '6'
                                                           },
                                                    '8' => {
                                                             'name' => 'DR_CHUNK_SIZE_128',
                                                             'value' => '7'
                                                           },
                                                    '9' => {
                                                             'name' => 'DR_CHUNK_SIZE_256',
                                                             'value' => '8'
                                                           }
                                                  },
                                        'Name' => 'enum dr_icm_chunk_size',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '247599' => {
                                        'Header' => undef,
                                        'Line' => '141',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'DR_STE_TYPE_TX',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'DR_STE_TYPE_RX',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'DR_STE_TYPE_MODIFY_PKT',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum dr_ste_entry_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '247696' => {
                                        'Header' => undef,
                                        'Line' => '172',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'DR_ACTION_TYP_TNL_L2_TO_L2',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'DR_ACTION_TYP_L2_TO_TNL_L2',
                                                             'value' => '1'
                                                           },
                                                    '10' => {
                                                              'name' => 'DR_ACTION_TYP_VPORT',
                                                              'value' => '10'
                                                            },
                                                    '11' => {
                                                              'name' => 'DR_ACTION_TYP_METER',
                                                              'value' => '11'
                                                            },
                                                    '12' => {
                                                              'name' => 'DR_ACTION_TYP_MISS',
                                                              'value' => '12'
                                                            },
                                                    '13' => {
                                                              'name' => 'DR_ACTION_TYP_MAX',
                                                              'value' => '13'
                                                            },
                                                    '2' => {
                                                             'name' => 'DR_ACTION_TYP_TNL_L3_TO_L2',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'DR_ACTION_TYP_L2_TO_TNL_L3',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'DR_ACTION_TYP_DROP',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'DR_ACTION_TYP_QP',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'DR_ACTION_TYP_FT',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'DR_ACTION_TYP_CTR',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'DR_ACTION_TYP_TAG',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'DR_ACTION_TYP_MODIFY_HDR',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum dr_action_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '247799' => {
                                        'Header' => undef,
                                        'Line' => '211',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hw_ste',
                                                             'offset' => '0',
                                                             'type' => '6748'
                                                           },
                                                    '1' => {
                                                             'name' => 'refcount',
                                                             'offset' => '8',
                                                             'type' => '14107'
                                                           },
                                                    '2' => {
                                                             'name' => 'miss_list_node',
                                                             'offset' => '16',
                                                             'type' => '13816'
                                                           },
                                                    '3' => {
                                                             'name' => 'rule_list',
                                                             'offset' => '32',
                                                             'type' => '13862'
                                                           },
                                                    '4' => {
                                                             'name' => 'htbl',
                                                             'offset' => '48',
                                                             'type' => '248056'
                                                           },
                                                    '5' => {
                                                             'name' => 'next_htbl',
                                                             'offset' => '56',
                                                             'type' => '248056'
                                                           },
                                                    '6' => {
                                                             'name' => 'ste_chain_location',
                                                             'offset' => '64',
                                                             'type' => '1530'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '247911' => {
                                        'Header' => undef,
                                        'Line' => '243',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lu_type',
                                                             'offset' => '0',
                                                             'type' => '1530'
                                                           },
                                                    '1' => {
                                                             'name' => 'byte_mask',
                                                             'offset' => '2',
                                                             'type' => '1542'
                                                           },
                                                    '2' => {
                                                             'name' => 'refcount',
                                                             'offset' => '4',
                                                             'type' => '14107'
                                                           },
                                                    '3' => {
                                                             'name' => 'chunk',
                                                             'offset' => '8',
                                                             'type' => '248304'
                                                           },
                                                    '4' => {
                                                             'name' => 'ste_arr',
                                                             'offset' => '16',
                                                             'type' => '248310'
                                                           },
                                                    '5' => {
                                                             'name' => 'hw_ste_arr',
                                                             'offset' => '24',
                                                             'type' => '6748'
                                                           },
                                                    '6' => {
                                                             'name' => 'miss_list',
                                                             'offset' => '32',
                                                             'type' => '28302'
                                                           },
                                                    '7' => {
                                                             'name' => 'chunk_size',
                                                             'offset' => '40',
                                                             'type' => '247171'
                                                           },
                                                    '8' => {
                                                             'name' => 'pointing_ste',
                                                             'offset' => '48',
                                                             'type' => '248310'
                                                           },
                                                    '9' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '56',
                                                             'type' => '248062'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_htbl',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '248056' => {
                                        'BaseType' => '247911',
                                        'Name' => 'struct dr_ste_htbl*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248062' => {
                                        'Header' => undef,
                                        'Line' => '231',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'num_of_valid_entries',
                                                             'offset' => '0',
                                                             'type' => '128'
                                                           },
                                                    '1' => {
                                                             'name' => 'num_of_collisions',
                                                             'offset' => '4',
                                                             'type' => '128'
                                                           },
                                                    '2' => {
                                                             'name' => 'increase_threshold',
                                                             'offset' => '8',
                                                             'type' => '128'
                                                           },
                                                    '3' => {
                                                             'name' => 'may_grow',
                                                             'offset' => '12',
                                                             'type' => '1523'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_htbl_ctrl',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '248135' => {
                                        'Header' => undef,
                                        'Line' => '792',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'buddy_mem',
                                                             'offset' => '0',
                                                             'type' => '252423'
                                                           },
                                                    '1' => {
                                                             'name' => 'chunk_list',
                                                             'offset' => '8',
                                                             'type' => '13816'
                                                           },
                                                    '10' => {
                                                              'name' => 'miss_list',
                                                              'offset' => '80',
                                                              'type' => '28302'
                                                            },
                                                    '2' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '1554'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_of_entries',
                                                             'offset' => '28',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'name' => 'byte_size',
                                                             'offset' => '32',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'name' => 'icm_addr',
                                                             'offset' => '40',
                                                             'type' => '1571'
                                                           },
                                                    '6' => {
                                                             'name' => 'mr_addr',
                                                             'offset' => '48',
                                                             'type' => '1571'
                                                           },
                                                    '7' => {
                                                             'name' => 'seg',
                                                             'offset' => '56',
                                                             'type' => '1554'
                                                           },
                                                    '8' => {
                                                             'name' => 'ste_arr',
                                                             'offset' => '64',
                                                             'type' => '248310'
                                                           },
                                                    '9' => {
                                                             'name' => 'hw_ste_arr',
                                                             'offset' => '72',
                                                             'type' => '6748'
                                                           }
                                                  },
                                        'Name' => 'struct dr_icm_chunk',
                                        'Size' => '88',
                                        'Type' => 'Struct'
                                      },
                          '248304' => {
                                        'BaseType' => '248135',
                                        'Name' => 'struct dr_icm_chunk*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248310' => {
                                        'BaseType' => '247799',
                                        'Name' => 'struct dr_ste*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248322' => {
                                        'Header' => undef,
                                        'Line' => '274',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'inner',
                                                             'offset' => '0',
                                                             'type' => '1523'
                                                           },
                                                    '1' => {
                                                             'name' => 'rx',
                                                             'offset' => '1',
                                                             'type' => '1523'
                                                           },
                                                    '2' => {
                                                             'name' => 'caps',
                                                             'offset' => '8',
                                                             'type' => '248743'
                                                           },
                                                    '3' => {
                                                             'name' => 'lu_type',
                                                             'offset' => '16',
                                                             'type' => '1530'
                                                           },
                                                    '4' => {
                                                             'name' => 'byte_mask',
                                                             'offset' => '18',
                                                             'type' => '1542'
                                                           },
                                                    '5' => {
                                                             'name' => 'bit_mask',
                                                             'offset' => '20',
                                                             'type' => '225337'
                                                           },
                                                    '6' => {
                                                             'name' => 'ste_build_tag_func',
                                                             'offset' => '40',
                                                             'type' => '248872'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_build',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '248434' => {
                                        'Header' => undef,
                                        'Line' => '586',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'gvmi',
                                                             'offset' => '0',
                                                             'type' => '1542'
                                                           },
                                                    '1' => {
                                                             'name' => 'nic_rx_drop_address',
                                                             'offset' => '8',
                                                             'type' => '1571'
                                                           },
                                                    '10' => {
                                                              'name' => 'flex_parser_id_icmp_dw1',
                                                              'offset' => '69',
                                                              'type' => '1530'
                                                            },
                                                    '11' => {
                                                              'name' => 'flex_parser_id_icmpv6_dw0',
                                                              'offset' => '70',
                                                              'type' => '1530'
                                                            },
                                                    '12' => {
                                                              'name' => 'flex_parser_id_icmpv6_dw1',
                                                              'offset' => '71',
                                                              'type' => '1530'
                                                            },
                                                    '13' => {
                                                              'name' => 'max_ft_level',
                                                              'offset' => '72',
                                                              'type' => '1530'
                                                            },
                                                    '14' => {
                                                              'name' => 'eswitch_manager',
                                                              'offset' => '73',
                                                              'type' => '1523'
                                                            },
                                                    '15' => {
                                                              'name' => 'rx_sw_owner',
                                                              'offset' => '74',
                                                              'type' => '1523'
                                                            },
                                                    '16' => {
                                                              'name' => 'tx_sw_owner',
                                                              'offset' => '75',
                                                              'type' => '1523'
                                                            },
                                                    '17' => {
                                                              'name' => 'fdb_sw_owner',
                                                              'offset' => '76',
                                                              'type' => '1523'
                                                            },
                                                    '18' => {
                                                              'name' => 'num_vports',
                                                              'offset' => '80',
                                                              'type' => '1554'
                                                            },
                                                    '19' => {
                                                              'name' => 'vports_caps',
                                                              'offset' => '88',
                                                              'type' => '250609'
                                                            },
                                                    '2' => {
                                                             'name' => 'nic_tx_drop_address',
                                                             'offset' => '16',
                                                             'type' => '1571'
                                                           },
                                                    '20' => {
                                                              'name' => 'roce_caps',
                                                              'offset' => '96',
                                                              'type' => '250580'
                                                            },
                                                    '3' => {
                                                             'name' => 'nic_tx_allow_address',
                                                             'offset' => '24',
                                                             'type' => '1571'
                                                           },
                                                    '4' => {
                                                             'name' => 'esw_rx_drop_address',
                                                             'offset' => '32',
                                                             'type' => '1571'
                                                           },
                                                    '5' => {
                                                             'name' => 'esw_tx_drop_address',
                                                             'offset' => '40',
                                                             'type' => '1571'
                                                           },
                                                    '6' => {
                                                             'name' => 'log_icm_size',
                                                             'offset' => '48',
                                                             'type' => '1554'
                                                           },
                                                    '7' => {
                                                             'name' => 'hdr_modify_icm_addr',
                                                             'offset' => '56',
                                                             'type' => '1571'
                                                           },
                                                    '8' => {
                                                             'name' => 'flex_protocols',
                                                             'offset' => '64',
                                                             'type' => '1554'
                                                           },
                                                    '9' => {
                                                             'name' => 'flex_parser_id_icmp_dw0',
                                                             'offset' => '68',
                                                             'type' => '1530'
                                                           }
                                                  },
                                        'Name' => 'struct dr_devx_caps',
                                        'Size' => '104',
                                        'Type' => 'Struct'
                                      },
                          '248743' => {
                                        'BaseType' => '248434',
                                        'Name' => 'struct dr_devx_caps*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248774' => {
                                        'BaseType' => '248780',
                                        'Name' => 'struct dr_match_param*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248780' => {
                                        'Header' => undef,
                                        'Line' => '556',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'outer',
                                                             'offset' => '0',
                                                             'type' => '248878'
                                                           },
                                                    '1' => {
                                                             'name' => 'misc',
                                                             'offset' => '64',
                                                             'type' => '249356'
                                                           },
                                                    '2' => {
                                                             'name' => 'inner',
                                                             'offset' => '108',
                                                             'type' => '248878'
                                                           },
                                                    '3' => {
                                                             'name' => 'misc2',
                                                             'offset' => '172',
                                                             'type' => '249830'
                                                           },
                                                    '4' => {
                                                             'name' => 'misc3',
                                                             'offset' => '228',
                                                             'type' => '250257'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_param',
                                        'Size' => '272',
                                        'Type' => 'Struct'
                                      },
                          '248866' => {
                                        'BaseType' => '248322',
                                        'Name' => 'struct dr_ste_build*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248872' => {
                                        'Name' => 'int(*)(struct dr_match_param*, struct dr_ste_build*, uint8_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '248774'
                                                            },
                                                     '1' => {
                                                              'type' => '248866'
                                                            },
                                                     '2' => {
                                                              'type' => '6748'
                                                            }
                                                   },
                                        'Return' => '128',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '248878' => {
                                        'Header' => undef,
                                        'Line' => '446',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'smac_47_16',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '16',
                                                             'name' => 'ethertype',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '1',
                                                              'name' => 'frag',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '1',
                                                              'name' => 'svlan_tag',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '1',
                                                              'name' => 'cvlan_tag',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '2',
                                                              'name' => 'ip_ecn',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '6',
                                                              'name' => 'ip_dscp',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '8',
                                                              'name' => 'ip_protocol',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '16' => {
                                                              'bitfield' => '16',
                                                              'name' => 'tcp_dport',
                                                              'offset' => '20',
                                                              'type' => '1554'
                                                            },
                                                    '17' => {
                                                              'bitfield' => '16',
                                                              'name' => 'tcp_sport',
                                                              'offset' => '20',
                                                              'type' => '1554'
                                                            },
                                                    '18' => {
                                                              'bitfield' => '8',
                                                              'name' => 'ip_ttl_hoplimit',
                                                              'offset' => '24',
                                                              'type' => '1554'
                                                            },
                                                    '19' => {
                                                              'bitfield' => '16',
                                                              'name' => 'udp_dport',
                                                              'offset' => '24',
                                                              'type' => '1554'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '16',
                                                             'name' => 'smac_15_0',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '20' => {
                                                              'bitfield' => '16',
                                                              'name' => 'udp_sport',
                                                              'offset' => '28',
                                                              'type' => '1554'
                                                            },
                                                    '21' => {
                                                              'name' => 'src_ip_127_96',
                                                              'offset' => '32',
                                                              'type' => '1554'
                                                            },
                                                    '22' => {
                                                              'name' => 'src_ip_95_64',
                                                              'offset' => '36',
                                                              'type' => '1554'
                                                            },
                                                    '23' => {
                                                              'name' => 'src_ip_63_32',
                                                              'offset' => '40',
                                                              'type' => '1554'
                                                            },
                                                    '24' => {
                                                              'name' => 'src_ip_31_0',
                                                              'offset' => '44',
                                                              'type' => '1554'
                                                            },
                                                    '25' => {
                                                              'name' => 'dst_ip_127_96',
                                                              'offset' => '48',
                                                              'type' => '1554'
                                                            },
                                                    '26' => {
                                                              'name' => 'dst_ip_95_64',
                                                              'offset' => '52',
                                                              'type' => '1554'
                                                            },
                                                    '27' => {
                                                              'name' => 'dst_ip_63_32',
                                                              'offset' => '56',
                                                              'type' => '1554'
                                                            },
                                                    '28' => {
                                                              'name' => 'dst_ip_31_0',
                                                              'offset' => '60',
                                                              'type' => '1554'
                                                            },
                                                    '3' => {
                                                             'name' => 'dmac_47_16',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '12',
                                                             'name' => 'first_vid',
                                                             'offset' => '12',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'first_cfi',
                                                             'offset' => '12',
                                                             'type' => '1554'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '3',
                                                             'name' => 'first_prio',
                                                             'offset' => '12',
                                                             'type' => '1554'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '16',
                                                             'name' => 'dmac_15_0',
                                                             'offset' => '12',
                                                             'type' => '1554'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '9',
                                                             'name' => 'tcp_flags',
                                                             'offset' => '16',
                                                             'type' => '1554'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '4',
                                                             'name' => 'ip_version',
                                                             'offset' => '16',
                                                             'type' => '1554'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_spec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '249356' => {
                                        'Header' => undef,
                                        'Line' => '478',
                                        'Memb' => {
                                                    '0' => {
                                                             'bitfield' => '24',
                                                             'name' => 'source_sqn',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '4',
                                                             'name' => 'source_vhca_port',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_second_cfi',
                                                              'offset' => '8',
                                                              'type' => '1554'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '3',
                                                              'name' => 'outer_second_prio',
                                                              'offset' => '8',
                                                              'type' => '1554'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '16',
                                                              'name' => 'gre_protocol',
                                                              'offset' => '8',
                                                              'type' => '1554'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '1',
                                                              'name' => 'inner_second_svlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_second_svlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '1',
                                                              'name' => 'inner_second_cvlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '16' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_second_cvlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '17' => {
                                                              'bitfield' => '8',
                                                              'name' => 'gre_key_l',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '18' => {
                                                              'bitfield' => '24',
                                                              'name' => 'gre_key_h',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '19' => {
                                                              'bitfield' => '24',
                                                              'name' => 'vxlan_vni',
                                                              'offset' => '20',
                                                              'type' => '1554'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '1',
                                                             'name' => 'gre_s_present',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '20' => {
                                                              'bitfield' => '1',
                                                              'name' => 'geneve_oam',
                                                              'offset' => '20',
                                                              'type' => '1554'
                                                            },
                                                    '21' => {
                                                              'bitfield' => '24',
                                                              'name' => 'geneve_vni',
                                                              'offset' => '24',
                                                              'type' => '1554'
                                                            },
                                                    '22' => {
                                                              'bitfield' => '20',
                                                              'name' => 'outer_ipv6_flow_label',
                                                              'offset' => '28',
                                                              'type' => '1554'
                                                            },
                                                    '23' => {
                                                              'bitfield' => '20',
                                                              'name' => 'inner_ipv6_flow_label',
                                                              'offset' => '32',
                                                              'type' => '1554'
                                                            },
                                                    '24' => {
                                                              'bitfield' => '16',
                                                              'name' => 'geneve_protocol_type',
                                                              'offset' => '36',
                                                              'type' => '1554'
                                                            },
                                                    '25' => {
                                                              'bitfield' => '6',
                                                              'name' => 'geneve_opt_len',
                                                              'offset' => '36',
                                                              'type' => '1554'
                                                            },
                                                    '26' => {
                                                              'bitfield' => '24',
                                                              'name' => 'bth_dst_qp',
                                                              'offset' => '40',
                                                              'type' => '1554'
                                                            },
                                                    '3' => {
                                                             'bitfield' => '1',
                                                             'name' => 'gre_k_present',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '1',
                                                             'name' => 'gre_c_present',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '16',
                                                             'name' => 'source_port',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '12',
                                                             'name' => 'inner_second_vid',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '1',
                                                             'name' => 'inner_second_cfi',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '3',
                                                             'name' => 'inner_second_prio',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '12',
                                                             'name' => 'outer_second_vid',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_misc',
                                        'Size' => '44',
                                        'Type' => 'Struct'
                                      },
                          '249830' => {
                                        'Header' => undef,
                                        'Line' => '508',
                                        'Memb' => {
                                                    '0' => {
                                                             'bitfield' => '8',
                                                             'name' => 'outer_first_mpls_ttl',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '1',
                                                             'name' => 'outer_first_mpls_s_bos',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '3',
                                                              'name' => 'outer_first_mpls_over_gre_exp',
                                                              'offset' => '8',
                                                              'type' => '1554'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '20',
                                                              'name' => 'outer_first_mpls_over_gre_label',
                                                              'offset' => '8',
                                                              'type' => '1554'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '8',
                                                              'name' => 'outer_first_mpls_over_udp_ttl',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_first_mpls_over_udp_s_bos',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '3',
                                                              'name' => 'outer_first_mpls_over_udp_exp',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '20',
                                                              'name' => 'outer_first_mpls_over_udp_label',
                                                              'offset' => '12',
                                                              'type' => '1554'
                                                            },
                                                    '16' => {
                                                              'name' => 'metadata_reg_c_7',
                                                              'offset' => '16',
                                                              'type' => '1554'
                                                            },
                                                    '17' => {
                                                              'name' => 'metadata_reg_c_6',
                                                              'offset' => '20',
                                                              'type' => '1554'
                                                            },
                                                    '18' => {
                                                              'name' => 'metadata_reg_c_5',
                                                              'offset' => '24',
                                                              'type' => '1554'
                                                            },
                                                    '19' => {
                                                              'name' => 'metadata_reg_c_4',
                                                              'offset' => '28',
                                                              'type' => '1554'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '3',
                                                             'name' => 'outer_first_mpls_exp',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '20' => {
                                                              'name' => 'metadata_reg_c_3',
                                                              'offset' => '32',
                                                              'type' => '1554'
                                                            },
                                                    '21' => {
                                                              'name' => 'metadata_reg_c_2',
                                                              'offset' => '36',
                                                              'type' => '1554'
                                                            },
                                                    '22' => {
                                                              'name' => 'metadata_reg_c_1',
                                                              'offset' => '40',
                                                              'type' => '1554'
                                                            },
                                                    '23' => {
                                                              'name' => 'metadata_reg_c_0',
                                                              'offset' => '44',
                                                              'type' => '1554'
                                                            },
                                                    '24' => {
                                                              'name' => 'metadata_reg_a',
                                                              'offset' => '48',
                                                              'type' => '1554'
                                                            },
                                                    '25' => {
                                                              'name' => 'metadata_reg_b',
                                                              'offset' => '52',
                                                              'type' => '1554'
                                                            },
                                                    '3' => {
                                                             'bitfield' => '20',
                                                             'name' => 'outer_first_mpls_label',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '8',
                                                             'name' => 'inner_first_mpls_ttl',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'inner_first_mpls_s_bos',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '3',
                                                             'name' => 'inner_first_mpls_exp',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '20',
                                                             'name' => 'inner_first_mpls_label',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '8',
                                                             'name' => 'outer_first_mpls_over_gre_ttl',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '1',
                                                             'name' => 'outer_first_mpls_over_gre_s_bos',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_misc2',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '250257' => {
                                        'Header' => undef,
                                        'Line' => '537',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'inner_tcp_seq_num',
                                                             'offset' => '0',
                                                             'type' => '1554'
                                                           },
                                                    '1' => {
                                                             'name' => 'outer_tcp_seq_num',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '8',
                                                              'name' => 'icmpv6_type',
                                                              'offset' => '32',
                                                              'type' => '1554'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '8',
                                                              'name' => 'icmpv4_code',
                                                              'offset' => '32',
                                                              'type' => '1554'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '8',
                                                              'name' => 'icmpv4_type',
                                                              'offset' => '32',
                                                              'type' => '1554'
                                                            },
                                                    '13' => {
                                                              'name' => 'gtpu_teid',
                                                              'offset' => '36',
                                                              'type' => '1554'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '8',
                                                              'name' => 'gtpu_msg_type',
                                                              'offset' => '40',
                                                              'type' => '1554'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '3',
                                                              'name' => 'gtpu_flags',
                                                              'offset' => '40',
                                                              'type' => '1554'
                                                            },
                                                    '2' => {
                                                             'name' => 'inner_tcp_ack_num',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           },
                                                    '3' => {
                                                             'name' => 'outer_tcp_ack_num',
                                                             'offset' => '12',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '24',
                                                             'name' => 'outer_vxlan_gpe_vni',
                                                             'offset' => '16',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '8',
                                                             'name' => 'outer_vxlan_gpe_flags',
                                                             'offset' => '16',
                                                             'type' => '1554'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '8',
                                                             'name' => 'outer_vxlan_gpe_next_protocol',
                                                             'offset' => '20',
                                                             'type' => '1554'
                                                           },
                                                    '7' => {
                                                             'name' => 'icmpv4_header_data',
                                                             'offset' => '24',
                                                             'type' => '1554'
                                                           },
                                                    '8' => {
                                                             'name' => 'icmpv6_header_data',
                                                             'offset' => '28',
                                                             'type' => '1554'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '8',
                                                             'name' => 'icmpv6_code',
                                                             'offset' => '32',
                                                             'type' => '1554'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_misc3',
                                        'Size' => '44',
                                        'Type' => 'Struct'
                                      },
                          '250523' => {
                                        'Header' => undef,
                                        'Line' => '576',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'gvmi',
                                                             'offset' => '0',
                                                             'type' => '1542'
                                                           },
                                                    '1' => {
                                                             'name' => 'icm_address_rx',
                                                             'offset' => '8',
                                                             'type' => '1571'
                                                           },
                                                    '2' => {
                                                             'name' => 'icm_address_tx',
                                                             'offset' => '16',
                                                             'type' => '1571'
                                                           }
                                                  },
                                        'Name' => 'struct dr_devx_vport_cap',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '250580' => {
                                        'Header' => undef,
                                        'Line' => '582',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fl_rc_qp_when_roce_enabled',
                                                             'offset' => '0',
                                                             'type' => '1523'
                                                           }
                                                  },
                                        'Name' => 'struct dr_devx_roce_cap',
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '250609' => {
                                        'BaseType' => '250523',
                                        'Name' => 'struct dr_devx_vport_cap*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '250615' => {
                                        'Header' => undef,
                                        'Line' => '610',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'drop_icm_addr',
                                                             'offset' => '0',
                                                             'type' => '1571'
                                                           },
                                                    '1' => {
                                                             'name' => 'default_icm_addr',
                                                             'offset' => '8',
                                                             'type' => '1571'
                                                           },
                                                    '2' => {
                                                             'name' => 'ste_type',
                                                             'offset' => '16',
                                                             'type' => '247599'
                                                           }
                                                  },
                                        'Name' => 'struct dr_domain_rx_tx',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '250672' => {
                                        'Header' => undef,
                                        'Line' => '616',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'supp_sw_steering',
                                                             'offset' => '0',
                                                             'type' => '1523'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_inline_size',
                                                             'offset' => '4',
                                                             'type' => '1554'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_send_wr',
                                                             'offset' => '8',
                                                             'type' => '1554'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_log_sw_icm_sz',
                                                             'offset' => '12',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'name' => 'max_log_action_icm_sz',
                                                             'offset' => '16',
                                                             'type' => '1554'
                                                           },
                                                    '5' => {
                                                             'name' => 'rx',
                                                             'offset' => '24',
                                                             'type' => '250615'
                                                           },
                                                    '6' => {
                                                             'name' => 'tx',
                                                             'offset' => '48',
                                                             'type' => '250615'
                                                           },
                                                    '7' => {
                                                             'name' => 'attr',
                                                             'offset' => '72',
                                                             'type' => '2453'
                                                           },
                                                    '8' => {
                                                             'name' => 'caps',
                                                             'offset' => '304',
                                                             'type' => '248434'
                                                           }
                                                  },
                                        'Name' => 'struct dr_domain_info',
                                        'Size' => '408',
                                        'Type' => 'Struct'
                                      },
                          '250813' => {
                                        'Header' => undef,
                                        'Line' => '632',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ctx',
                                                             'offset' => '0',
                                                             'type' => '2369'
                                                           },
                                                    '1' => {
                                                             'name' => 'pd',
                                                             'offset' => '8',
                                                             'type' => '5725'
                                                           },
                                                    '10' => {
                                                              'name' => 'tbl_list',
                                                              'offset' => '504',
                                                              'type' => '13862'
                                                            },
                                                    '11' => {
                                                              'name' => 'flags',
                                                              'offset' => '520',
                                                              'type' => '1554'
                                                            },
                                                    '2' => {
                                                             'name' => 'uar',
                                                             'offset' => '16',
                                                             'type' => '250998'
                                                           },
                                                    '3' => {
                                                             'name' => 'type',
                                                             'offset' => '24',
                                                             'type' => '240087'
                                                           },
                                                    '4' => {
                                                             'name' => 'refcount',
                                                             'offset' => '28',
                                                             'type' => '128'
                                                           },
                                                    '5' => {
                                                             'name' => 'mutex',
                                                             'offset' => '32',
                                                             'type' => '225232'
                                                           },
                                                    '6' => {
                                                             'name' => 'ste_icm_pool',
                                                             'offset' => '72',
                                                             'type' => '251009'
                                                           },
                                                    '7' => {
                                                             'name' => 'action_icm_pool',
                                                             'offset' => '80',
                                                             'type' => '251009'
                                                           },
                                                    '8' => {
                                                             'name' => 'send_ring',
                                                             'offset' => '88',
                                                             'type' => '251197'
                                                           },
                                                    '9' => {
                                                             'name' => 'info',
                                                             'offset' => '96',
                                                             'type' => '250672'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_domain',
                                        'Size' => '528',
                                        'Type' => 'Struct'
                                      },
                          '250998' => {
                                        'BaseType' => '15131',
                                        'Name' => 'struct mlx5dv_devx_uar*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251004' => {
                                        'Header' => undef,
                                        'Line' => '38',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'icm_type',
                                                             'offset' => '0',
                                                             'type' => '376748'
                                                           },
                                                    '1' => {
                                                             'name' => 'dmn',
                                                             'offset' => '8',
                                                             'type' => '251252'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_log_chunk_sz',
                                                             'offset' => '16',
                                                             'type' => '247171'
                                                           },
                                                    '3' => {
                                                             'name' => 'mutex',
                                                             'offset' => '24',
                                                             'type' => '357557'
                                                           },
                                                    '4' => {
                                                             'name' => 'buddy_mem_list',
                                                             'offset' => '64',
                                                             'type' => '13862'
                                                           },
                                                    '5' => {
                                                             'name' => 'hot_memory_size',
                                                             'offset' => '80',
                                                             'type' => '1571'
                                                           }
                                                  },
                                        'Name' => 'struct dr_icm_pool',
                                        'Size' => '88',
                                        'Type' => 'Struct'
                                      },
                          '251009' => {
                                        'BaseType' => '251004',
                                        'Name' => 'struct dr_icm_pool*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251015' => {
                                        'Header' => undef,
                                        'Line' => '1010',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cq',
                                                             'offset' => '0',
                                                             'type' => '252756'
                                                           },
                                                    '1' => {
                                                             'name' => 'qp',
                                                             'offset' => '48',
                                                             'type' => '252881'
                                                           },
                                                    '10' => {
                                                              'name' => 'sync_buff',
                                                              'offset' => '3168',
                                                              'type' => '240381'
                                                            },
                                                    '11' => {
                                                              'name' => 'sync_mr',
                                                              'offset' => '3232',
                                                              'type' => '5533'
                                                            },
                                                    '2' => {
                                                             'name' => 'mr',
                                                             'offset' => '56',
                                                             'type' => '5533'
                                                           },
                                                    '3' => {
                                                             'name' => 'pending_wqe',
                                                             'offset' => '64',
                                                             'type' => '1554'
                                                           },
                                                    '4' => {
                                                             'name' => 'signal_th',
                                                             'offset' => '68',
                                                             'type' => '1542'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_post_send_size',
                                                             'offset' => '72',
                                                             'type' => '1554'
                                                           },
                                                    '6' => {
                                                             'name' => 'tx_head',
                                                             'offset' => '76',
                                                             'type' => '1554'
                                                           },
                                                    '7' => {
                                                             'name' => 'buf',
                                                             'offset' => '80',
                                                             'type' => '219'
                                                           },
                                                    '8' => {
                                                             'name' => 'buf_size',
                                                             'offset' => '88',
                                                             'type' => '1554'
                                                           },
                                                    '9' => {
                                                             'name' => 'wc',
                                                             'offset' => '96',
                                                             'type' => '252887'
                                                           }
                                                  },
                                        'Name' => 'struct dr_send_ring',
                                        'Size' => '3240',
                                        'Type' => 'Struct'
                                      },
                          '251197' => {
                                        'BaseType' => '251015',
                                        'Name' => 'struct dr_send_ring*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251203' => {
                                        'Header' => undef,
                                        'Line' => '647',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 's_anchor',
                                                             'offset' => '0',
                                                             'type' => '248056'
                                                           },
                                                    '1' => {
                                                             'name' => 'nic_dmn',
                                                             'offset' => '8',
                                                             'type' => '251246'
                                                           }
                                                  },
                                        'Name' => 'struct dr_table_rx_tx',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '251246' => {
                                        'BaseType' => '250615',
                                        'Name' => 'struct dr_domain_rx_tx*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251252' => {
                                        'BaseType' => '250813',
                                        'Name' => 'struct mlx5dv_dr_domain*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251258' => {
                                        'Header' => undef,
                                        'Line' => '664',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 's_htbl',
                                                             'offset' => '0',
                                                             'type' => '248056'
                                                           },
                                                    '1' => {
                                                             'name' => 'e_anchor',
                                                             'offset' => '8',
                                                             'type' => '248056'
                                                           },
                                                    '2' => {
                                                             'name' => 'ste_builder',
                                                             'offset' => '16',
