$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.2.0',
          'Headers' => {},
          'Language' => 'C',
          'LibraryName' => 'libmlx5.so.1.17.33.0',
          'LibraryVersion' => 'mlx5',
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libibverbs.so.1' => 1,
                        'libpthread.so.0' => 1
                      },
          'Sources' => {},
          'SymbolInfo' => {
                            '1052214' => {
                                           'Header' => undef,
                                           'Line' => '5623',
                                           'Param' => {
                                                        '0' => {
                                                                 'name' => 'dv_pp',
                                                                 'type' => '1052615'
                                                               }
                                                      },
                                           'Return' => '1',
                                           'ShortName' => 'mlx5dv_pp_free'
                                         },
                            '1052645' => {
                                           'Header' => undef,

                                                     'mlx5dv_dr_matcher_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_matcher_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_rule_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_rule_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_table_create@@MLX5_1.10' => 1,
                                                     'mlx5dv_dr_table_destroy@@MLX5_1.10' => 1,
                                                     'mlx5dv_dump_dr_domain@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_matcher@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_rule@@MLX5_1.12' => 1,
                                                     'mlx5dv_dump_dr_table@@MLX5_1.12' => 1,
                                                     'mlx5dv_free_var@@MLX5_1.12' => 1,
                                                     'mlx5dv_get_clock_info@@MLX5_1.4' => 1,
                                                     'mlx5dv_init_obj@@MLX5_1.2' => 1,
                                                     'mlx5dv_init_obj@MLX5_1.0' => 1,
                                                     'mlx5dv_is_supported@@MLX5_1.8' => 1,
                                                     'mlx5dv_modify_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_modify_qp_sched_elem@@MLX5_1.17' => 1,
                                                     'mlx5dv_modify_qp_udp_sport@@MLX5_1.17' => 1,
                                                     'mlx5dv_open_device@@MLX5_1.7' => 1,
                                                     'mlx5dv_pp_alloc@@MLX5_1.13' => 1,
                                                     'mlx5dv_pp_free@@MLX5_1.13' => 1,
                                                     'mlx5dv_qp_ex_from_ibv_qp_ex@@MLX5_1.10' => 1,
                                                     'mlx5dv_query_device@@MLX5_1.0' => 1,
                                                     'mlx5dv_query_qp_lag_port@@MLX5_1.14' => 1,
                                                     'mlx5dv_sched_leaf_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_leaf_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_create@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_destroy@@MLX5_1.17' => 1,
                                                     'mlx5dv_sched_node_modify@@MLX5_1.17' => 1,
                                                     'mlx5dv_set_context_attr@@MLX5_1.2' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10026' => {
                                       'BaseType' => '9566',
                                       'Name' => 'struct ibv_cq_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10032' => {
                                       'BaseType' => '9494',
                                       'Name' => 'struct ibv_poll_cq_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10038' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*, struct ibv_poll_cq_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           },
                                                    '1' => {
                                                             'type' => '10032'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10059' => {
                                       'Name' => 'int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10076' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10097' => {
                                       'Name' => 'enum ibv_wc_opcode(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '5121',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10118' => {
                                       'Name' => 'uint32_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '1664',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10139' => {
                                       'Name' => '__be32(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '1741',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10160' => {
                                       'Name' => 'unsigned int(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '59',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10181' => {
                                       'Name' => 'uint8_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '1640',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10202' => {
                                       'Name' => 'uint64_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '1681',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1021' => {
                                      'Header' => undef,
                                      'Line' => '49',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '128'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '233'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '80',
                                                            'type' => '233'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '88',
                                                            'type' => '233'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '96',
                                                            'type' => '1437'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '104',
                                                            'type' => '1443'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '112',
                                                            'type' => '128'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '116',
                                                            'type' => '128'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '120',
                                                            'type' => '171'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '128',
                                                            'type' => '52'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '130',
                                                            'type' => '90'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '131',
                                                            'type' => '1449'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '16',
                                                           'type' => '233'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '136',
                                                            'type' => '1465'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '144',
                                                            'type' => '183'
                                                          },
                                                  '22' => {
                                                            'name' => '_codecvt',
                                                            'offset' => '152',
                                                            'type' => '1476'
                                                          },
                                                  '23' => {
                                                            'name' => '_wide_data',
                                                            'offset' => '160',
                                                            'type' => '1487'
                                                          },
                                                  '24' => {
                                                            'name' => '_freeres_list',
                                                            'offset' => '168',
                                                            'type' => '1443'
                                                          },
                                                  '25' => {
                                                            'name' => '_freeres_buf',
                                                            'offset' => '176',
                                                            'type' => '219'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '184',
                                                            'type' => '314'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '192',
                                                            'type' => '128'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '196',
                                                            'type' => '1493'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '24',
                                                           'type' => '233'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '32',
                                                           'type' => '233'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '40',
                                                           'type' => '233'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '48',
                                                           'type' => '233'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '56',
                                                           'type' => '233'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '64',
                                                           'type' => '233'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '72',
                                                           'type' => '233'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '10223' => {
                                       'Name' => 'uint16_t(*)(struct ibv_cq_ex*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           }
                                                  },
                                       'Return' => '1652',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10245' => {
                                       'BaseType' => '9523',
                                       'Name' => 'struct ibv_wc_tm_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10251' => {
                                       'Name' => 'void(*)(struct ibv_cq_ex*, struct ibv_wc_tm_info*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10026'
                                                           },
                                                    '1' => {
                                                             'type' => '10245'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1026452' => {
                                         'Header' => undef,
                                         'Line' => '57',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'wr_id',
                                                              'offset' => '0',
                                                              'type' => '1729'
                                                            },
                                                     '1' => {
                                                              'name' => 'out_data',
                                                              'offset' => '8',
                                                              'type' => '1026494'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5_ib_uapi_devx_async_cmd_hdr',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1026494' => {
                                         'BaseType' => '1693',
                                         'Name' => '__u8[]',
                                         'Size' => '8',
                                         'Type' => 'Array'
                                       },
                          '1026546' => {
                                         'Header' => undef,
                                         'Line' => '68',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MLX5_IB_UAPI_DEVX_CR_EV_CH_FLAGS_OMIT_DATA',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum mlx5_ib_uapi_devx_create_event_channel_flags',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1026571' => {
                                         'Header' => undef,
                                         'Line' => '72',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'cookie',
                                                              'offset' => '0',
                                                              'type' => '1729'
                                                            },
                                                     '1' => {
                                                              'name' => 'out_data',
                                                              'offset' => '8',
                                                              'type' => '1026494'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5_ib_uapi_devx_async_event_hdr',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1026923' => {
                                         'Header' => undef,
                                         'Line' => '164',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '0',
                                                              'type' => '1681'
                                                            },
                                                     '1' => {
                                                              'name' => 'cqe_comp_res_format',
                                                              'offset' => '8',
                                                              'type' => '1640'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '12',
                                                              'type' => '1664'
                                                            },
                                                     '3' => {
                                                              'name' => 'cqe_size',
                                                              'offset' => '16',
                                                              'type' => '1652'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_cq_init_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1027069' => {
                                         'Header' => undef,
                                         'Line' => '188',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pd',
                                                              'offset' => '0',
                                                              'type' => '5841'
                                                            },
                                                     '1' => {
                                                              'name' => 'create_flags',
                                                              'offset' => '8',
                                                              'type' => '1664'
                                                            },
                                                     '2' => {
                                                              'name' => 'max_entries',
                                                              'offset' => '12',
                                                              'type' => '1652'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_mkey_init_attr',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1027654' => {
                                         'Header' => undef,
                                         'Line' => '300',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '0',
                                                              'type' => '1681'
                                                            },
                                                     '1' => {
                                                              'name' => 'action_flags',
                                                              'offset' => '8',
                                                              'type' => '1664'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_flow_action_esp',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1028427' => {
                                         'Header' => undef,
                                         'Line' => '544',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'single_stride_log_num_of_bytes',
                                                              'offset' => '0',
                                                              'type' => '1664'
                                                            },
                                                     '1' => {
                                                              'name' => 'single_wqe_log_num_of_strides',
                                                              'offset' => '4',
                                                              'type' => '1664'
                                                            },
                                                     '2' => {
                                                              'name' => 'two_byte_shift_en',
                                                              'offset' => '8',
                                                              'type' => '1640'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_striding_rq_init_attr',
                                         'Size' => '12',
                                         'Type' => 'Struct'
                                       },
                          '1028484' => {
                                         'Header' => undef,
                                         'Line' => '550',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '0',
                                                              'type' => '1681'
                                                            },
                                                     '1' => {
                                                              'name' => 'striding_rq_attrs',
                                                              'offset' => '8',
                                                              'type' => '1028427'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_wq_init_attr',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1029648' => {
                                         'Header' => undef,
                                         'Line' => '1290',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'page_id',
                                                              'offset' => '0',
                                                              'type' => '1664'
                                                            },
                                                     '1' => {
                                                              'name' => 'length',
                                                              'offset' => '4',
                                                              'type' => '1664'
                                                            },
                                                     '2' => {
                                                              'name' => 'mmap_off',
                                                              'offset' => '8',
                                                              'type' => '1521'
                                                            },
                                                     '3' => {
                                                              'name' => 'comp_mask',
                                                              'offset' => '16',
                                                              'type' => '1681'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_var',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1029719' => {
                                         'Header' => undef,
                                         'Line' => '1327',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'fd',
                                                              'offset' => '0',
                                                              'type' => '128'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_devx_cmd_comp',
                                         'Size' => '4',
                                         'Type' => 'Struct'
                                       },
                          '1029747' => {
                                         'Header' => undef,
                                         'Line' => '1343',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'fd',
                                                              'offset' => '0',
                                                              'type' => '128'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_devx_event_channel',
                                         'Size' => '4',
                                         'Type' => 'Struct'
                                       },
                          '1029775' => {
                                         'Header' => undef,
                                         'Line' => '1604',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'index',
                                                              'offset' => '0',
                                                              'type' => '1652'
                                                            }
                                                   },
                                         'Name' => 'struct mlx5dv_pp',
                                         'Size' => '2',
                                         'Type' => 'Struct'
                                       },
                          '10343' => {
                                       'Header' => undef,
                                       'Line' => '1638',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'IBV_FLOW_ATTR_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'IBV_FLOW_ATTR_ALL_DEFAULT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'IBV_FLOW_ATTR_MC_DEFAULT',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'IBV_FLOW_ATTR_SNIFFER',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum ibv_flow_attr_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10387' => {
                                       'Header' => undef,
                                       'Line' => '1870',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2485'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10416' => {
                                       'Header' => undef,
                                       'Line' => '2035',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'context',
                                                            'offset' => '0',
                                                            'type' => '2485'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_counters',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10445' => {
                                       'BaseType' => '10416',
                                       'Name' => 'struct ibv_counters*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1052615' => {
                                         'BaseType' => '1029775',
                                         'Name' => 'struct mlx5dv_pp*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1054568' => {
                                         'BaseType' => '1029648',
                                         'Name' => 'struct mlx5dv_var*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10564' => {
                                       'Header' => undef,
                                       'Line' => '1864',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '8',
                                                            'type' => '2485'
                                                          },
                                                   '2' => {
                                                            'name' => 'handle',
                                                            'offset' => '16',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1057375' => {
                                         'BaseType' => '1027069',
                                         'Name' => 'struct mlx5dv_mkey_init_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057625' => {
                                         'BaseType' => '1029747',
                                         'Name' => 'struct mlx5dv_devx_event_channel*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057631' => {
                                         'BaseType' => '1026571',
                                         'Name' => 'struct mlx5_ib_uapi_devx_async_event_hdr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057865' => {
                                         'BaseType' => '1029719',
                                         'Name' => 'struct mlx5dv_devx_cmd_comp*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057871' => {
                                         'BaseType' => '1026452',
                                         'Name' => 'struct mlx5_ib_uapi_devx_async_cmd_hdr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10621' => {
                                       'Header' => undef,
                                       'Line' => '1878',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'esp_attr',
                                                            'offset' => '0',
                                                            'type' => '10776'
                                                          },
                                                   '1' => {
                                                            'name' => 'keymat_proto',
                                                            'offset' => '8',
                                                            'type' => '1781'
                                                          },
                                                   '2' => {
                                                            'name' => 'keymat_len',
                                                            'offset' => '12',
                                                            'type' => '1652'
                                                          },
                                                   '3' => {
                                                            'name' => 'keymat_ptr',
                                                            'offset' => '16',
                                                            'type' => '219'
                                                          },
                                                   '4' => {
                                                            'name' => 'replay_proto',
                                                            'offset' => '24',
                                                            'type' => '1806'
                                                          },
                                                   '5' => {
                                                            'name' => 'replay_len',
                                                            'offset' => '28',
                                                            'type' => '1652'
                                                          },
                                                   '6' => {
                                                            'name' => 'replay_ptr',
                                                            'offset' => '32',
                                                            'type' => '219'
                                                          },
                                                   '7' => {
                                                            'name' => 'esp_encap',
                                                            'offset' => '40',
                                                            'type' => '1964'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '48',
                                                            'type' => '1664'
                                                          },
                                                   '9' => {
                                                            'name' => 'esn',
                                                            'offset' => '52',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_flow_action_esp_attr',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10776' => {
                                       'BaseType' => '1970',
                                       'Name' => 'struct ib_uverbs_flow_action_esp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10782' => {
                                       'Header' => undef,
                                       'Line' => '1899',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_dummy1',
                                                            'offset' => '0',
                                                            'type' => '10966'
                                                          },
                                                   '1' => {
                                                            'name' => '_dummy2',
                                                            'offset' => '8',
                                                            'type' => '10983'
                                                          }
                                                 },
                                       'Name' => 'struct _ibv_device_ops',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10845' => {
                                       'BaseType' => '10851',
                                       'Name' => 'struct ibv_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10851' => {
                                       'Header' => undef,
                                       'Line' => '1909',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_ops',
                                                            'offset' => '0',
                                                            'type' => '10782'
                                                          },
                                                   '1' => {
                                                            'name' => 'node_type',
                                                            'offset' => '16',
                                                            'type' => '2088'
                                                          },
                                                   '2' => {
                                                            'name' => 'transport_type',
                                                            'offset' => '20',
                                                            'type' => '2155'
                                                          },
                                                   '3' => {
                                                            'name' => 'name',
                                                            'offset' => '24',
                                                            'type' => '3103'
                                                          },
                                                   '4' => {
                                                            'name' => 'dev_name',
                                                            'offset' => '88',
                                                            'type' => '3103'
                                                          },
                                                   '5' => {
                                                            'name' => 'dev_path',
                                                            'offset' => '152',
                                                            'type' => '10989'
                                                          },
                                                   '6' => {
                                                            'name' => 'ibdev_path',
                                                            'offset' => '408',
                                                            'type' => '10989'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_device',
                                       'Size' => '664',
                                       'Type' => 'Struct'
                                     },
                          '1091181' => {
                                         'BaseType' => '422059',
                                         'Name' => 'struct mlx5dv_flow_matcher_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1094862' => {
                                         'BaseType' => '389176',
                                         'Name' => 'struct mlx5dv_alloc_dm_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10966' => {
                                       'Name' => 'struct ibv_context*(*)(struct ibv_device*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10845'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           }
                                                  },
                                       'Return' => '2485',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10983' => {
                                       'Name' => 'void(*)(struct ibv_context*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2485'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10989' => {
                                       'BaseType' => '244',
                                       'Name' => 'char[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '1099529' => {
                                         'BaseType' => '1027654',
                                         'Name' => 'struct mlx5dv_flow_action_esp*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '11005' => {
                                       'Header' => undef,
                                       'Line' => '1924',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_compat_query_device',
                                                            'offset' => '0',
                                                            'type' => '11495'
                                                          },
                                                   '1' => {
                                                            'name' => '_compat_query_port',
                                                            'offset' => '8',
                                                            'type' => '11537'
                                                          },
                                                   '10' => {
                                                             'name' => '_compat_create_cq',
                                                             'offset' => '80',
                                                             'type' => '11548'
                                                           },
                                                   '11' => {
                                                             'name' => 'poll_cq',
                                                             'offset' => '88',
                                                             'type' => '11669'
                                                           },
                                                   '12' => {
                                                             'name' => 'req_notify_cq',
                                                             'offset' => '96',
                                                             'type' => '11695'
                                                           },
                                                   '13' => {
                                                             'name' => '_compat_cq_event',
                                                             'offset' => '104',
                                                             'type' => '11548'
                                                           },
                                                   '14' => {
                                                             'name' => '_compat_resize_cq',
                                                             'offset' => '112',
                                                             'type' => '11548'
                                                           },
                                                   '15' => {
                                                             'name' => '_compat_destroy_cq',
                                                             'offset' => '120',
                                                             'type' => '11548'
                                                           },
                                                   '16' => {
                                                             'name' => '_compat_create_srq',
                                                             'offset' => '128',
                                                             'type' => '11548'
                                                           },
                                                   '17' => {
                                                             'name' => '_compat_modify_srq',
                                                             'offset' => '136',
                                                             'type' => '11548'
                                                           },
                                                   '18' => {
                                                             'name' => '_compat_query_srq',
                                                             'offset' => '144',
                                                             'type' => '11548'
                                                           },
                                                   '19' => {
                                                             'name' => '_compat_destroy_srq',
                                                             'offset' => '152',
                                                             'type' => '11548'
                                                           },
                                                   '2' => {
                                                            'name' => '_compat_alloc_pd',
                                                            'offset' => '16',
                                                            'type' => '11548'
                                                          },
                                                   '20' => {
                                                             'name' => 'post_srq_recv',
                                                             'offset' => '160',
                                                             'type' => '11726'
                                                           },
                                                   '21' => {
                                                             'name' => '_compat_create_qp',
                                                             'offset' => '168',
                                                             'type' => '11548'
                                                           },
                                                   '22' => {
                                                             'name' => '_compat_query_qp',
                                                             'offset' => '176',
                                                             'type' => '11548'
                                                           },
                                                   '23' => {
                                                             'name' => '_compat_modify_qp',
                                                             'offset' => '184',
                                                             'type' => '11548'
                                                           },
                                                   '24' => {
                                                             'name' => '_compat_destroy_qp',
                                                             'offset' => '192',
                                                             'type' => '11548'
                                                           },
                                                   '25' => {
                                                             'name' => 'post_send',
                                                             'offset' => '200',
                                                             'type' => '11763'
                                                           },
                                                   '26' => {
                                                             'name' => 'post_recv',
                                                             'offset' => '208',
                                                             'type' => '11794'
                                                           },
                                                   '27' => {
                                                             'name' => '_compat_create_ah',
                                                             'offset' => '216',
                                                             'type' => '11548'
                                                           },
                                                   '28' => {
                                                             'name' => '_compat_destroy_ah',
                                                             'offset' => '224',
                                                             'type' => '11548'
                                                           },
                                                   '29' => {
                                                             'name' => '_compat_attach_mcast',
                                                             'offset' => '232',
                                                             'type' => '11548'
                                                           },
                                                   '3' => {
                                                            'name' => '_compat_dealloc_pd',
                                                            'offset' => '24',
                                                            'type' => '11548'
                                                          },
                                                   '30' => {
                                                             'name' => '_compat_detach_mcast',
                                                             'offset' => '240',
                                                             'type' => '11548'
                                                           },
                                                   '31' => {
                                                             'name' => '_compat_async_event',
                                                             'offset' => '248',
                                                             'type' => '11548'
                                                           },
                                                   '4' => {
                                                            'name' => '_compat_reg_mr',
                                                            'offset' => '32',
                                                            'type' => '11548'
                                                          },
                                                   '5' => {
                                                            'name' => '_compat_rereg_mr',
                                                            'offset' => '40',
                                                            'type' => '11548'
                                                          },
                                                   '6' => {
                                                            'name' => '_compat_dereg_mr',
                                                            'offset' => '48',
                                                            'type' => '11548'
                                                          },
                                                   '7' => {
                                                            'name' => 'alloc_mw',
                                                            'offset' => '56',
                                                            'type' => '11574'
                                                          },
                                                   '8' => {
                                                            'name' => 'bind_mw',
                                                            'offset' => '64',
                                                            'type' => '11611'
                                                          },
                                                   '9' => {
                                                            'name' => 'dealloc_mw',
                                                            'offset' => '72',
                                                            'type' => '11632'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_context_ops',
                                       'Size' => '256',
                                       'Type' => 'Struct'
                                     },
                          '1103487' => {
                                         'BaseType' => '1028484',
                                         'Name' => 'struct mlx5dv_wq_init_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1112279' => {
                                         'BaseType' => '904560',
                                         'Name' => 'struct mlx5dv_qp_init_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1131227' => {
                                         'BaseType' => '1026923',
                                         'Name' => 'struct mlx5dv_cq_init_attr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '11489' => {
                                       'BaseType' => '2569',
                                       'Name' => 'struct ibv_device_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11495' => {
                                       'Name' => 'int(*)(struct ibv_context*, struct ibv_device_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2485'
                                                           },
                                                    '1' => {
                                                             'type' => '11489'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11526' => {
                                       'BaseType' => '11532',
                                       'Name' => 'struct _compat_ibv_port_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11532' => {
                                       'Name' => 'struct _compat_ibv_port_attr',
                                       'Type' => 'Struct'
                                     },
                          '11537' => {
                                       'Name' => 'int(*)(struct ibv_context*, uint8_t, struct _compat_ibv_port_attr*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2485'
                                                           },
                                                    '1' => {
                                                             'type' => '1640'
                                                           },
                                                    '2' => {
                                                             'type' => '11526'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11548' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '219',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11574' => {
                                       'Name' => 'struct ibv_mw*(*)(struct ibv_pd*, enum ibv_mw_type)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5841'
                                                           },
                                                    '1' => {
                                                             'type' => '5847'
                                                           }
                                                  },
                                       'Return' => '7947',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '116' => {
                                     'BaseType' => '52',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '11605' => {
                                       'BaseType' => '8532',
                                       'Name' => 'struct ibv_mw_bind*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11611' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_mw*, struct ibv_mw_bind*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4632'
                                                           },
                                                    '1' => {
                                                             'type' => '7947'
                                                           },
                                                    '2' => {
                                                             'type' => '11605'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11632' => {
                                       'Name' => 'int(*)(struct ibv_mw*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7947'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11663' => {
                                       'BaseType' => '5274',
                                       'Name' => 'struct ibv_wc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11669' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int, struct ibv_wc*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4430'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           },
                                                    '2' => {
                                                             'type' => '11663'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11695' => {
                                       'Name' => 'int(*)(struct ibv_cq*, int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4430'
                                                           },
                                                    '1' => {
                                                             'type' => '128'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11726' => {
                                       'Name' => 'int(*)(struct ibv_srq*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4750'
                                                           },
                                                    '1' => {
                                                             'type' => '8264'
                                                           },
                                                    '2' => {
                                                             'type' => '8614'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11757' => {
                                       'BaseType' => '8181',
                                       'Name' => 'struct ibv_send_wr**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11763' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_send_wr*, struct ibv_send_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4632'
                                                           },
                                                    '1' => {
                                                             'type' => '8181'
                                                           },
                                                    '2' => {
                                                             'type' => '11757'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11794' => {
                                       'Name' => 'int(*)(struct ibv_qp*, struct ibv_recv_wr*, struct ibv_recv_wr**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4632'
                                                           },
                                                    '1' => {
                                                             'type' => '8264'
                                                           },
                                                    '2' => {
                                                             'type' => '8614'
                                                           }
                                                  },
                                       'Return' => '128',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11800' => {
                                       'Header' => undef,
                                       'Line' => '1987',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cqe',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'cq_context',
                                                            'offset' => '8',
                                                            'type' => '219'
                                                          },
                                                   '2' => {
                                                            'name' => 'channel',
                                                            'offset' => '16',
                                                            'type' => '9488'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_vector',
                                                            'offset' => '24',
                                                            'type' => '1664'
                                                          },
                                                   '4' => {
                                                            'name' => 'wc_flags',
                                                            'offset' => '32',
                                                            'type' => '1681'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '40',
                                                            'type' => '1664'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '44',
                                                            'type' => '1664'
                                                          },
                                                   '7' => {
                                                            'name' => 'parent_domain',
                                                            'offset' => '48',
                                                            'type' => '5841'
                                                          }
                                                 },
                                       'Name' => 'struct ibv_cq_init_attr_ex',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '12065' => {
                                       'Name' => 'void*(*)(struct ibv_pd*, void*, size_t, size_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5841'
                                                           },
                                                    '1' => {
                                                             'type' => '219'
                                                           },
                                                    '2' => {
                                                             'type' => '314'
                                                           },
                                                    '3' => {
                                                             'type' => '314'
                                                           },
                                                    '4' => {
                                                             'type' => '1681'
                                                           }
                                                  },
                                       'Return' => '219',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12097' => {
                                       'Name' => 'void(*)(struct ibv_pd*, void*, void*, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5841'
                                                           },
                                                    '1' => {
                                                             'type' => '219'
                                                           },
                                                    '2' => {
                                                             'type' => '219'
                                                           },
                                                    '3' => {
                                                             'type' => '1681'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '128' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12996' => {
                                       'BaseType' => '1681',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13039' => {
                                       'BaseType' => '10564',
                                       'Name' => 'struct ibv_flow*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13165' => {
                                       'BaseType' => '2247',
                                       'Name' => 'struct ibv_alloc_dm_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13218' => {
                                       'BaseType' => '10387',
                                       'Name' => 'struct ibv_flow_action*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13224' => {
                                       'BaseType' => '10621',
                                       'Name' => 'struct ibv_flow_action_esp_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '135' => {
                                     'BaseType' => '128',
                                     'Name' => 'int volatile',
                                     'Size' => '4',
                                     'Type' => 'Volatile'
                                   },
                          '13595' => {
                                       'BaseType' => '6258',
                                       'Name' => 'struct ibv_wq_init_attr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13659' => {
                                       'BaseType' => '11800',
                                       'Name' => 'struct ibv_cq_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13835' => {
                                       'BaseType' => '6870',
                                       'Name' => 'struct ibv_qp_init_attr_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13867' => {
                                       'BaseType' => '1664',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13964' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '14004'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '14004'
                                                          }
                                                 },
                                       'Name' => 'struct list_node',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '140' => {
                                     'BaseType' => '59',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '14004' => {
                                       'BaseType' => '13964',
                                       'Name' => 'struct list_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14010' => {
                                       'Header' => undef,
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'n',
                                                            'offset' => '0',
                                                            'type' => '13964'
                                                          }
                                                 },
                                       'Name' => 'struct list_head',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1412' => {
                                      'BaseType' => '1021',
                                      'Header' => undef,
                                      'Line' => '7',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '1424' => {
                                      'BaseType' => '1',
                                      'Header' => undef,
                                      'Line' => '43',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '14255' => {
                                       'Name' => 'atomic_int',
                                       'Size' => '4',
                                       'Type' => 'Intrinsic'
                                     },
                          '1432' => {
                                      'Name' => 'struct _IO_marker',
                                      'Type' => 'Struct'
                                    },
                          '1437' => {
                                      'BaseType' => '1432',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1443' => {
                                      'BaseType' => '1021',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1449' => {
                                      'BaseType' => '244',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '14601' => {
                                       'Header' => undef,
                                       'Line' => '87',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_num',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_format',
                                                            'offset' => '4',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_cqe_comp_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '14641' => {
                                       'Header' => undef,
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sw_parsing_offloads',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '4',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_sw_parsing_caps',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '1465' => {
                                      'BaseType' => '1424',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14681' => {
                                       'Header' => undef,
                                       'Line' => '97',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'min_single_stride_log_num_of_bytes',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_single_stride_log_num_of_bytes',
                                                            'offset' => '4',
                                                            'type' => '1664'
                                                          },
                                                   '2' => {
                                                            'name' => 'min_single_wqe_log_num_of_strides',
                                                            'offset' => '8',
                                                            'type' => '1664'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_single_wqe_log_num_of_strides',
                                                            'offset' => '12',
                                                            'type' => '1664'
                                                          },
                                                   '4' => {
                                                            'name' => 'supported_qpts',
                                                            'offset' => '16',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_striding_rq_caps',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '1471' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'Type' => 'Struct'
                                    },
                          '1476' => {
                                      'BaseType' => '1471',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14760' => {
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lkey',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'rkey',
                                                            'offset' => '4',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mkey',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '14800' => {
                                       'Header' => undef,
                                       'Line' => '208',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCT',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5DV_DCTYPE_DCI',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5dv_dc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1482' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'Type' => 'Struct'
                                    },
                          '14831' => {
                                       'Header' => undef,
                                       'Line' => '234',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'addr',
                                                            'offset' => '0',
                                                            'type' => '1681'
                                                          },
                                                   '1' => {
                                                            'name' => 'bytes_count',
                                                            'offset' => '8',
                                                            'type' => '1664'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes_skip',
                                                            'offset' => '12',
                                                            'type' => '1664'
                                                          },
                                                   '3' => {
                                                            'name' => 'lkey',
                                                            'offset' => '16',
                                                            'type' => '1664'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_mr_interleaved',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1487' => {
                                      'BaseType' => '1482',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14897' => {
                                       'Header' => undef,
                                       'Line' => '245',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '0',
                                                            'type' => '1681'
                                                          },
                                                   '1' => {
                                                            'name' => 'wr_set_dc_addr',
                                                            'offset' => '8',
                                                            'type' => '14996'
                                                          },
                                                   '2' => {
                                                            'name' => 'wr_mr_interleaved',
                                                            'offset' => '16',
                                                            'type' => '15050'
                                                          },
                                                   '3' => {
                                                            'name' => 'wr_mr_list',
                                                            'offset' => '24',
                                                            'type' => '15087'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_qp_ex',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1493' => {
                                      'BaseType' => '244',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '14990' => {
                                       'BaseType' => '14897',
                                       'Name' => 'struct mlx5dv_qp_ex*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14996' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct ibv_ah*, uint32_t, uint64_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14990'
                                                           },
                                                    '1' => {
                                                             'type' => '7791'
                                                           },
                                                    '2' => {
                                                             'type' => '1664'
                                                           },
                                                    '3' => {
                                                             'type' => '1681'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15038' => {
                                       'BaseType' => '14760',
                                       'Name' => 'struct mlx5dv_mkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15044' => {
                                       'BaseType' => '14831',
                                       'Name' => 'struct mlx5dv_mr_interleaved*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15050' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint32_t, uint16_t, struct mlx5dv_mr_interleaved*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14990'
                                                           },
                                                    '1' => {
                                                             'type' => '15038'
                                                           },
                                                    '2' => {
                                                             'type' => '1664'
                                                           },
                                                    '3' => {
                                                             'type' => '1664'
                                                           },
                                                    '4' => {
                                                             'type' => '1652'
                                                           },
                                                    '5' => {
                                                             'type' => '15044'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15087' => {
                                       'Name' => 'void(*)(struct mlx5dv_qp_ex*, struct mlx5dv_mkey*, uint32_t, uint16_t, struct ibv_sge*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14990'
                                                           },
                                                    '1' => {
                                                             'type' => '15038'
                                                           },
                                                    '2' => {
                                                             'type' => '1664'
                                                           },
                                                    '3' => {
                                                             'type' => '1652'
                                                           },
                                                    '4' => {
                                                             'type' => '8187'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '15093' => {
                                       'BaseType' => '1741',
                                       'Name' => '__be32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '152' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1521' => {
                                      'BaseType' => '171',
                                      'Header' => undef,
                                      'Line' => '63',
                                      'Name' => 'off_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '15319' => {
                                       'Header' => undef,
                                       'Line' => '1277',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg_addr',
                                                            'offset' => '0',
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'name' => 'base_addr',
                                                            'offset' => '8',
                                                            'type' => '219'
                                                          },
                                                   '2' => {
                                                            'name' => 'page_id',
                                                            'offset' => '16',
                                                            'type' => '1664'
                                                          },
                                                   '3' => {
                                                            'name' => 'mmap_off',
                                                            'offset' => '24',
                                                            'type' => '1521'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_mask',
                                                            'offset' => '32',
                                                            'type' => '1681'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5dv_devx_uar',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '1533' => {
                                      'BaseType' => '1412',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '15488' => {
                                       'Header' => undef,
                                       'Line' => '187',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_ANON',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_HUGE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_CONTIG',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_PREFER_HUGE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_PREFER_CONTIG',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_EXTERNAL',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_CUSTOM',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'MLX5_ALLOC_TYPE_ALL',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum mlx5_alloc_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '15644' => {
                                       'Header' => undef,
                                       'Line' => '233',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lock',
                                                            'offset' => '0',
                                                            'type' => '911'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_use',
                                                            'offset' => '4',
                                                            'type' => '128'
                                                          },
                                                   '2' => {
                                                            'name' => 'need_lock',
                                                            'offset' => '8',
                                                            'type' => '128'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_spinlock',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '1568' => {
                                      'BaseType' => '1574',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1574' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '159' => {
                                     'BaseType' => '66',
                                     'Header' => undef,
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1633' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '1640' => {
                                      'BaseType' => '97',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1652' => {
                                      'BaseType' => '116',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1664' => {
                                      'BaseType' => '140',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1681' => {
                                      'BaseType' => '159',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1693' => {
                                      'BaseType' => '45',
                                      'Header' => undef,
                                      'Line' => '21',
                                      'Name' => '__u8',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1705' => {
                                      'BaseType' => '52',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => '__u16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '171' => {
                                     'BaseType' => '152',
                                     'Header' => undef,
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1717' => {
                                      'BaseType' => '59',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1729' => {
                                      'BaseType' => '333',
                                      'Header' => undef,
                                      'Line' => '31',
                                      'Name' => '__u64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1741' => {
                                      'BaseType' => '1717',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => '__be32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1753' => {
                                      'BaseType' => '1729',
                                      'Header' => undef,
                                      'Line' => '29',
                                      'Name' => '__be64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1781' => {
                                      'Header' => undef,
                                      'Line' => '144',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IB_UVERBS_FLOW_ACTION_ESP_KEYMAT_AES_GCM',
                                                           'value' => '0'
                                                         }
                                                },
                                      'Name' => 'enum ib_uverbs_flow_action_esp_keymat',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1806' => {
                                      'Header' => undef,
                                      'Line' => '163',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IB_UVERBS_FLOW_ACTION_ESP_REPLAY_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IB_UVERBS_FLOW_ACTION_ESP_REPLAY_BMP',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum ib_uverbs_flow_action_esp_replay',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '183' => {
                                     'BaseType' => '152',
                                     'Header' => undef,
                                     'Line' => '153',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1837' => {
                                      'Header' => undef,
                                      'Line' => '189',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'val_ptr',
                                                           'offset' => '0',
                                                           'type' => '219'
                                                         },
                                                  '1' => {
                                                           'name' => 'val_ptr_data_u64',
                                                           'offset' => '0',
                                                           'type' => '1729'
                                                         }
                                                },
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '18547' => {
                                       'Header' => undef,
                                       'Line' => '544',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'reg',
                                                            'offset' => '0',
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'name' => 'need_lock',
                                                            'offset' => '8',
                                                            'type' => '128'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dyn_alloc_uar',
                                                             'offset' => '112',
                                                             'type' => '1640'
                                                           },
                                                   '11' => {
                                                             'bitfield' => '1',
                                                             'name' => 'mmaped_entry',
                                                             'offset' => '112',
                                                             'type' => '1640'
                                                           },
                                                   '12' => {
                                                             'bitfield' => '1',
                                                             'name' => 'nc_mode',
                                                             'offset' => '112',
                                                             'type' => '1640'
                                                           },
                                                   '13' => {
                                                             'bitfield' => '1',
                                                             'name' => 'qp_dedicated',
                                                             'offset' => '112',
                                                             'type' => '1640'
                                                           },
                                                   '14' => {
                                                             'bitfield' => '1',
                                                             'name' => 'qp_shared',
                                                             'offset' => '112',
                                                             'type' => '1640'
                                                           },
                                                   '15' => {
                                                             'name' => 'count',
                                                             'offset' => '116',
                                                             'type' => '1664'
                                                           },
                                                   '16' => {
                                                             'name' => 'uar_entry',
                                                             'offset' => '120',
                                                             'type' => '13964'
                                                           },
                                                   '17' => {
                                                             'name' => 'uar_handle',
                                                             'offset' => '136',
                                                             'type' => '1664'
                                                           },
                                                   '18' => {
                                                             'name' => 'length',
                                                             'offset' => '140',
                                                             'type' => '1664'
                                                           },
                                                   '19' => {
                                                             'name' => 'page_id',
                                                             'offset' => '144',
                                                             'type' => '1664'
                                                           },
                                                   '2' => {
                                                            'name' => 'lock',
                                                            'offset' => '12',
                                                            'type' => '15644'
                                                          },
                                                   '3' => {
                                                            'name' => 'offset',
                                                            'offset' => '24',
                                                            'type' => '59'
                                                          },
                                                   '4' => {
                                                            'name' => 'buf_size',
                                                            'offset' => '28',
                                                            'type' => '59'
                                                          },
                                                   '5' => {
                                                            'name' => 'uuarn',
                                                            'offset' => '32',
                                                            'type' => '59'
                                                          },
                                                   '6' => {
                                                            'name' => 'uar_mmap_offset',
                                                            'offset' => '40',
                                                            'type' => '1521'
                                                          },
                                                   '7' => {
                                                            'name' => 'uar',
                                                            'offset' => '48',
                                                            'type' => '219'
                                                          },
                                                   '8' => {
                                                            'name' => 'bfreg_dyn_index',
                                                            'offset' => '56',
                                                            'type' => '1664'
                                                          },
                                                   '9' => {
                                                            'name' => 'devx_uar',
                                                            'offset' => '64',
                                                            'type' => '19799'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_bf',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '1873' => {
                                      'Header' => undef,
                                      'Line' => '190',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_ptr',
                                                           'offset' => '0',
                                                           'type' => '1964'
                                                         },
                                                  '1' => {
                                                           'name' => 'next_ptr_data_u64',
                                                           'offset' => '0',
                                                           'type' => '1729'
                                                         }
                                                },
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '18857' => {
                                       'BaseType' => '18547',
                                       'Name' => 'struct mlx5_bf*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18869' => {
                                       'Header' => undef,
                                       'Line' => '367',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'last',
                                                            'offset' => '0',
                                                            'type' => '1664'
                                                          },
                                                   '1' => {
                                                            'name' => 'top',
                                                            'offset' => '4',
                                                            'type' => '1664'
                                                          },
                                                   '2' => {
                                                            'name' => 'max',
                                                            'offset' => '8',
                                                            'type' => '1664'
                                                          },
                                                   '3' => {
                                                            'name' => 'avail',
                                                            'offset' => '12',
                                                            'type' => '1664'
                                                          },
                                                   '4' => {
                                                            'name' => 'mask',
                                                            'offset' => '16',
                                                            'type' => '1664'
                                                          },
                                                   '5' => {
                                                            'name' => 'table',
                                                            'offset' => '24',
                                                            'type' => '18968'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_bitmap',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '18968' => {
                                       'BaseType' => '66',
                                       'Name' => 'unsigned long*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18974' => {
                                       'Header' => undef,
                                       'Line' => '376',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'shmid',
                                                            'offset' => '0',
                                                            'type' => '128'
                                                          },
                                                   '1' => {
                                                            'name' => 'shmaddr',
                                                            'offset' => '8',
                                                            'type' => '219'
                                                          },
                                                   '2' => {
                                                            'name' => 'bitmap',
                                                            'offset' => '16',
                                                            'type' => '18869'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry',
                                                            'offset' => '48',
                                                            'type' => '13964'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_hugetlb_mem',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '19045' => {
                                       'Header' => undef,
                                       'Line' => '383',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '219'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '314'
                                                          },
                                                   '2' => {
                                                            'name' => 'base',
                                                            'offset' => '16',
                                                            'type' => '128'
                                                          },
                                                   '3' => {
                                                            'name' => 'hmem',
                                                            'offset' => '24',
                                                            'type' => '19172'
                                                          },
                                                   '4' => {
                                                            'name' => 'type',
                                                            'offset' => '32',
                                                            'type' => '15488'
                                                          },
                                                   '5' => {
                                                            'name' => 'resource_type',
                                                            'offset' => '40',
                                                            'type' => '1681'
                                                          },
                                                   '6' => {
                                                            'name' => 'req_alignment',
                                                            'offset' => '48',
                                                            'type' => '314'
                                                          },
                                                   '7' => {
                                                            'name' => 'mparent_domain',
                                                            'offset' => '56',
                                                            'type' => '19263'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_buf',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1909' => {
                                      'Header' => undef,
                                      'Line' => '185',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '0',
                                                           'type' => '1837'
                                                         },
                                                  '1' => {
                                                           'name' => 'unnamed1',
                                                           'offset' => '8',
                                                           'type' => '1873'
                                                         },
                                                  '2' => {
                                                           'name' => 'len',
                                                           'offset' => '16',
                                                           'type' => '1705'
                                                         },
                                                  '3' => {
                                                           'name' => 'type',
                                                           'offset' => '18',
                                                           'type' => '1705'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_flow_action_esp_encap',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '19172' => {
                                       'BaseType' => '18974',
                                       'Name' => 'struct mlx5_hugetlb_mem*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19178' => {
                                       'Header' => undef,
                                       'Line' => '407',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'mpd',
                                                            'offset' => '0',
                                                            'type' => '19332'
                                                          },
                                                   '1' => {
                                                            'name' => 'mtd',
                                                            'offset' => '32',
                                                            'type' => '19416'
                                                          },
                                                   '2' => {
                                                            'name' => 'alloc',
                                                            'offset' => '40',
                                                            'type' => '12065'
                                                          },
                                                   '3' => {
                                                            'name' => 'free',
                                                            'offset' => '48',
                                                            'type' => '12097'
                                                          },
                                                   '4' => {
                                                            'name' => 'pd_context',
                                                            'offset' => '56',
                                                            'type' => '219'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_parent_domain',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '19263' => {
                                       'BaseType' => '19178',
                                       'Name' => 'struct mlx5_parent_domain*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19269' => {
                                       'Header' => undef,
                                       'Line' => '394',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ibv_td',
                                                            'offset' => '0',
                                                            'type' => '5727'
                                                          },
                                                   '1' => {
                                                            'name' => 'bf',
                                                            'offset' => '8',
                                                            'type' => '18857'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcount',
                                                            'offset' => '16',
                                                            'type' => '14255'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_td',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '19332' => {
                                       'Header' => undef,
                                       'Line' => '400',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ibv_pd',
                                                            'offset' => '0',
                                                            'type' => '5655'
                                                          },
                                                   '1' => {
                                                            'name' => 'pdn',
                                                            'offset' => '16',
                                                            'type' => '1664'
                                                          },
                                                   '2' => {
                                                            'name' => 'refcount',
                                                            'offset' => '20',
                                                            'type' => '14255'
                                                          },
                                                   '3' => {
                                                            'name' => 'mprotection_domain',
                                                            'offset' => '24',
                                                            'type' => '19410'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_pd',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '19410' => {
                                       'BaseType' => '19332',
                                       'Name' => 'struct mlx5_pd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19416' => {
                                       'BaseType' => '19269',
                                       'Name' => 'struct mlx5_td*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '196093' => {
                                        'BaseType' => '48678',
                                        'Name' => 'struct mlx5dv_clock_info*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1964' => {
                                      'BaseType' => '1909',
                                      'Name' => 'struct ib_uverbs_flow_action_esp_encap*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1970' => {
                                      'Header' => undef,
                                      'Line' => '195',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'spi',
                                                           'offset' => '0',
                                                           'type' => '1717'
                                                         },
                                                  '1' => {
                                                           'name' => 'seq',
                                                           'offset' => '4',
                                                           'type' => '1717'
                                                         },
                                                  '2' => {
                                                           'name' => 'tfc_pad',
                                                           'offset' => '8',
                                                           'type' => '1717'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '12',
                                                           'type' => '1717'
                                                         },
                                                  '4' => {
                                                           'name' => 'hard_limit_pkts',
                                                           'offset' => '16',
                                                           'type' => '1729'
                                                         }
                                                },
                                      'Name' => 'struct ib_uverbs_flow_action_esp',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '19793' => {
                                       'BaseType' => '59',
                                       'Name' => 'unsigned int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19799' => {
                                       'Header' => undef,
                                       'Line' => '539',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dv_devx_uar',
                                                            'offset' => '0',
                                                            'type' => '15319'
                                                          },
                                                   '1' => {
                                                            'name' => 'context',
                                                            'offset' => '40',
                                                            'type' => '2485'
                                                          }
                                                 },
                                       'Name' => 'struct mlx5_devx_uar',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '2088' => {
                                      'Header' => undef,
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_NODE_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_NODE_CA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_NODE_SWITCH',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_NODE_ROUTER',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_NODE_RNIC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_NODE_USNIC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'IBV_NODE_USNIC_UDP',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'IBV_NODE_UNSPECIFIED',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum ibv_node_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2155' => {
                                      'Header' => undef,
                                      'Line' => '105',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_TRANSPORT_UNKNOWN',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_TRANSPORT_IB',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_TRANSPORT_IWARP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'IBV_TRANSPORT_USNIC_UDP',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'IBV_TRANSPORT_UNSPECIFIED',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum ibv_transport_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '219' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2210' => {
                                      'Header' => undef,
                                      'Line' => '148',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'IBV_ATOMIC_NONE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'IBV_ATOMIC_HCA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'IBV_ATOMIC_GLOB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum ibv_atomic_cap',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '221481' => {
                                        'BaseType' => '1640',
                                        'Name' => 'uint8_t[16]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '2247' => {
                                      'Header' => undef,
                                      'Line' => '154',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '314'
                                                         },
                                                  '1' => {
                                                           'name' => 'log_align_req',
                                                           'offset' => '8',
                                                           'type' => '1664'
                                                         },
                                                  '2' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '12',
                                                           'type' => '1664'
                                                         }
                                                },
                                      'Name' => 'struct ibv_alloc_dm_attr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2300' => {
                                      'Header' => undef,
                                      'Line' => '160',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'context',
                                                           'offset' => '0',
                                                           'type' => '2485'
                                                         },
                                                  '1' => {
                                                           'name' => 'memcpy_to_dm',
                                                           'offset' => '8',
                                                           'type' => '2527'
                                                         },
                                                  '2' => {
                                                           'name' => 'memcpy_from_dm',
                                                           'offset' => '16',
                                                           'type' => '2563'
                                                         },
                                                  '3' => {
                                                           'name' => 'comp_mask',
                                                           'offset' => '24',
                                                           'type' => '1664'
                                                         }
                                                },
                                      'Name' => 'struct ibv_dm',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '233' => {
                                     'BaseType' => '244',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '234980' => {
                                        'Header' => undef,
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_RX',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_NIC_TX',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_FDB',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_RX',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_TABLE_TYPE_RDMA_TX',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5_ib_uapi_flow_table_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '235029' => {
                                        'Header' => undef,
                                        'Line' => '50',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TUNNEL_TO_L2',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L2_TUNNEL',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L3_TUNNEL_TO_L2',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5_IB_UAPI_FLOW_ACTION_PACKET_REFORMAT_TYPE_L2_TO_L3_TUNNEL',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5_ib_uapi_flow_action_packet_reformat_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '235564' => {
                                        'Header' => undef,
                                        'Line' => '305',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'match_sz',
                                                             'offset' => '0',
                                                             'type' => '314'
                                                           },
                                                    '1' => {
                                                             'name' => 'match_buf',
                                                             'offset' => '8',
                                                             'type' => '235607'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_flow_match_parameters',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '235607' => {
                                        'BaseType' => '1681',
                                        'Name' => 'uint64_t[]',
                                        'Size' => '8',
                                        'Type' => 'Array'
                                      },
                          '235622' => {
                                        'BaseType' => '235564',
                                        'Name' => 'struct mlx5dv_flow_match_parameters*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '235628' => {
                                        'Header' => undef,
                                        'Line' => '332',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DEST_IBV_QP',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DROP',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_IBV_COUNTER',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_IBV_FLOW_ACTION',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_TAG',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DEST_DEVX',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_COUNTERS_DEVX',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'MLX5DV_FLOW_ACTION_DEFAULT_MISS',
                                                             'value' => '7'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5dv_flow_action_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '235696' => {
                                        'Header' => undef,
                                        'Line' => '345',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qp',
                                                             'offset' => '0',
                                                             'type' => '4632'
                                                           },
                                                    '1' => {
                                                             'name' => 'counter',
                                                             'offset' => '0',
                                                             'type' => '10445'
                                                           },
                                                    '2' => {
                                                             'name' => 'action',
                                                             'offset' => '0',
                                                             'type' => '13218'
                                                           },
                                                    '3' => {
                                                             'name' => 'tag_value',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           },
                                                    '4' => {
                                                             'name' => 'obj',
                                                             'offset' => '0',
                                                             'type' => '235870'
                                                           }
                                                  },
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '235771' => {
                                        'Header' => undef,
                                        'Line' => '706',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '2485'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '1664'
                                                           },
                                                    '2' => {
                                                             'name' => 'type',
                                                             'offset' => '12',
                                                             'type' => '243485'
                                                           },
                                                    '3' => {
                                                             'name' => 'object_id',
                                                             'offset' => '16',
                                                             'type' => '1664'
                                                           },
                                                    '4' => {
                                                             'name' => 'rx_icm_addr',
                                                             'offset' => '24',
                                                             'type' => '1681'
                                                           },
                                                    '5' => {
                                                             'name' => 'log_obj_range',
                                                             'offset' => '32',
                                                             'type' => '1640'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_devx_obj',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '235870' => {
                                        'BaseType' => '235771',
                                        'Name' => 'struct mlx5dv_devx_obj*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '235876' => {
                                        'Header' => undef,
                                        'Line' => '343',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '235628'
                                                           },
                                                    '1' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '235696'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_flow_action_attr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '236201' => {
                                        'Header' => undef,
                                        'Line' => '1269',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'umem_id',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_devx_umem',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '236315' => {
                                        'Header' => undef,
                                        'Line' => '1435',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5DV_DR_DOMAIN_TYPE_NIC_RX',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5DV_DR_DOMAIN_TYPE_NIC_TX',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'MLX5DV_DR_DOMAIN_TYPE_FDB',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5dv_dr_domain_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '236353' => {
                                        'Header' => undef,
                                        'Line' => '1447',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next_table',
                                                             'offset' => '0',
                                                             'type' => '236577'
                                                           },
                                                    '1' => {
                                                             'name' => 'active',
                                                             'offset' => '8',
                                                             'type' => '1640'
                                                           },
                                                    '2' => {
                                                             'name' => 'reg_c_index',
                                                             'offset' => '9',
                                                             'type' => '1640'
                                                           },
                                                    '3' => {
                                                             'name' => 'flow_meter_parameter_sz',
                                                             'offset' => '16',
                                                             'type' => '314'
                                                           },
                                                    '4' => {
                                                             'name' => 'flow_meter_parameter',
                                                             'offset' => '24',
                                                             'type' => '219'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_flow_meter_attr',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '236438' => {
                                        'Header' => undef,
                                        'Line' => '836',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dmn',
                                                             'offset' => '0',
                                                             'type' => '248919'
                                                           },
                                                    '1' => {
                                                             'name' => 'rx',
                                                             'offset' => '8',
                                                             'type' => '248870'
                                                           },
                                                    '2' => {
                                                             'name' => 'tx',
                                                             'offset' => '24',
                                                             'type' => '248870'
                                                           },
                                                    '3' => {
                                                             'name' => 'level',
                                                             'offset' => '40',
                                                             'type' => '1664'
                                                           },
                                                    '4' => {
                                                             'name' => 'table_type',
                                                             'offset' => '44',
                                                             'type' => '1664'
                                                           },
                                                    '5' => {
                                                             'name' => 'matcher_list',
                                                             'offset' => '48',
                                                             'type' => '14010'
                                                           },
                                                    '6' => {
                                                             'name' => 'devx_obj',
                                                             'offset' => '64',
                                                             'type' => '235870'
                                                           },
                                                    '7' => {
                                                             'name' => 'refcount',
                                                             'offset' => '72',
                                                             'type' => '128'
                                                           },
                                                    '8' => {
                                                             'name' => 'tbl_list',
                                                             'offset' => '80',
                                                             'type' => '13964'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_table',
                                        'Size' => '96',
                                        'Type' => 'Struct'
                                      },
                          '236577' => {
                                        'BaseType' => '236438',
                                        'Name' => 'struct mlx5dv_dr_table*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '236583' => {
                                        'Header' => undef,
                                        'Line' => '1455',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sample_ratio',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           },
                                                    '1' => {
                                                             'name' => 'default_next_table',
                                                             'offset' => '8',
                                                             'type' => '236577'
                                                           },
                                                    '2' => {
                                                             'name' => 'num_sample_actions',
                                                             'offset' => '16',
                                                             'type' => '1664'
                                                           },
                                                    '3' => {
                                                             'name' => 'sample_actions',
                                                             'offset' => '24',
                                                             'type' => '236717'
                                                           },
                                                    '4' => {
                                                             'name' => 'action',
                                                             'offset' => '32',
                                                             'type' => '1753'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_flow_sampler_attr',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '2366' => {
                                      'Header' => undef,
                                      'Line' => '1967',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'device',
                                                           'offset' => '0',
                                                           'type' => '10845'
                                                         },
                                                  '1' => {
                                                           'name' => 'ops',
                                                           'offset' => '8',
                                                           'type' => '11005'
                                                         },
                                                  '2' => {
                                                           'name' => 'cmd_fd',
                                                           'offset' => '264',
                                                           'type' => '128'
                                                         },
                                                  '3' => {
                                                           'name' => 'async_fd',
                                                           'offset' => '268',
                                                           'type' => '128'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_comp_vectors',
                                                           'offset' => '272',
                                                           'type' => '128'
                                                         },
                                                  '5' => {
                                                           'name' => 'mutex',
                                                           'offset' => '280',
                                                           'type' => '825'
                                                         },
                                                  '6' => {
                                                           'name' => 'abi_compat',
                                                           'offset' => '320',
                                                           'type' => '219'
                                                         }
                                                },
                                      'Name' => 'struct ibv_context',
                                      'Size' => '328',
                                      'Type' => 'Struct'
                                    },
                          '236668' => {
                                        'Header' => undef,
                                        'Line' => '899',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'action_type',
                                                             'offset' => '0',
                                                             'type' => '243912'
                                                           },
                                                    '1' => {
                                                             'name' => 'refcount',
                                                             'offset' => '4',
                                                             'type' => '128'
                                                           },
                                                    '2' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '250329'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_action',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '236717' => {
                                        'BaseType' => '236723',
                                        'Name' => 'struct mlx5dv_dr_action**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '236723' => {
                                        'BaseType' => '236668',
                                        'Name' => 'struct mlx5dv_dr_action*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '236755' => {
                                        'Header' => undef,
                                        'Line' => '1512',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5DV_DR_ACTION_DEST',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5DV_DR_ACTION_DEST_REFORMAT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5dv_dr_action_dest_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '236787' => {
                                        'Header' => undef,
                                        'Line' => '1517',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'reformat',
                                                             'offset' => '0',
                                                             'type' => '236723'
                                                           },
                                                    '1' => {
                                                             'name' => 'dest',
                                                             'offset' => '8',
                                                             'type' => '236723'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_action_dest_reformat',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '236830' => {
                                        'Header' => undef,
                                        'Line' => '1524',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dest',
                                                             'offset' => '0',
                                                             'type' => '236723'
                                                           },
                                                    '1' => {
                                                             'name' => 'dest_reformat',
                                                             'offset' => '0',
                                                             'type' => '236867'
                                                           }
                                                  },
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '236867' => {
                                        'BaseType' => '236787',
                                        'Name' => 'struct mlx5dv_dr_action_dest_reformat*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '236873' => {
                                        'Header' => undef,
                                        'Line' => '1522',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '236755'
                                                           },
                                                    '1' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '236830'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_dr_action_dest_attr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '236978' => {
                                        'BaseType' => '1640',
                                        'Name' => 'uint8_t[64]',
                                        'Size' => '64',
                                        'Type' => 'Array'
                                      },
                          '243442' => {
                                        'Header' => undef,
                                        'Line' => '687',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'context',
                                                             'offset' => '0',
                                                             'type' => '2485'
                                                           },
                                                    '1' => {
                                                             'name' => 'handle',
                                                             'offset' => '8',
                                                             'type' => '1664'
                                                           }
                                                  },
                                        'Name' => 'struct mlx5dv_flow_matcher',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '243485' => {
                                        'Header' => undef,
                                        'Line' => '692',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'MLX5_DEVX_FLOW_TABLE',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'MLX5_DEVX_FLOW_COUNTER',
                                                             'value' => '2'
                                                           },
                                                    '10' => {
                                                              'name' => 'MLX5_DEVX_ASO_FLOW_METER',
                                                              'value' => '11'
                                                            },
                                                    '2' => {
                                                             'name' => 'MLX5_DEVX_FLOW_METER',
                                                             'value' => '3'
                                                           },
                                                    '3' => {
                                                             'name' => 'MLX5_DEVX_QP',
                                                             'value' => '4'
                                                           },
                                                    '4' => {
                                                             'name' => 'MLX5_DEVX_PKT_REFORMAT_CTX',
                                                             'value' => '5'
                                                           },
                                                    '5' => {
                                                             'name' => 'MLX5_DEVX_TIR',
                                                             'value' => '6'
                                                           },
                                                    '6' => {
                                                             'name' => 'MLX5_DEVX_FLOW_GROUP',
                                                             'value' => '7'
                                                           },
                                                    '7' => {
                                                             'name' => 'MLX5_DEVX_FLOW_TABLE_ENTRY',
                                                             'value' => '8'
                                                           },
                                                    '8' => {
                                                             'name' => 'MLX5_DEVX_FLOW_SAMPLER',
                                                             'value' => '9'
                                                           },
                                                    '9' => {
                                                             'name' => 'MLX5_DEVX_ASO_FIRST_HIT',
                                                             'value' => '10'
                                                           }
                                                  },
                                        'Name' => 'enum mlx5_devx_obj_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '243640' => {
                                        'Header' => undef,
                                        'Line' => '60',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'DR_CHUNK_SIZE_1',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'DR_CHUNK_SIZE_MIN',
                                                             'value' => '0'
                                                           },
                                                    '10' => {
                                                              'name' => 'DR_CHUNK_SIZE_512',
                                                              'value' => '9'
                                                            },
                                                    '11' => {
                                                              'name' => 'DR_CHUNK_SIZE_1K',
                                                              'value' => '10'
                                                            },
                                                    '12' => {
                                                              'name' => 'DR_CHUNK_SIZE_2K',
                                                              'value' => '11'
                                                            },
                                                    '13' => {
                                                              'name' => 'DR_CHUNK_SIZE_4K',
                                                              'value' => '12'
                                                            },
                                                    '14' => {
                                                              'name' => 'DR_CHUNK_SIZE_8K',
                                                              'value' => '13'
                                                            },
                                                    '15' => {
                                                              'name' => 'DR_CHUNK_SIZE_16K',
                                                              'value' => '14'
                                                            },
                                                    '16' => {
                                                              'name' => 'DR_CHUNK_SIZE_32K',
                                                              'value' => '15'
                                                            },
                                                    '17' => {
                                                              'name' => 'DR_CHUNK_SIZE_64K',
                                                              'value' => '16'
                                                            },
                                                    '18' => {
                                                              'name' => 'DR_CHUNK_SIZE_128K',
                                                              'value' => '17'
                                                            },
                                                    '19' => {
                                                              'name' => 'DR_CHUNK_SIZE_256K',
                                                              'value' => '18'
                                                            },
                                                    '2' => {
                                                             'name' => 'DR_CHUNK_SIZE_2',
                                                             'value' => '1'
                                                           },
                                                    '20' => {
                                                              'name' => 'DR_CHUNK_SIZE_512K',
                                                              'value' => '19'
                                                            },
                                                    '21' => {
                                                              'name' => 'DR_CHUNK_SIZE_1024K',
                                                              'value' => '20'
                                                            },
                                                    '22' => {
                                                              'name' => 'DR_CHUNK_SIZE_2048K',
                                                              'value' => '21'
                                                            },
                                                    '23' => {
                                                              'name' => 'DR_CHUNK_SIZE_MAX',
                                                              'value' => '22'
                                                            },
                                                    '3' => {
                                                             'name' => 'DR_CHUNK_SIZE_4',
                                                             'value' => '2'
                                                           },
                                                    '4' => {
                                                             'name' => 'DR_CHUNK_SIZE_8',
                                                             'value' => '3'
                                                           },
                                                    '5' => {
                                                             'name' => 'DR_CHUNK_SIZE_16',
                                                             'value' => '4'
                                                           },
                                                    '6' => {
                                                             'name' => 'DR_CHUNK_SIZE_32',
                                                             'value' => '5'
                                                           },
                                                    '7' => {
                                                             'name' => 'DR_CHUNK_SIZE_64',
                                                             'value' => '6'
                                                           },
                                                    '8' => {
                                                             'name' => 'DR_CHUNK_SIZE_128',
                                                             'value' => '7'
                                                           },
                                                    '9' => {
                                                             'name' => 'DR_CHUNK_SIZE_256',
                                                             'value' => '8'
                                                           }
                                                  },
                                        'Name' => 'enum dr_icm_chunk_size',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '243803' => {
                                        'Header' => undef,
                                        'Line' => '106',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'DR_STE_TYPE_TX',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'DR_STE_TYPE_RX',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'DR_STE_TYPE_MODIFY_PKT',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum dr_ste_entry_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '243912' => {
                                        'Header' => undef,
                                        'Line' => '140',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'DR_ACTION_TYP_TNL_L2_TO_L2',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'DR_ACTION_TYP_L2_TO_TNL_L2',
                                                             'value' => '1'
                                                           },
                                                    '10' => {
                                                              'name' => 'DR_ACTION_TYP_VPORT',
                                                              'value' => '10'
                                                            },
                                                    '11' => {
                                                              'name' => 'DR_ACTION_TYP_METER',
                                                              'value' => '11'
                                                            },
                                                    '12' => {
                                                              'name' => 'DR_ACTION_TYP_MISS',
                                                              'value' => '12'
                                                            },
                                                    '13' => {
                                                              'name' => 'DR_ACTION_TYP_SAMPLER',
                                                              'value' => '13'
                                                            },
                                                    '14' => {
                                                              'name' => 'DR_ACTION_TYP_DEST_ARRAY',
                                                              'value' => '14'
                                                            },
                                                    '15' => {
                                                              'name' => 'DR_ACTION_TYP_POP_VLAN',
                                                              'value' => '15'
                                                            },
                                                    '16' => {
                                                              'name' => 'DR_ACTION_TYP_PUSH_VLAN',
                                                              'value' => '16'
                                                            },
                                                    '17' => {
                                                              'name' => 'DR_ACTION_TYP_ASO_FIRST_HIT',
                                                              'value' => '17'
                                                            },
                                                    '18' => {
                                                              'name' => 'DR_ACTION_TYP_ASO_FLOW_METER',
                                                              'value' => '18'
                                                            },
                                                    '19' => {
                                                              'name' => 'DR_ACTION_TYP_MAX',
                                                              'value' => '19'
                                                            },
                                                    '2' => {
                                                             'name' => 'DR_ACTION_TYP_TNL_L3_TO_L2',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'DR_ACTION_TYP_L2_TO_TNL_L3',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'DR_ACTION_TYP_DROP',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'DR_ACTION_TYP_QP',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'DR_ACTION_TYP_FT',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'DR_ACTION_TYP_CTR',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'DR_ACTION_TYP_TAG',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'DR_ACTION_TYP_MODIFY_HDR',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum dr_action_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '244' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '244051' => {
                                        'Header' => undef,
                                        'Line' => '187',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hw_ste',
                                                             'offset' => '0',
                                                             'type' => '6864'
                                                           },
                                                    '1' => {
                                                             'name' => 'refcount',
                                                             'offset' => '8',
                                                             'type' => '14255'
                                                           },
                                                    '2' => {
                                                             'name' => 'miss_list_node',
                                                             'offset' => '16',
                                                             'type' => '13964'
                                                           },
                                                    '3' => {
                                                             'name' => 'htbl',
                                                             'offset' => '32',
                                                             'type' => '244307'
                                                           },
                                                    '4' => {
                                                             'name' => 'next_htbl',
                                                             'offset' => '40',
                                                             'type' => '244307'
                                                           },
                                                    '5' => {
                                                             'name' => 'rule_rx_tx',
                                                             'offset' => '48',
                                                             'type' => '244356'
                                                           },
                                                    '6' => {
                                                             'name' => 'ste_chain_location',
                                                             'offset' => '56',
                                                             'type' => '1640'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '244163' => {
                                        'Header' => undef,
                                        'Line' => '219',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lu_type',
                                                             'offset' => '0',
                                                             'type' => '1652'
                                                           },
                                                    '1' => {
                                                             'name' => 'byte_mask',
                                                             'offset' => '2',
                                                             'type' => '1652'
                                                           },
                                                    '2' => {
                                                             'name' => 'refcount',
                                                             'offset' => '4',
                                                             'type' => '14255'
                                                           },
                                                    '3' => {
                                                             'name' => 'chunk',
                                                             'offset' => '8',
                                                             'type' => '244604'
                                                           },
                                                    '4' => {
                                                             'name' => 'ste_arr',
                                                             'offset' => '16',
                                                             'type' => '244610'
                                                           },
                                                    '5' => {
                                                             'name' => 'hw_ste_arr',
                                                             'offset' => '24',
                                                             'type' => '6864'
                                                           },
                                                    '6' => {
                                                             'name' => 'miss_list',
                                                             'offset' => '32',
                                                             'type' => '28616'
                                                           },
                                                    '7' => {
                                                             'name' => 'chunk_size',
                                                             'offset' => '40',
                                                             'type' => '243640'
                                                           },
                                                    '8' => {
                                                             'name' => 'pointing_ste',
                                                             'offset' => '48',
                                                             'type' => '244610'
                                                           },
                                                    '9' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '56',
                                                             'type' => '244362'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_htbl',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '244307' => {
                                        'BaseType' => '244163',
                                        'Name' => 'struct dr_ste_htbl*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '244313' => {
                                        'Header' => undef,
                                        'Line' => '994',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'nic_matcher',
                                                             'offset' => '0',
                                                             'type' => '250552'
                                                           },
                                                    '1' => {
                                                             'name' => 'last_rule_ste',
                                                             'offset' => '8',
                                                             'type' => '244610'
                                                           }
                                                  },
                                        'Name' => 'struct dr_rule_rx_tx',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '244356' => {
                                        'BaseType' => '244313',
                                        'Name' => 'struct dr_rule_rx_tx*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '244362' => {
                                        'Header' => undef,
                                        'Line' => '207',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'num_of_valid_entries',
                                                             'offset' => '0',
                                                             'type' => '128'
                                                           },
                                                    '1' => {
                                                             'name' => 'num_of_collisions',
                                                             'offset' => '4',
                                                             'type' => '128'
                                                           },
                                                    '2' => {
                                                             'name' => 'increase_threshold',
                                                             'offset' => '8',
                                                             'type' => '128'
                                                           },
                                                    '3' => {
                                                             'name' => 'may_grow',
                                                             'offset' => '12',
                                                             'type' => '1633'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_htbl_ctrl',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '244435' => {
                                        'Header' => undef,
                                        'Line' => '1020',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'buddy_mem',
                                                             'offset' => '0',
                                                             'type' => '250779'
                                                           },
                                                    '1' => {
                                                             'name' => 'chunk_list',
                                                             'offset' => '8',
                                                             'type' => '13964'
                                                           },
                                                    '10' => {
                                                              'name' => 'miss_list',
                                                              'offset' => '80',
                                                              'type' => '28616'
                                                            },
                                                    '2' => {
                                                             'name' => 'rkey',
                                                             'offset' => '24',
                                                             'type' => '1664'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_of_entries',
                                                             'offset' => '28',
                                                             'type' => '1664'
                                                           },
                                                    '4' => {
                                                             'name' => 'byte_size',
                                                             'offset' => '32',
                                                             'type' => '1664'
                                                           },
                                                    '5' => {
                                                             'name' => 'icm_addr',
                                                             'offset' => '40',
                                                             'type' => '1681'
                                                           },
                                                    '6' => {
                                                             'name' => 'mr_addr',
                                                             'offset' => '48',
                                                             'type' => '1681'
                                                           },
                                                    '7' => {
                                                             'name' => 'seg',
                                                             'offset' => '56',
                                                             'type' => '1664'
                                                           },
                                                    '8' => {
                                                             'name' => 'ste_arr',
                                                             'offset' => '64',
                                                             'type' => '244610'
                                                           },
                                                    '9' => {
                                                             'name' => 'hw_ste_arr',
                                                             'offset' => '72',
                                                             'type' => '6864'
                                                           }
                                                  },
                                        'Name' => 'struct dr_icm_chunk',
                                        'Size' => '88',
                                        'Type' => 'Struct'
                                      },
                          '244604' => {
                                        'BaseType' => '244435',
                                        'Name' => 'struct dr_icm_chunk*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '244610' => {
                                        'BaseType' => '244051',
                                        'Name' => 'struct dr_ste*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '244622' => {
                                        'Header' => undef,
                                        'Line' => '250',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'inner',
                                                             'offset' => '0',
                                                             'type' => '1633'
                                                           },
                                                    '1' => {
                                                             'name' => 'rx',
                                                             'offset' => '1',
                                                             'type' => '1633'
                                                           },
                                                    '2' => {
                                                             'name' => 'caps',
                                                             'offset' => '8',
                                                             'type' => '245177'
                                                           },
                                                    '3' => {
                                                             'name' => 'lu_type',
                                                             'offset' => '16',
                                                             'type' => '1652'
                                                           },
                                                    '4' => {
                                                             'name' => 'byte_mask',
                                                             'offset' => '18',
                                                             'type' => '1652'
                                                           },
                                                    '5' => {
                                                             'name' => 'bit_mask',
                                                             'offset' => '20',
                                                             'type' => '221481'
                                                           },
                                                    '6' => {
                                                             'name' => 'ste_build_tag_func',
                                                             'offset' => '40',
                                                             'type' => '245321'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_build',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '244728' => {
                                        'Header' => undef,
                                        'Line' => '682',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'gvmi',
                                                             'offset' => '0',
                                                             'type' => '1652'
                                                           },
                                                    '1' => {
                                                             'name' => 'nic_rx_drop_address',
                                                             'offset' => '8',
                                                             'type' => '1681'
                                                           },
                                                    '10' => {
                                                              'name' => 'flex_parser_id_icmp_dw0',
                                                              'offset' => '68',
                                                              'type' => '1640'
                                                            },
                                                    '11' => {
                                                              'name' => 'flex_parser_id_icmp_dw1',
                                                              'offset' => '69',
                                                              'type' => '1640'
                                                            },
                                                    '12' => {
                                                              'name' => 'flex_parser_id_icmpv6_dw0',
                                                              'offset' => '70',
                                                              'type' => '1640'
                                                            },
                                                    '13' => {
                                                              'name' => 'flex_parser_id_icmpv6_dw1',
                                                              'offset' => '71',
                                                              'type' => '1640'
                                                            },
                                                    '14' => {
                                                              'name' => 'flex_parser_id_geneve_opt_0',
                                                              'offset' => '72',
                                                              'type' => '1640'
                                                            },
                                                    '15' => {
                                                              'name' => 'flex_parser_id_mpls_over_gre',
                                                              'offset' => '73',
                                                              'type' => '1640'
                                                            },
                                                    '16' => {
                                                              'name' => 'flex_parser_id_mpls_over_udp',
                                                              'offset' => '74',
                                                              'type' => '1640'
                                                            },
                                                    '17' => {
                                                              'name' => 'max_ft_level',
                                                              'offset' => '75',
                                                              'type' => '1640'
                                                            },
                                                    '18' => {
                                                              'name' => 'sw_format_ver',
                                                              'offset' => '76',
                                                              'type' => '1640'
                                                            },
                                                    '19' => {
                                                              'name' => 'isolate_vl_tc',
                                                              'offset' => '77',
                                                              'type' => '1633'
                                                            },
                                                    '2' => {
                                                             'name' => 'nic_tx_drop_address',
                                                             'offset' => '16',
                                                             'type' => '1681'
                                                           },
                                                    '20' => {
                                                              'name' => 'eswitch_manager',
                                                              'offset' => '78',
                                                              'type' => '1633'
                                                            },
                                                    '21' => {
                                                              'name' => 'rx_sw_owner',
                                                              'offset' => '79',
                                                              'type' => '1633'
                                                            },
                                                    '22' => {
                                                              'name' => 'tx_sw_owner',
                                                              'offset' => '80',
                                                              'type' => '1633'
                                                            },
                                                    '23' => {
                                                              'name' => 'fdb_sw_owner',
                                                              'offset' => '81',
                                                              'type' => '1633'
                                                            },
                                                    '24' => {
                                                              'name' => 'rx_sw_owner_v2',
                                                              'offset' => '82',
                                                              'type' => '1633'
                                                            },
                                                    '25' => {
                                                              'name' => 'tx_sw_owner_v2',
                                                              'offset' => '83',
                                                              'type' => '1633'
                                                            },
                                                    '26' => {
                                                              'name' => 'fdb_sw_owner_v2',
                                                              'offset' => '84',
                                                              'type' => '1633'
                                                            },
                                                    '27' => {
                                                              'name' => 'num_vports',
                                                              'offset' => '88',
                                                              'type' => '1664'
                                                            },
                                                    '28' => {
                                                              'name' => 'vports_caps',
                                                              'offset' => '96',
                                                              'type' => '247651'
                                                            },
                                                    '29' => {
                                                              'name' => 'roce_caps',
                                                              'offset' => '104',
                                                              'type' => '247594'
                                                            },
                                                    '3' => {
                                                             'name' => 'nic_tx_allow_address',
                                                             'offset' => '24',
                                                             'type' => '1681'
                                                           },
                                                    '30' => {
                                                              'name' => 'prio_tag_required',
                                                              'offset' => '107',
                                                              'type' => '1633'
                                                            },
                                                    '4' => {
                                                             'name' => 'esw_rx_drop_address',
                                                             'offset' => '32',
                                                             'type' => '1681'
                                                           },
                                                    '5' => {
                                                             'name' => 'esw_tx_drop_address',
                                                             'offset' => '40',
                                                             'type' => '1681'
                                                           },
                                                    '6' => {
                                                             'name' => 'log_icm_size',
                                                             'offset' => '48',
                                                             'type' => '1664'
                                                           },
                                                    '7' => {
                                                             'name' => 'log_modify_hdr_icm_size',
                                                             'offset' => '52',
                                                             'type' => '1640'
                                                           },
                                                    '8' => {
                                                             'name' => 'hdr_modify_icm_addr',
                                                             'offset' => '56',
                                                             'type' => '1681'
                                                           },
                                                    '9' => {
                                                             'name' => 'flex_protocols',
                                                             'offset' => '64',
                                                             'type' => '1664'
                                                           }
                                                  },
                                        'Name' => 'struct dr_devx_caps',
                                        'Size' => '112',
                                        'Type' => 'Struct'
                                      },
                          '245177' => {
                                        'BaseType' => '244728',
                                        'Name' => 'struct dr_devx_caps*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '245208' => {
                                        'BaseType' => '245214',
                                        'Name' => 'struct dr_match_param*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '245214' => {
                                        'Header' => undef,
                                        'Line' => '648',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'outer',
                                                             'offset' => '0',
                                                             'type' => '245763'
                                                           },
                                                    '1' => {
                                                             'name' => 'misc',
                                                             'offset' => '64',
                                                             'type' => '246241'
                                                           },
                                                    '2' => {
                                                             'name' => 'inner',
                                                             'offset' => '108',
                                                             'type' => '245763'
                                                           },
                                                    '3' => {
                                                             'name' => 'misc2',
                                                             'offset' => '172',
                                                             'type' => '246715'
                                                           },
                                                    '4' => {
                                                             'name' => 'misc3',
                                                             'offset' => '228',
                                                             'type' => '247142'
                                                           },
                                                    '5' => {
                                                             'name' => 'misc4',
                                                             'offset' => '276',
                                                             'type' => '247410'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_param',
                                        'Size' => '308',
                                        'Type' => 'Struct'
                                      },
                          '245315' => {
                                        'BaseType' => '244622',
                                        'Name' => 'struct dr_ste_build*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '245321' => {
                                        'Name' => 'int(*)(struct dr_match_param*, struct dr_ste_build*, uint8_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '245208'
                                                            },
                                                     '1' => {
                                                              'type' => '245315'
                                                            },
                                                     '2' => {
                                                              'type' => '6864'
                                                            }
                                                   },
                                        'Return' => '128',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '245327' => {
                                        'Header' => undef,
                                        'Line' => '301',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'set',
                                                             'offset' => '0',
                                                             'type' => '1633'
                                                           }
                                                  },
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '245352' => {
                                        'Header' => undef,
                                        'Line' => '304',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'initial_color',
                                                             'offset' => '0',
                                                             'type' => '1640'
                                                           }
                                                  },
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '245377' => {
                                        'Header' => undef,
                                        'Line' => '300',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'first_hit',
                                                             'offset' => '0',
                                                             'type' => '245327'
                                                           },
                                                    '1' => {
                                                             'name' => 'flow_meter',
                                                             'offset' => '0',
                                                             'type' => '245352'
                                                           }
                                                  },
                                        'Size' => '1',
                                        'Type' => 'Union'
                                      },
                          '245414' => {
                                        'Header' => undef,
                                        'Line' => '296',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'devx_obj',
                                                             'offset' => '0',
                                                             'type' => '235870'
                                                           },
                                                    '1' => {
                                                             'name' => 'offset',
                                                             'offset' => '8',
                                                             'type' => '1664'
                                                           },
                                                    '2' => {
                                                             'name' => 'dest_reg_id',
                                                             'offset' => '12',
                                                             'type' => '1640'
                                                           },
                                                    '3' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '13',
                                                             'type' => '245377'
                                                           }
                                                  },
                                        'Name' => 'struct dr_action_aso',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '245477' => {
                                        'Header' => undef,
                                        'Line' => '324',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'count',
                                                             'offset' => '0',
                                                             'type' => '128'
                                                           },
                                                    '1' => {
                                                             'name' => 'headers',
                                                             'offset' => '4',
                                                             'type' => '245516'
                                                           }
                                                  },
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '245516' => {
                                        'BaseType' => '1664',
                                        'Name' => 'uint32_t[2]',
                                        'Size' => '8',
                                        'Type' => 'Array'
                                      },
                          '245532' => {
                                        'Header' => undef,
                                        'Line' => '310',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'modify_index',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           },
                                                    '1' => {
                                                             'name' => 'modify_actions',
                                                             'offset' => '4',
                                                             'type' => '1652'
                                                           },
                                                    '10' => {
                                                              'name' => 'reformat_id',
                                                              'offset' => '36',
                                                              'type' => '1664'
                                                            },
                                                    '11' => {
                                                              'name' => 'reformat_size',
                                                              'offset' => '40',
                                                              'type' => '1664'
                                                            },
                                                    '12' => {
                                                              'name' => 'prio_tag_required',
                                                              'offset' => '44',
                                                              'type' => '1633'
                                                            },
                                                    '13' => {
                                                              'name' => 'vlans',
                                                              'offset' => '48',
                                                              'type' => '245477'
                                                            },
                                                    '14' => {
                                                              'name' => 'aso',
                                                              'offset' => '64',
                                                              'type' => '245757'
                                                            },
                                                    '2' => {
                                                             'name' => 'decap_index',
                                                             'offset' => '8',
                                                             'type' => '1664'
                                                           },
                                                    '3' => {
                                                             'name' => 'decap_actions',
                                                             'offset' => '12',
                                                             'type' => '1652'
                                                           },
                                                    '4' => {
                                                             'name' => 'decap_with_vlan',
                                                             'offset' => '14',
                                                             'type' => '1633'
                                                           },
                                                    '5' => {
                                                             'name' => 'final_icm_addr',
                                                             'offset' => '16',
                                                             'type' => '1681'
                                                           },
                                                    '6' => {
                                                             'name' => 'flow_tag',
                                                             'offset' => '24',
                                                             'type' => '1664'
                                                           },
                                                    '7' => {
                                                             'name' => 'ctr_id',
                                                             'offset' => '28',
                                                             'type' => '1664'
                                                           },
                                                    '8' => {
                                                             'name' => 'gvmi',
                                                             'offset' => '32',
                                                             'type' => '1652'
                                                           },
                                                    '9' => {
                                                             'name' => 'hit_gvmi',
                                                             'offset' => '34',
                                                             'type' => '1652'
                                                           }
                                                  },
                                        'Name' => 'struct dr_ste_actions_attr',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '245757' => {
                                        'BaseType' => '245414',
                                        'Name' => 'struct dr_action_aso*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '245763' => {
                                        'Header' => undef,
                                        'Line' => '526',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'smac_47_16',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '16',
                                                             'name' => 'ethertype',
                                                             'offset' => '4',
                                                             'type' => '1664'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '1',
                                                              'name' => 'frag',
                                                              'offset' => '16',
                                                              'type' => '1664'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '1',
                                                              'name' => 'svlan_tag',
                                                              'offset' => '16',
                                                              'type' => '1664'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '1',
                                                              'name' => 'cvlan_tag',
                                                              'offset' => '16',
                                                              'type' => '1664'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '2',
                                                              'name' => 'ip_ecn',
                                                              'offset' => '16',
                                                              'type' => '1664'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '6',
                                                              'name' => 'ip_dscp',
                                                              'offset' => '16',
                                                              'type' => '1664'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '8',
                                                              'name' => 'ip_protocol',
                                                              'offset' => '16',
                                                              'type' => '1664'
                                                            },
                                                    '16' => {
                                                              'bitfield' => '16',
                                                              'name' => 'tcp_dport',
                                                              'offset' => '20',
                                                              'type' => '1664'
                                                            },
                                                    '17' => {
                                                              'bitfield' => '16',
                                                              'name' => 'tcp_sport',
                                                              'offset' => '20',
                                                              'type' => '1664'
                                                            },
                                                    '18' => {
                                                              'bitfield' => '8',
                                                              'name' => 'ip_ttl_hoplimit',
                                                              'offset' => '24',
                                                              'type' => '1664'
                                                            },
                                                    '19' => {
                                                              'bitfield' => '16',
                                                              'name' => 'udp_dport',
                                                              'offset' => '24',
                                                              'type' => '1664'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '16',
                                                             'name' => 'smac_15_0',
                                                             'offset' => '4',
                                                             'type' => '1664'
                                                           },
                                                    '20' => {
                                                              'bitfield' => '16',
                                                              'name' => 'udp_sport',
                                                              'offset' => '28',
                                                              'type' => '1664'
                                                            },
                                                    '21' => {
                                                              'name' => 'src_ip_127_96',
                                                              'offset' => '32',
                                                              'type' => '1664'
                                                            },
                                                    '22' => {
                                                              'name' => 'src_ip_95_64',
                                                              'offset' => '36',
                                                              'type' => '1664'
                                                            },
                                                    '23' => {
                                                              'name' => 'src_ip_63_32',
                                                              'offset' => '40',
                                                              'type' => '1664'
                                                            },
                                                    '24' => {
                                                              'name' => 'src_ip_31_0',
                                                              'offset' => '44',
                                                              'type' => '1664'
                                                            },
                                                    '25' => {
                                                              'name' => 'dst_ip_127_96',
                                                              'offset' => '48',
                                                              'type' => '1664'
                                                            },
                                                    '26' => {
                                                              'name' => 'dst_ip_95_64',
                                                              'offset' => '52',
                                                              'type' => '1664'
                                                            },
                                                    '27' => {
                                                              'name' => 'dst_ip_63_32',
                                                              'offset' => '56',
                                                              'type' => '1664'
                                                            },
                                                    '28' => {
                                                              'name' => 'dst_ip_31_0',
                                                              'offset' => '60',
                                                              'type' => '1664'
                                                            },
                                                    '3' => {
                                                             'name' => 'dmac_47_16',
                                                             'offset' => '8',
                                                             'type' => '1664'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '12',
                                                             'name' => 'first_vid',
                                                             'offset' => '12',
                                                             'type' => '1664'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'first_cfi',
                                                             'offset' => '12',
                                                             'type' => '1664'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '3',
                                                             'name' => 'first_prio',
                                                             'offset' => '12',
                                                             'type' => '1664'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '16',
                                                             'name' => 'dmac_15_0',
                                                             'offset' => '12',
                                                             'type' => '1664'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '9',
                                                             'name' => 'tcp_flags',
                                                             'offset' => '16',
                                                             'type' => '1664'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '4',
                                                             'name' => 'ip_version',
                                                             'offset' => '16',
                                                             'type' => '1664'
                                                           }
                                                  },
                                        'Name' => 'struct dr_match_spec',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '246241' => {
                                        'Header' => undef,
                                        'Line' => '558',
                                        'Memb' => {
                                                    '0' => {
                                                             'bitfield' => '24',
                                                             'name' => 'source_sqn',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '4',
                                                             'name' => 'source_vhca_port',
                                                             'offset' => '0',
                                                             'type' => '1664'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_second_cfi',
                                                              'offset' => '8',
                                                              'type' => '1664'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '3',
                                                              'name' => 'outer_second_prio',
                                                              'offset' => '8',
                                                              'type' => '1664'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '16',
                                                              'name' => 'gre_protocol',
                                                              'offset' => '8',
                                                              'type' => '1664'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '1',
                                                              'name' => 'inner_second_svlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1664'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_second_svlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1664'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '1',
                                                              'name' => 'inner_second_cvlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1664'
                                                            },
                                                    '16' => {
                                                              'bitfield' => '1',
                                                              'name' => 'outer_second_cvlan_tag',
                                                              'offset' => '12',
                                                              'type' => '1664'
                                                            },
                                                    '17' => {
                                                              'bitfield' => '8',
                                                              'name' => 'gre_key_l',
                                                              'offset' => '12',
                                                              'type' => '1664'
                                                            },
                                                    '18' => {
                                                              'bitfield' => '24',
                                                              'name' => 'gre_key_h',
                                                              'offset' => '16',
